{
    "id": "0c91c458-a828-49f6-8703-77dced1e022b",
    "url": "https://www.glassdoor.com/Job/lead-python-engineer-jobs-SRCH_KO0,20.htm?suggestCount=0&suggestChosen=false&clickSource=searchBtn&typedKeyword=Lead%2520Python%2520Engineer",
    "description": "Description\n\nDo you love to develop creative and impactful communications systems solutions for the nation's most critical challenges?\n\nAre you searching for meaningful work in communications software engineering?\n\nIf so, we 're looking for someone like you to join our team at APL!\n\nWe are seeking an experienced Software Engineer to help us solve the nation 's security challenges. As a member of our team, you will be responsible for the design, development, integration, and test of communications software for the Government across numerous departments and agencies. You will work across a variety of problems and application spaces ranging from national security to civilian and military health. Ultimately, you will join a team whose goal is to build meaningful capabilities to enable the availability of information to decision makers under challenging conditions. You will be joining a hardworking team of engineers and scientists who are passionate about building creative and novel communication systems. Our team is committed to national security. We strive to foster an environment that promotes professional growth and a balanced life. Our team values diversity of thought.\n\nAs a Senior Communications Software Engineer, your primary responsibilities will be to:\nProvide technical contributions and leadership in the development of software systems as part of critical communications systems for the Government\nProvide thought leadership in the areas of communications systems and application software development by teaming with colleagues to propose creative approaches and new concepts to address hard problems.\nWork with other software developers to apply best software development principles to projects.\nYou will architect, develop, integrate, and test software-based command and control, secure communication, and networking systems in operationally-realistic environments, working closely with sponsors to ensure mission success.\nInteract with technical specialists in other fields as part of a multidisciplinary team.\nYou will detail work in technical reports and memoranda. Present work to sponsors and the technical community.\n\n\nQualifications\n\nYou meet our minimum qualifications for the job if you...\nPossess a Bachelor 's degree in Computer Science, Computer Engineering, or another related, technical discipline.\nHave at least ten years of relevant experience in the development of software systems ideally in a Linux environment.\nHave experience leading software projects and managing teams of software developers.\nDemonstrated skill with software development following current software engineering best practices using several of the following languages: C, C++, Python, Java, JavaScript, Typescript, and BASH scripting.\nHave a strong understanding of modern software development practices and tools, including: version control systems (e.g., Git), issue trackers, and test frameworks.\nHave excellent interpersonal skills, work independently, and work in a multi-organizational team.\nAre willing and able to travel on an as needed basis.\nHave the ability to acquire a DoD Top Secret clearance. If selected, you will be subject to a government security clearance investigation and must meet the requirements for access to classified information. Eligibility requirements include U.S. citizenship.\nCan demonstrate that you are fully vaccinated against COVID-19. To ensure the safety and well-being of the community, APL has established a policy requiring that all staff be vaccinated against COVID-19. All staff members must provide proof of full vaccination or have an approved medical or religious accommodation by their start date.\n\nYou 'll go above and beyond our minimum requirements if you...\nPossess a Master 's degree or PhD in Computer Science, Computer Engineering, or another related, technical discipline.\nHave at least fifteen years of relevant experience in the development of software systems ideally in a Linux environment.\nHave exposure to US Government and military communication systems and technologies, voice and video streaming, or conferencing software.\nHave experience and passion for DevOps practices, processes, and tools.\nHave experience using modern frontend and backend software frameworks for software applications.\nHave experience applying software expertise to full project lifecycles, including requirements analysis, design, implementation, and testing.\nHave knowledge of the network layer and above of communication or networking systems.\nHold an active Top Secret security clearance with a SSBI.\nWhy work at APL?\nThe Johns Hopkins University Applied Physics Laboratory (APL) brings world-class expertise to our nation's most critical defense, security, space and science challenges. While we are dedicated to solving complex challenges and pioneering new technologies, what makes us truly outstanding is our culture. We offer a vibrant, welcoming atmosphere where you can bring your authentic self to work, continue to grow, and build strong connections with inspiring teammates.\n\nAt APL, we celebrate our differences and encourage creativity and bold, new ideas. Our employees enjoy generous benefits, including a robust education assistance program, unparalleled retirement contributions, and a healthy work/life balance. APL's campus is located in the Baltimore-Washington metro area. Learn more about our career opportunities at www.jhuapl.edu/careers.\n\n#LI-AG1\n\n\nAbout Us\n\nAPL is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, creed, color, religion, sex, gender identity or expression, sexual orientation, national origin, age, physical or mental disability, genetic information, veteran status, occupation, marital or familial status, political opinion, personal appearance, or any other characteristic protected by applicable law. APL is committed to promoting an innovative environment that embraces diversity, encourages creativity, and supports inclusion of new ideas. In doing so, we are committed to providing reasonable accommodation to individuals of all abilities, including those with disabilities. If you require a reasonable accommodation to participate in any part of the hiring process, please contact Accommodations@jhuapl.edu. Only by ensuring that everyone’s voice is heard are we empowered to be bold, do great things, and make the world a better place.\nApply Now: click Apply Now\nShow Less\nReport",
    "title": "KEY NOT FOUND: ctas.save",
    "company": "Johns Hopkins Applied Physics Laboratory (APL)",
    "location": "Lead Software Engineer - Communication Systems",
    "salary": null,
    "seniority_level": null,
    "employment_type": null,
    "job_function": null,
    "industries": null,
    "hiring_manager": null
}