{
    "id": "18754faa-cd74-4470-a987-c286d75de319",
    "url": "https://www.glassdoor.com/Job/lead-python-engineer-jobs-SRCH_KO0,20.htm?suggestCount=0&suggestChosen=false&clickSource=searchBtn&typedKeyword=Lead%2520Python%2520Engineer",
    "description": "Date Posted:\n2023-01-31-08:00\nCountry:\nUnited States of America\nLocation:\nMA133: Tewksbury, Ma Bldg 3 Concord 50 Apple Hill Drive Concord - Building 3, Tewksbury, MA, 01876 USA\nPosition Role Type:\nOnsite\nTitle: Senior Principal Systems Engineer – Team Lead\nLocation: Tewksbury, MA\nAt Raytheon Missiles & Defense (RMD), you have the opportunity to try new things and make a bigger difference across a broader end-to-end solution, a richer technology and product set, an expanded range of disciplines, a growing global footprint and a more diverse team of colleagues and customers.\nJob Summary:\nThe System Design & Architecture (SD&A) Directorate is the central focus for Mission Systems Integration activities within RMD, responsible for defining customer needs, functional and product architecture, requirements definition and decomposition, Model Based Systems Engineering (MBSE), system performance, and System Security Engineering (SSE).\nThe Early Warning and Defense Operations Systems (EWDOS) Department is seeking for a talented Senior Principal Systems Engineer to join a team of engineers that designs and develops world-class Sensor and Weapon systems in our Tewksbury, MA location.\nWe value diverse skills and experience, so don't hold back. Your qualifications could add tremendous value to our team. Our customers come from all different backgrounds, and so do our employees. If you're passionate about what you could accomplish here, we'd love to hear from you.\n\nResponsibilities to Anticipate:\nThe Dual Band Radar (DBR) Program is looking for a Systems Engineer with experience overseeing verification and validation efforts. The current DBR Federate effort is developing a model of the DBR radar for the CVN-78 (USS Ford) platform. This represents a critical component of a large, enterprise-level modeling and simulation initiative. The Systems Engineer will have responsibilities interfacing with other stakeholders in the Federate community to ensure the DBR model provides needed capabilities. Role also includes developing the approach, artifacts and evidence needed to validate that the DBR Federate represents a high-fidelity representation of the DBR tactical system on CVN-78. Regular interactions with both internal and external stakeholders will be critical to the eventual success of the DBR Federate development and verification efforts. Role includes coming up with a plan for execution of the Federate work scope on DBR and helping to keep other DBR team members aligned. Candidate will need to develop an understanding of the DBR radar system/software capabilities.\nQualifications You Must Have:\nTypically requires a Bachelor’s in Science, Technology, Engineering, or Mathematics (STEM) and 10 years of prior relevant experience, or an Advanced Degree in a related field and 7 years of prior relevant experience. In absence of a degree, 14 years of relevant experience is required.\nExperience with system/software level requirements development and maintenance\nExperience with software development and maintenance\nKnowledge of integration and test\nActive US Secret security clearance\n\nQualifications We Value:\nExperience with system/software level requirements development, documentation and maintenance and/or design of system level software architecture\nExperience and/or knowledge of Verification and Validation\nExperience and/or knowledge of Modeling and Simulation\nProven experience with current air defense programs with specific experience in large, complex systems\nUnderstanding of defense design / planning process\nExperience with radar system concepts; detection, discrimination, track and signal processing algorithms and their behaviors and performance\nKnowledge of Electronic Warfare/Electronic Attack/Electronic Protection Techniques\nPhased Array and Digital Beamforming Technology\nTarget and Threat Modeling\nIntegration and test of large systems\nExcellent communication, technical writing, oral presentation, and interpersonal skills\nProven ability to interface with customers and lead technical solutions to complex User requirements\nKnowledge in MATLAB/Python/C/C++/Java and/or DOORS tools\nExperience with Agile and DevOps\nModel Based System Engineering (MBSE) Development\nWhat We Offer:\nWhether you’re just starting out on your career journey or are an experienced professional, we offer a robust total rewards package that goes above and beyond with compensation; healthcare, wellness, retirement and work/life benefits; career development and recognition programs. Some of the superior benefits we offer include parental (including paternal) leave, flexible work schedules, achievement awards, educational assistance and child/adult backup care.\nAdditional Details:\nClearance Information: This position requires the eligibility to obtain a security clearance. The Defense Industrial Security Clearance Office (DISCO), an agency of the Department of Defense, handles and adjudicates the security clearance process. More information about Security Clearances can be found on the US Department of State government website\nhere: https://www.state.gov/m/ds/clearances/c10978.htmIf applicable\nEmployee Referral Award Eligibility: Only employees currently within RMD and RI&S have the potential to receive a Referral Award for submitting a referral to RMD and RI&S roles. ALL eligibility requirements must be met to receive the Referral Award.\nRaytheon Technologies is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class.\nRaytheon Technologies is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class.\nPrivacy Policy and Terms:\nClick on this link to read the Policy and Terms\nShow Less\nReport",
    "title": "KEY NOT FOUND: ctas.save",
    "company": "Raytheon Missiles & Defense",
    "location": "Senior Principal Systems Engineer – Team Lead",
    "salary": null,
    "seniority_level": null,
    "employment_type": null,
    "job_function": null,
    "industries": null,
    "hiring_manager": null
}