{
    "id": "23086b85-6d7a-4732-9bf0-f0549c6e1826",
    "url": "https://www.glassdoor.com/Job/lead-python-engineer-jobs-SRCH_KO0,20.htm?suggestCount=0&suggestChosen=false&clickSource=searchBtn&typedKeyword=Lead%2520Python%2520Engineer",
    "description": "Our Purpose\nWe work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a\nculture of inclusion\nfor all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results.\nJob Title\nLead Software Development Engineer\nWho is Mastercard?\nMastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart, and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments, and businesses realize their greatest potential.\nOur decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all.\n\nOverview\nThe Edge Services team is looking for a Lead architect to drive our customer experience strategy forward by consistently innovating and problem-solving. The ideal candidate is passionate about the customer experience journey, highly motivated, intellectually curious, analytical, and possesses an entrepreneurial mindset.\n\nAbout The Role\n\nProvide world class support of internet traffic engineering technologies including but not limited to public and private CDNs, load balancing, and DNS.\nBe excited about building new platform technologies from scratch in a high impact environment. Someone you know probably relies on Mastercard’s services every single day.\nDevelop and support public and private REST APIs, keeping high availability, scalability aspects on mind.\nProvide timely and competent support for the technologies the team owns and builds.\nProactively identify shortcomings in the status quo and produce constructive ideas for improvement.\nMentor and train other engineers as appropriate — whether they be junior to you or a consumer of an API you’ve developed.\nHave a knack for taking a step back from a specific problem to understand the general case – you have an instinct for avoiding repetition and toil.\nHave a desire to help the world’s leading payment processor embrace modern technologies and approaches without sacrificing a total commitment to quality and security for our customers.\nDemonstrate drive and curiosity — you teach yourself what you don’t already know and you’re curious when something comes up that you don’t understand.\n\nAll About You\n\nYou probably have skills and experience along these lines:\n\nBachelor’s degree in Computer Science or a related technical field, or equivalent experience.\nInternet & Intranet traffic engineering fundamentals, especially OSI Layers & Protocols, DNS and HTTP processing. You’ve probably built or maintained load balancing technology.\nPrioritizing technologies for automation and advocating for your priorities with rational arguments.\nComfortable in the role of iconoclast and able to calmly explain why you see things the way you do.\nStrong competence with and prior professional work in at least one OOP language, especially Python/ Go / Java / J2EE.\nExperience building cloud-native applications that adhere (or mostly adhere) to the 12-factor design.\nExperience troubleshooting infrastructure — identifying DNS issues, interpreting HTTP response headers, interpreting packet captures, and understanding web server configurations.\nExperience writing and maintaining scripts that bridge automation gaps and provide quality of life improvements\nExperience with DevSecOps fundamentals and building / managing CI/CD pipelines.\n\nCorporate Security Responsibility\nEvery person working for, or on behalf of, Mastercard is responsible for information security. All activities involving access to Mastercard assets, information, and networks comes with an inherent risk to the organization and therefore, it is expected that the successful candidate for this position must:\n\nAbide by Mastercard’s security policies and practices;\nEnsure the confidentiality and integrity of the information being accessed;\nReport any suspected information security violation or breach, and\nComplete all periodic mandatory security trainings in accordance with Mastercard’s guidelines\nIn the US, Mastercard is an inclusive Equal Employment Opportunity employer that considers applicants without regard to gender, gender identity, sexual orientation, race, ethnicity, disabled or veteran status, or any other characteristic protected by law. If you require accommodations or assistance to complete the online application process, please contact reasonable_accommodation@mastercard.com and identify the type of accommodation or assistance you are requesting. Do not include any medical or health information in this email. The Reasonable Accommodations team will respond to your email promptly.\nCorporate Security Responsibility\nAll activities involving access to Mastercard assets, information, and networks comes with an inherent risk to the organization and, therefore, it is expected that every person working for, or on behalf of, Mastercard is responsible for information security and must:\nAbide by Mastercard’s security policies and practices;\nEnsure the confidentiality and integrity of the information being accessed;\nReport any suspected information security violation or breach, and\nComplete all periodic mandatory security trainings in accordance with Mastercard’s guidelines.\n\nNYC Salary Range: $136,000 - $223,000\nShow Less\nReport",
    "title": "KEY NOT FOUND: ctas.save",
    "company": "Mastercard",
    "location": "Lead Software Development Engineer",
    "salary": null,
    "seniority_level": null,
    "employment_type": null,
    "job_function": null,
    "industries": null,
    "hiring_manager": null
}