{
    "id": "24947566-7a43-4417-8cae-93702a2a54b4",
    "url": "https://www.linkedin.com/jobs/view/senior-data-engineer-digital-data-products-at-nbcuniversal-3495992828?refId=OcP09I1hKbROsXlnYYVHNw%3D%3D&trackingId=g00P3D%2FyCbjm4keA2Uj%2BLw%3D%3D&position=1&pageNum=0",
    "description": "\nCompany DescriptionNBCUniversal is one of the world’s leading media and entertainment companies in the development, production, and marketing of entertainment, news, and information to a global audience. NBCUniversal owns and operates a valuable portfolio of news and entertainment television networks, a premier motion picture company, significant television production operations, a leading television stations group, and world-renowned theme parks. NBCUniversal’s policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.Job DescriptionAs the Senior Data Engineer for the Data & Analytics team, you will have the opportunity to builds data pipelines to land, profile and store multiple internal & external datasets, and build applications that surface this data to support our business partners’ strategic decision making for digital products.We work in a very agile environment, where product specifications are flexible and often change rapidly over time. We are seeking people who are comfortable with ambiguity and figuring out an execute. While the key focus for this role is on backend engineering, engineers who have full stack expertise and can write front-end code will be especially considered.Contributor to the overall Data Product roadmap by working closely with our business partners to understand their challenges and develop analytical tools to help drive business decisionsLeverage prototyping methodologies to propose and design creative business solutions that exploit our broad toolset of technologies (Big Data, MicroStrategy, Tableau, Python, Spark etc)Educate and inform business partners on architecture, capabilities, best practices and solutions to build out future enhancementsAssist in analyzing business requirements, source systems, understand underlying data sources, transformation requirements, data mapping, data model and metadata for reporting solutionsWriting easily understood documentation and architecture diagrams and keeping them up to date as code and frameworks change over time.QualificationsBachelor’s degree in Engineering, Computer Science, Information Systems or related field with 5+ years of relevant experience. 1+ Experience in Data Modeling, Data architecture, Data Quality, Metadata, ETL and Data Warehouse methodologies and technologies. Experience in any combination of the following: SQL, Big Data (HIVE), Linux, MicroStrategy, Tableau, Python, React.js, APIs, Spark, Scala2+ years’ experience with AWS technologies. Strong experience using Python and Pandas in an AWS Lambda framework is highly desired. Experience using EMR and/or DataBricks or the ability to read EMR code and translate it into Lambdas.Basic understanding of relational data modeling and be able to clearly articulate the reasons to use non-relational systems in our architecture. Desired Characteristics1+ years in Digital Media Publisher Industry with a solid understanding of Digital Research (optional but ideal). Experience in MemSQL is desired but relevant experience in any of the following is acceptable: SnowFlake, MySQL, Redshift, Athena, MSSQL Server, Oracle. Experience in non-relational systems such as Redis, Cassandra, and MongoDB is useful for supporting legacy applications.Decent understanding for the digital media ad sales business and ad serving technologies with experience working with ad serving transactional data logs or Nielsen demographic data.Experience with various digital platforms such as Omniture (Site Catalyst), Rentrak, comScore, Operative One, Google DoubleClick, Freewheel, Ad-Juster, Nielsen, Facebook, Twitter, etcAbility to design concise and visually appealing reports, user interfaces, mockups and documentationAbility to read external API documentation and write pipelines to extract data from our partners’ systemsAbility to write and stand-up internal API endpoints to share data with other internal teams.Strong analytical focus, results-oriented and execution driven. Strong problem solving skillsAbility and desire to work within a cross-functional team environment with people from multiple business units, vendors, countries and cultures. Self-driven/self-initiator and resourceful to achieve goals independently as well as in teams and promotes an open flow of information so that all stakeholders are well informed. Committed and solution focused with the ability to perform under pressure and meeting targets This position is eligible for company sponsored benefits, including medical, dental and vision insurance, 401(k), paid leave, tuition reimbursement, and a variety of other discounts and perks. Learn more about the benefits offered by NBCUniversal by visiting the Benefits page of the Careers website. Salary range: $116,000 - $154,000.Additional InformationNBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law. NBCUniversal will consider for employment qualified applicants with criminal histories in a manner consistent with relevant legal requirements, including the City of Los Angeles Fair Chance Initiative For Hiring Ordinance, where applicable.If you are a qualified individual with a disability or a disabled veteran, you have the right to request a reasonable accommodation if you are unable or limited in your ability to use or access nbcunicareers.com as a result of your disability. You can request reasonable accommodations in the US by calling 1-818-777-4107 and in the UK by calling +44 2036185726.\n      ",
    "title": null,
    "company": null,
    "location": null,
    "salary": null,
    "seniority_level": "\n            Mid-Senior level\n          ",
    "employment_type": "\n          Full-time\n        ",
    "job_function": "\n            Engineering\n          ",
    "industries": "\n          Broadcast Media Production and Distribution, Entertainment Providers, and Media Production\n          ",
    "hiring_manager": null
}