{
    "id": "2658b0cb-7484-4e9a-86b7-03eb382ce818",
    "url": "https://www.linkedin.com/jobs/view/embedded-firmware-software-engineer-at-jobot-3542703389?refId=OcP09I1hKbROsXlnYYVHNw%3D%3D&trackingId=7bHD1DvBP2dJY7f3UJGa%2BA%3D%3D&position=10&pageNum=0",
    "description": "\n        Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!Job detailsFully Remote Embedded Software Engineer Role!This Jobot Job is hosted by Alex HagenAre you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.Salary $95,000 - $110,000 per yearA Bit About UsOne of our favorite clients is in need of an embedded software/firmware engineer to join their growing team ASAP! If you meet the requirements below please apply NOW!Why join us?MedicalDentalVision401kVery flexible PTOFSAJob DetailsResponsibilities Successful candidate should be responsible, motivated, and a self-starter who is self-directed on their assigned Agile team. Develop new and support existing functionality within our existing software suite of embedded products and systems. Develop new services in our future software suite of embedded products. Participate in a small, experienced, energetic team in a Lean continuous integration/continuous deployment (CI/DI), agile development.Required Skills & Knowledge 3 (+) years’ experience with C++ in Linux environment (Ubuntu, or any other equivalent variant) 3(+) years’ experience in cross compiling and troubleshooting C++ application with ARM32 or 64 bit target 1 (+) years’ experience with edge device /embedded platforms database sqlite3 or similar Good understanding of object-oriented programming using C++ Experience working with TCP/IP socket communications, understanding of websockets Understanding software development lifecycle, (SDLC) best practices. Candidate must be an effective verbal and written communicator with strong analytical and organizational skills Must demonstrate ability to work effectively in a fast-paced environment, balancing business needs with a solid commitment to quality, performance, and support.Prefered Skills & Experience Working Experience with C++ in Linux with embedded devices running any flavor of Linux OS and integrating it to Cloud (Azure/AWS/GCP)services (Edge/Cloud Integration)  Ability to develop cross platform application with ARM64 or similar and ability to debug with Linux target platform with arm architecture Experience with implementing messaging clients , clients processing JSON data on a Linux device is an added plus Prior experience in integrating device drivers/ building as a part of device firmware is desirableEDUCATION Degree from a four-year college or university in computer science, computer engineering, electrical engineering or equivalent with C++ programming background Good communication skills both verbal and written Excels at operating in a fast pace, collaborative environment Open to direction and collaborative work style with a commitment to get the job done Ability to look at situations from several points of view Development experience with cross platform applications and deploying to Linux devices is preferredInterested in hearing more? Easy Apply now by clicking the \"Apply\" button.Want to learn more about this role and Jobot?Click our Jobot logo and follow our LinkedIn page!\n",
    "title": null,
    "company": null,
    "location": null,
    "salary": null,
    "seniority_level": "\n            Associate\n          ",
    "employment_type": "\n          Full-time\n        ",
    "job_function": "\n            Engineering and Information Technology\n          ",
    "industries": "\n          IT Services and IT Consulting and Software Development\n          ",
    "hiring_manager": null
}