{
    "id": "2a561bfe-40a1-45c5-82ea-fd02d401ea50",
    "url": "https://www.linkedin.com/jobs/view/sr-site-reliability-engineer-data-solutions-at-healthequity-3532889925?refId=OcP09I1hKbROsXlnYYVHNw%3D%3D&trackingId=63wNejdVydr6QuaOVkO1ag%3D%3D&position=3&pageNum=0",
    "description": "\nOverview We are  CONNECTING HEALTH AND WEALTH.  Come be part of remarkable. How You Can Make a DifferenceWe are looking for a passionate Senior Site Reliability Engineer to join our Data Management team. Our team is responsible for driving scalable transactional and analytical data solutions. You'll contribute to the design, implementation documentation of systems, in collaboration with scrum teams, looking for opportunities to automate away waste, along with troubleshooting complicated systems and applications.What You’ll Be Doing Act as liaison between the Data Management and centralized SRE teams working on initiative of top priorities of Data Management  Work with teams to design and implement automated code deployment solutions  Work with teams to design and implement automated environment provisioning and container solutions  Work with teams to design and implement application monitoring and alerting solutions to get issues to the right people at the right time  Work with teams to remediate issues that impact the health and performance of our production systems and infrastructure  Work with teams to diagnose and isolate issues at all layers of the stack, whether it be code or infrastructure, during development and in production  Manage build definitions and hardware in support of our Continuous Delivery policies and procedures  Manage connections from source systems to our Data Lakehouse including setup of firewall rules and service ids  Build connections from source systems to our Data Lakehouse What You Will Need To Be Successful Bachelor's degree in CS/Engineering or equivalent experience  5+ years' experience in a DevOps, SRE, or IT Operations position  2+ years' experience writing SQL queries and Stored Procedures  2+ years' experience working with transactional and analytical data platforms in a cloud environment, preferrable Azure  1+ years' experience developing in Python  Demonstrated interpersonal skills and ability to collaborate with product owners and development teams  Demonstrated ability to context switch while still delivering on commitments  Ability to troubleshoot complex systems and environments  Experience with CI/CD concepts and tooling  Knowledge of full stack monitoring concepts and tooling from code to system resources  Experience with containerization design concepts and tooling Benefits & Perks Medical, Dental, Vision  HSA contribution and match  Dependent Care FSA match  Uncapped Paid Time Off  401(k) match  Paid Parental Leave  Ongoing Education & Tuition Assistance  Gym/Fitness Reimbursement  Award Winning Wellness Program  Come be your authentic self Why work for HealthEquityHealthEquity has a vision that by 2030 we will make HSAs as wide-spread and popular as retirement accounts. We are passionate about providing a solution that allows American families to connect health and wealth . Join us and discover a work experience where the person is valued more than the position. Click here to learn more.Come be your authentic selfHealthEquity, Inc. is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, age, color, religion, sex, sexual orientation, gender identity, national origin, status as a qualified individual with a disability, veteran status, or other legally protected characteristics. HealthEquity is a drug-free workplace. For more information about our EEO policy, or about HealthEquity’s applicant disability accommodation, drug-free-workplace, background check, and E-Verify policies, please visit our Careers page .HealthEquity is committed to your privacy as an applicant for employment. For information on our privacy policies and practices, please visit HealthEquity Privacy .\n      ",
    "title": null,
    "company": null,
    "location": null,
    "salary": null,
    "seniority_level": "\n            Mid-Senior level\n          ",
    "employment_type": "\n          Full-time\n        ",
    "job_function": "\n            Information Technology\n          ",
    "industries": "\n          Technology, Information and Internet and Financial Services\n          ",
    "hiring_manager": null
}