{
    "id": "3586cb6e-25d9-4fa5-aba4-29601d782f5c",
    "url": "https://www.glassdoor.com/Job/lead-python-engineer-jobs-SRCH_KO0,20.htm?suggestCount=0&suggestChosen=false&clickSource=searchBtn&typedKeyword=Lead%2520Python%2520Engineer",
    "description": "Do you enjoy creating order from chaos, delivering explanations in response to confusion, and designing process to replace disorder? Are you driven by the need to fix what’s not quite right? Do you possess a rare combination of elite technical acumen and a personable, clear communication style? Well, then you might just be the Senior IT Ops Engineer we’re looking for!\nMoving is one of the most universally relatable problems. Everyone has moved at least once and everyone thinks moving is painful. Updater is solving that pain at scale. We’re a well-funded and growth-focused company, with technology that touches nearly 50% of all household moves in the US annually, and we’re growing quickly.\nAt the core of how our employees work is the Software & IT Team at Updater. This team manages all employee-facing technology and curates our systems, services, and processes to ensure they are cost-effective, work well together, and meet our compliance and security standards.\nAs an IT Operations Engineer at Updater, the overall goal will be to help us identify inefficiencies in our complex IT environment and build forward-thinking solutions to address them. We want you to be a technical swiss army knife; maybe you’ll leverage APIs from our HR systems to pass off onboarding info to our IT Helpdesk, or maybe you’ll build more automation into our asset tracking to reduce loss and accelerate hardware delivery times. You’ll also manage our internal Okta Workforce directory that our employees use to access resources. This is an outstanding opportunity for someone with deep experience in Okta Administration, Windows & Mac MDM, and compliance efforts with is comfortable with automation and API integrations to perform a critical role in scaling systems at a very fast-growing company.\nAbout the Role\nAlleviate operational inefficiencies through process design and automation leveraging our IT Stack (Okta Workforce Directory, Okta Workflows, FreshService, Jamf Pro, Azure AD, O365, Windows Endpoint Manager (Intune), and more)\nHelp build compliance environment for NIST 800-171, CMMC, and other benchmarks\nServe as a senior admin and senior support resource for Updater’s MoveHQ division, which is upscaling aggressively to meet new business demands and compliance requirements\nServe as senior admin in Okta Workforce platform, be a resource for all things Okta\nCo-own Azure AD/O365 as an Okta-federated service; simplify and document our Windows MDM deployment and serve as a Windows MDM expert\nCompose and maintain exceptional, clear, concise technical documentation of all solutions and processes you design and manage.\nAbout You\n5+ years in senior Enterprise IT role managing platforms and large-scale deployments\nOkta-certified (admin or higher): you’ve managed Okta in an Enterprise setting and have deep understanding of how best to leverage it for maximum ROI; ideally familiar with managing Azure AD as an Okta-federated service\nExperience with SaaS automation: Your familiar with IPaaS platforms (i.e Okta Workflows, Workato, Boomi, Zapier, Terraform, etc) and concepts (no-code programming, process visualization, flow charts, etc); you’re comfortable looking at API documentation to link multiple SaaS apps into coherent, smooth processes\nExperience with MDM: Deep experience managing Intune/Endpoint Manager for Windows MDM; solid familiarity with Jamf Pro Mac MDM is also very helpful\nFamiliarity with Compliance Standards: you have some familiarity with working in high compliance environment (HIPAA, HITRUST, NIST, CMMC, etc)\nComfort with Scripting: PowerShell, Bash, Python and/or other scripting languages; you are able to compose and/or modify scripts for local automation in MacOS and Windows.\nEmpathy: You keep our end users’ point-of-view in mind as you build scalable systems that anticipate their needs\nAutonomy: You’re a self-starter who prefers to be pointed in a direction and given freedom to figure it out.\nIntellectual Curiosity: you don’t know everything, but you’re open to learning anything and you can do it quickly when given the time\nStrong Communicator: You can explain technically complex concepts with clear, concise explanations in written and verbal communication for a wide array of audiences\nAbout Updater\nUpdater makes moving easier for the 12 million households that relocate every year in the US. With Updater, users seamlessly forward mail, transfer utilities, connect TV and internet, and much more. Thousands of the most prominent real estate companies in the US (from real estate brokerages to multifamily and relocation companies) rely on Updater’s real estate products to save clients hours with a branded and personalized Updater moving experience.\nHeadquartered in New York City, Updater has raised over $450 million from leading investors, including SoftBank Capital, Vista Credit Partners, IA Ventures, Commerce Ventures, Second Century Ventures (the strategic investment arm of the National Association of Realtors®), and more. Updater has ranked on Crain's Best Places to Work in NYC in 2016, 2018, & 2021. For more information, please visit www.updater.com.\nUpdater is proud to be an equal opportunity employer and will consider all qualified applicants regardless of color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital or family status, disability, gender identity or expression, veteran status, actual or presumed belonging to an ethnic group, or any other legally protected status. If you have a disability or special need that requires accommodation, please let us know.\nShow Less\nReport",
    "title": "KEY NOT FOUND: ctas.save",
    "company": "Updater",
    "location": "Lead IT Operations Engineer (Remote)",
    "salary": null,
    "seniority_level": null,
    "employment_type": null,
    "job_function": null,
    "industries": null,
    "hiring_manager": null
}