{
    "id": "3f8342c7-750d-4849-90f8-c41615f22f06",
    "url": "https://www.linkedin.com/jobs/view/sr-technical-project-manager-cloud-economics-at-block-3507262724?refId=OcP09I1hKbROsXlnYYVHNw%3D%3D&trackingId=WJjgZlJy%2FMrEKoYBySWR5A%3D%3D&position=9&pageNum=0",
    "description": "\nCompany DescriptionBlock is one company built from many blocks, all united by the same purpose of economic empowerment. The blocks that form our foundational teams — People, Finance, Counsel, Hardware, Information Security, Platform Infrastructure Engineering, and more — provide support and guidance at the corporate level. They work across business groups and around the globe, spanning time zones and disciplines to develop inclusive People policies, forecast finances, give legal counsel, safeguard systems, nurture new initiatives, and more. Every challenge creates possibilities, and we need different perspectives to see them all. Bring yours to Block.The Foundational Engineering team is the trusted partner for every Block employee that enables product teams to succeed by providing connectivity, tools, technology and platforms. The FE organization accelerates product and business progress by enhancing productivity and reducing friction for our developers.Block operates within a complex on-prem and multi-cloud environment that requires alignment, prioritization and architectural evaluation across multiple teams and business units in order to deliver cost effective developer tools/ services.Job DescriptionWe continue to build out our Cloud Economics team at Block and are looking for a cloud-fluent TPM to join the team. Cloud Economics’ mission is to promote cloud cost efficiency across Block by building initiatives and programs to unlock efficiencies on a foundation of cloud cost visibility and allocation. You’ll work across functional teams to further this mission by evaluating, analyzing, and implementing cloud infrastructure recommendations across the business. We are looking for someone that has excellent interpersonal, collaboration, and program management skills. Successful candidates will have technical acumen, Cloud Stack expertise, and strong stakeholder engagement and communication skills.Block is still in its early stages of migrating to the cloud, come join us and make a positive impact to shape how we manage the cloud for years to come.You will:Be a pivotal member of Cloud Economics by partnering with stakeholders across multiple organizations and roadmaps to guarantee our cloud infrastructure costs are visible, allocated, and optimizedPartner with new and existing application owners to review design docs, analyze migrated workloads, and fine-tune existing applications for more efficient performanceIdentify and manage programs related to cloud cost visibility, allocation, and visibility by collaborating with multiple teams and creating organizational policies and standardsCreate reports and visualizations using a variety of softwares and tools to highlight cloud spend to a variety of audiencesPartner with external cloud infrastructure and SaaS providers as a regular point of contact to deliver resources such as products and tooling for our engineering communityQualificationsYou have:5 or more years of experience working in Program Management, Engineering, Infrastructure, etc., preferably with public cloud provider experience Working understanding of cloud billing modelsExcellent leadership with demonstrated ability to deliver results working with multiple stakeholdersExperience in interpreting and communicating technical requirements to technical and non-technical stakeholdersStrong verbal and written communication skillsAdvanced analytical and visualization skills (e.g. Tableau/Looker/SQL)Nice to have:AWS or GCP Certifications (e.g. AWS Certified Cloud Practitioner, GCP Associate Cloud Engineer)Experience with Cloud Cost Optimization toolingProgramming experience (Python, SQL, AWS, Terraform, API)Additional InformationTo find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information.Benefits include the following:Healthcare coverageRetirement Plans including company match Employee Stock Purchase ProgramWellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance Paid parental and caregiving leavePaid time offLearning and Development resourcesPaid Life insurance, AD&D. and disability benefits Perks such as WFH reimbursements and free access to caregiving, legal, and discounted resources This role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.We’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, veteran status, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.We believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible. Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our I+D page. Additionally, we consider qualified applicants with criminal histories for employment on our team, assessing candidates in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance.Block, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution.\n",
    "title": null,
    "company": null,
    "location": null,
    "salary": null,
    "seniority_level": "\n            Mid-Senior level\n          ",
    "employment_type": "\n          Full-time\n        ",
    "job_function": "\n            Engineering\n          ",
    "industries": "\n          Financial Services\n          ",
    "hiring_manager": null
}