{
    "id": "4450cd95-8890-4328-9c43-9d485f7305af",
    "url": "https://www.glassdoor.com/Job/lead-python-engineer-jobs-SRCH_KO0,20.htm?suggestCount=0&suggestChosen=false&clickSource=searchBtn&typedKeyword=Lead%2520Python%2520Engineer",
    "description": "Who Are We?\nTaking care of our customers, our communities and each other. That’s the Travelers Promise. By honoring this commitment, we have maintained our reputation as one of the best property casualty insurers in the industry for over 160 years. Join us to discover a culture that is rooted in innovation and thrives on collaboration. Imagine loving what you do and where you do it.\nJob Category\nTechnology\nCompensation Overview\nThe annual base salary range provided for this position is a nationwide market range and represents a broad range of salaries for this role across the country. The actual salary for this position will be determined by a number of factors, including the scope, complexity and location of the role; the skills, education, training, credentials and experience of the candidate; and other conditions of employment. As part of our comprehensive compensation and benefits program, employees are also eligible for performance-based cash incentive awards.\nSalary Range\n$113,900.00 - $188,000.00\nTarget Openings\n1\nWhat Is the Opportunity?\nThis role will lead data engineers to develop the necessary components of a modernized, scalable, performant and extensible ecosystem of data and analytics capabilities. Through technical acumen and leadership you will build and deliver cloud native solutions to deliver data as a product to the business using a range of modern technologies and tools. Successful candidates will not only demonstrate advanced knowledge of AWS, Databricks, APIs and Event Driven patterns – but have tangible experience with similar efforts to modernize legacy data & analytics platforms from on-premise to cloud.\n\nYou will support and build upon the data technology strategy that will enable best in the industry capabilities to organize, standardize, and process complex data across a landscape of on-prem and cloud based data lake and warehouse technologies. As part of the strategy, you will partner with and utilize the efforts and research of our modernization workgroup to strengthen and accelerate the data products delivery pipeline.\nWhat Will You Do?\nBuild and operationalize complex data solutions, correct problems, apply transformations, and recommending data cleansing/quality solutions.\nDesign complex data solutions\nPerform analysis of complex sources to determine value and use and recommend data to include in analytical processes.\nIncorporate core data management competencies including data governance, data security and data quality.\nCollaborate within and across teams to support delivery and educate end users on complex data products/analytic environment.\nPerform data and system analysis, assessment and resolution for complex defects and incidents and correct as appropriate.\nTest data movement, transformation code, and data components.\nPerform other duties as assigned.\nWhat Will Our Ideal Candidate Have?\nBachelor’s Degree in STEM related field or equivalent\nEight years of related experience\nHighly proficient use of tools, techniques, and manipulation including Cloud platforms, programming languages, and a full understanding of modern software engineering practices.\nThe ability to deliver work at a steady, predictable pace to achieve commitments, deliver complete solutions but release them in small batches, and identify and negotiate important tradeoffs.\nDemonstrated track record of domain expertise including understanding technical concepts necessary and industry trends, and possess in-depth knowledge of immediate systems worked on and some knowledge of adjacent systems.\nStrong problem solver who ensures systems are built with longevity and creates innovate ways to resolve issues.\nStrong written and verbal communication skills with the ability to work collaborate well with team members and business partners.\nAbility to lead team members and help create a safe environment for others to learn and grow as engineers. and a proven track record of self-motivation in identifying opportunities and tracking team efforts.\nExperience with: AWS, Python, Teradata, Ab Initio, Databricks, Snowflake\nWhat is a Must Have?\nBachelor’s degree or equivalent training with data tools, techniques, and manipulation.\nFour years of data engineering or equivalent experience.\nWhat Is in It for You?\nHealth Insurance: Employees and their eligible family members – including spouses, domestic partners, and children – are eligible for coverage from the first day of employment.\nRetirement: Travelers matches your 401(k) contributions dollar-for-dollar up to your first 5% of eligible pay, subject to an annual maximum. If you have student loan debt, you can enroll in the Paying it Forward Savings Program. When you make a payment toward your student loan, Travelers will make an annual contribution into your 401(k) account. You are also eligible for a Pension Plan that is 100% funded by Travelers.\nPaid Time Off: Start your career at Travelers with a minimum of 20 days Paid Time Off annually, plus nine paid company Holidays.\nWellness Program: The Travelers wellness program is comprised of tools and resources that empower you to achieve your wellness goals. In addition, our Life Balance program provides access to professional counseling services, life coaching and other resources to support your daily life needs. Through Life Balance, you’re eligible for five free counseling sessions with a licensed therapist.\nVolunteer Encouragement: We have a deep commitment to the communities we serve and encourage our employees to get involved. Travelers has a Matching Gift and Volunteer Rewards program that enables you to give back to the charity of your choice.\nEmployment Practices\nTravelers is an equal opportunity employer. We believe that we can deliver the very best products and services when our workforce reflects the diverse customers and communities we serve. We are committed to recruiting, retaining and developing the diverse talent of all of our employees and fostering an inclusive workplace, where we celebrate differences, promote belonging, and work together to deliver extraordinary results.\n\nIf you are a candidate and have specific questions regarding the physical requirements of this role, please send us an\nemail\nso we may assist you.\n\nTravelers reserves the right to fill this position at a level above or below the level included in this posting.\nTo learn more about our comprehensive benefit programs please visit\nhttp://careers.travelers.com/life-at-travelers/benefits/\n.\nApply Now: click Apply Now\nShow Less\nReport",
    "title": "KEY NOT FOUND: ctas.save",
    "company": "The Travelers Companies, Inc.",
    "location": "Data Engineer II - Tech Lead",
    "salary": null,
    "seniority_level": null,
    "employment_type": null,
    "job_function": null,
    "industries": null,
    "hiring_manager": null
}