{
    "id": "48cb8131-d874-4710-b3b9-43607588a03f",
    "url": "https://www.linkedin.com/jobs/view/principal-bioinformatics-lead-at-jobot-3544064965?refId=OcP09I1hKbROsXlnYYVHNw%3D%3D&trackingId=XpRn5kbDvy0n%2FYiogbNFfA%3D%3D&position=4&pageNum=0",
    "description": "\n        Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!Job detailsPrincipal Bioinformatics Lead - 5+ Years Industry ExperienceThis Jobot Job is hosted by Emmet NittoAre you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.Salary $150,000 - $175,000 per yearA Bit About UsBased in Carlsbad, CA, we are a biotechnology company commercializing a new standard in DNA sequencing. At our company, we offer incomparable opportunities to observe the spatial and temporal modifications of the 3D genome structure that influence gene regulation and cellular activity. By harnessing the power of 3D genomes, we are pushing the boundaries of life sciences research. Our cutting-edge solutions drive genomics discovery and contribute to advancements in human health. We are looking for a Principal Bioinformatics Lead to join our growing team!Why join us? Competitive Salary! Excellent Benefits Package! The Opportunity to Join an Amazing Team!Job Details Ph.D. degree with 5+ years or MS with 8+ years industry experience in Computer Science, Bioinformatics or other related scientific field, including at least 1 years managing and developing direct reports Industry experienced bioinformatician with strong prior; expertise in algorithm and product development to lead our growing bioinformatics team Write code and develop algorithms as an individual contributor and will technically guide junior teammates Developing probabilistic models or other machine learning models for the detection of biomarkers using NGS data Working knowledge of statistics and mathematics Background in Computer Science Coding expertise in at least one high performing programming language such as Python, C, C++, or other Experience developing high quality bioinformatics products Strong working knowledge of a variety of genomics and NGS data Experience with AWS cloud computing Experience leading small teams to develop algorithms and pipelines / products Excellent written and verbal technical communication skills Demonstrated leadership, initiative, organizational skills, and inter-personal communication abilitiesInterested in hearing more? Easy Apply now by clicking the \"Apply\" button.Want to learn more about this role and Jobot?Click our Jobot logo and follow our LinkedIn page!\n",
    "title": null,
    "company": null,
    "location": null,
    "salary": null,
    "seniority_level": "\n            Mid-Senior level\n          ",
    "employment_type": "\n          Full-time\n        ",
    "job_function": "\n            Education and Training\n          ",
    "industries": "\n          Nanotechnology Research, Research Services, and Biotechnology Research\n          ",
    "hiring_manager": null
}