{
    "id": "5433dd02-ab91-4dfc-8e99-643f9310f3dd",
    "url": "https://www.linkedin.com/jobs/view/airtable-development-engineer-airtable-javascript-at-jobot-3541728699?refId=OcP09I1hKbROsXlnYYVHNw%3D%3D&trackingId=Rd0W5OY506Vs2LvRcTE1zA%3D%3D&position=5&pageNum=0",
    "description": "\n        Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!Job detailsCutting edge carbon neutral aviation technology / Top compensation / Meaningful equity!This Jobot Job is hosted by Craig RosecransAre you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.Salary $80,000 - $130,000 per yearA Bit About UsWe are the Uber for Private Jets! We proudly provide high quality, safe and reliable private jet travel and are a market leader in affordability, accessibility and client satisfaction. We provide fast and easy access via web and mobile apps to a growing fleet of highly desirable company-owned private jets, 24/7 nationwide flight operations, personalized customer service, and decades of experience as operators and innovators. We are a React/Node.js, React Native, Python, Postgres, Airtable and AWS shop. Come join our team!Why join us? Competitive base salaries 100% company paid health plan Remote flexibility and flexible hours Generous PTO Dental and Vision, FSA, HSA Small team, great culture, and autonomyJob DetailsWe are seeking a highly motivated self-starter for a position to help in the development of custom web application software at the intersection of Airtable and automation. The ideal candidate will possess technical skills using spreadsheet scripting/functions, the ability to work with a team to achieve goals, have some experience with automation integrators like Zapier and Microsoft Power Automate, and be familiar with agile software development methodologies,Job Duties Designs data entry management structures according to requirements discovery Architects many-to-many relational data tables using Linked Records Strong command of managing Airtable Views and Airtable Forms Monitors and assists data validation procedures Ensures table functions operate within established specifications Creates documentation to identify requirements for augmentation software and to propose possible solutions. Performs other related duties as assigned.Ideal Background 2+ years of Airtable or comparable (Excel, etc) spreadsheet development experience 1+ year of vanilla JavaScript experience Strong knowledge of web technologies, performance optimization, troubleshooting Excellent interpersonal, verbal and written communication skills. Excellent organizational skills and attention to detail. Excellent analytical and problem-solving skills. Proficient with Airtable and its native applications. Ability to learn and improvise new data management technologies. Experience in some of the following technologies  Automation Integrators like Zapier and Microsoft Power Automate Microsoft Teams, Slack Atlassian Jira or comparable ticketing softwareInterested in hearing more? Easy Apply now by clicking the \"Apply\" button.Want to learn more about this role and Jobot?Click our Jobot logo and follow our LinkedIn page!\n",
    "title": null,
    "company": null,
    "location": null,
    "salary": null,
    "seniority_level": "\n            Mid-Senior level\n          ",
    "employment_type": "\n          Full-time\n        ",
    "job_function": "\n            Engineering and Information Technology\n          ",
    "industries": "\n          IT Services and IT Consulting and Software Development\n          ",
    "hiring_manager": null
}