{
    "id": "58cb6933-561a-40e4-85aa-7ed3f4e356d9",
    "url": "https://www.glassdoor.com/Job/lead-python-engineer-jobs-SRCH_KO0,20.htm?suggestCount=0&suggestChosen=false&clickSource=searchBtn&typedKeyword=Lead%2520Python%2520Engineer",
    "description": "We are a growing team of top-notch, innovative, highly skilled, and detail-oriented marketing professionals! Before reading on, you must possess front and back-end website development and design skills with SEO and marketing knowledge.\nPosition Summary\nAre you an experienced developer and leader with a passion for turning client ideas into their dream website and possess the experience needed to utilize the power of Google and other search engines to help a website rank higher? Do you possess a passion for all things marketing, whether it’s digital or traditional? The AD Leaf is based in the Space Coast and is one of the premier marketing agencies for custom website development and search engine optimization. With a variety of clients, industry-relevant services, and the drive to innovate, we are looking to transform how the world discovers and promotes businesses.\nThe AD Leaf has a fast-paced work environment and we seek talented employees who crave learning new skills and aren't afraid to tackle big projects. As a Junior Full Stack Developer, you will get to work with multiple departments, while working on real projects that will help us and you grow. Our ideal candidate is someone who walks into a room of people and can't leave without making a positive impact. Someone who is obsessed with servers, web design and SEO; is creative and thoughtful when interacting with online communities and building interpersonal relationships.\nYou: A love for communicating ideas, problem-solving, and creating advanced SEO-forward web design! We are committed to making brands look their best, and front end website development and SEO is the way to do that. If you are obsessed with digital marketing and sharing the best of the best of what makes brands great, we can train you for the additional skills you will need to be successful in this role.\nResponsibilities:\nWork in office only to coordinate with other team members (no remote applicants will be considered)\nLeading a development team and keep strict deadlines\nReview and analyze client sites for areas that need to improved, deleted, or revised\nShow passion and genuine caring for our clients, their business, and improving their revenue and profitability through your marketing efforts\nProtect sensitive client information and maintain a strict level of client confidentiality\nFamiliarity with common stacks\nKnowledge of multiple front-end languages and libraries (e.g. HTML/ CSS, PHP, JavaScript, XML, jQuery)\nKnowledge of multiple back-end languages (e.g. C#, Java, Python) and JavaScript frameworks (e.g. Angular, React, Node.js)\nFamiliarity with databases (e.g. MySQL, MongoDB), web servers (e.g. Apache) and UI/UX design\nExperience in building custom plug-ins\nExperience with the most common CMS like WordPress, Joomla, Magento, WIX, Weebly, Squarespace, etc.\nShow excellent proficiency with front-end libraries like jQuery and Bootstrap\nEnsure clients websites are optimized in accordance with the latest algorithm updates and forward-looking trending updates\nEnsure offsite strategies are in compliance with the latest algorithm updates and forward-looking trending updates\nWrite effective call-to-action statements\nBuild features and applications with a mobile-first design\nKeep abreast of white hat and black hat tactics so as not to violate search engine guidelines\nStrategize ways to improve and track site performance\n*Applicant must be willing to complete department-specific certification(s) within 90 days of start date and will be eligible for a merit increase.*\n**This job is available in person only. No remote applicants will be considered.**\n*External and internal applicants, as well as position incumbents who become disabled as defined under the Americans with Disabilities Act, must be able to perform the essential job functions (as listed) either unaided or with the assistance of a reasonable accommodation to be determined by management on a case by case basis. The AD Leaf is committed to the principle of equal employment opportunity. Applicants for employment and employees are reviewed on their individual qualifications for a position. Under no circumstances will The AD Leaf discriminate against qualified persons on the basis of race, color, religious creed, retaliation, national origin, ancestry, sexual orientation, gender, gender identity/expression, disability, mental illness, genetics, choice of health insurance, marital status, age, veteran status, or any other basis prohibited under applicable law or just simply by being good citizens\nRemote Work Opportunities\nHybrid office/remote work program offered after 60 days.\nBenefits:\nHealth Insurance\nDental Insurance\nMental Health Program\nFlexible Scheduling\nHoliday, Sick, and PTO days are available\nJob Type: Full-time\nSalary: $19.50 - $22.00 per hour\nBenefits:\nFlexible schedule\nHealth insurance\nPaid time off\nSchedule:\nMonday to Friday\nAbility to commute/relocate:\nMelbourne, FL 32935: Reliably commute or planning to relocate before starting work (Required)\nEducation:\nBachelor's (Preferred)\nExperience:\nJavaScript: 2 years (Preferred)\nHTML: 2 years (Preferred)\nCSS: 2 years (Preferred)\nSEO: 2 years (Preferred)\nWork Location: One location\nJob Type: Full-time\nPay: $19.50 - $22.00 per hour\nBenefits:\nDental insurance\nHealth insurance\nPaid time off\nSchedule:\n8 hour shift\nMonday to Friday\nAbility to commute/relocate:\nMelbourne, FL 32935: Reliably commute or planning to relocate before starting work (Required)\nExperience:\nWordPress: 1 year (Preferred)\nCSS: 1 year (Preferred)\nWork Location: In person\nShow Less\nReport",
    "title": "KEY NOT FOUND: ctas.save",
    "company": "The AD Leaf Marketing Firm LLC.",
    "location": "Full Stack Web Development Team Lead",
    "salary": null,
    "seniority_level": null,
    "employment_type": null,
    "job_function": null,
    "industries": null,
    "hiring_manager": null
}