{
    "id": "5e1f2a9e-5dc2-40ef-80e5-a9b32eabdeb8",
    "url": "https://www.linkedin.com/jobs/view/senior-devops-engineer-kubernetes-on-premise-bare-metal-deployments-at-jobot-3542599897?refId=OcP09I1hKbROsXlnYYVHNw%3D%3D&trackingId=MXwMMorBT2HbWz7mfMnfvA%3D%3D&position=6&pageNum=0",
    "description": "\n        Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!Job detailsSenior DevOps Engineer - Kubernetes, On-Premise, Bare Metal Deployments - Fully Remote - $150k-$200k Base SalaryThis Jobot Job is hosted by Nicole EricksonAre you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.Salary $150,000 - $200,000 per yearA Bit About UsWe're a fast-growing, privately owned internet/search/news company that is disrupting the industry. Our innovative product is unmatched in the market and has already helped millions of consumers globally. We're well-funded, currently in a pre-IPO stage and you'll be supporting our growing design team and the product that we're building.**In this role, you must have experience not just deploying applications in Kubernetes but actually managing Kubernetes itself. You have experience with on-premise and bare metal deployments as well. Please do not apply if you don't have these qualifications. Thank you!**Why join us? Fully remote, work from anywhere  Series B, soon opening Series C Highly competitive salary  Full benefits Bonus Equity 401k with company match Medical, Dental, Vision, Life Insurance, Disability 13 paid holidays  Unlimited PTO (encouraged, take it when you need it) Employee assistance program and more!Job DetailsWhat you'll be doing on the day to dayThe usual DevOps stuff, you will be working on pipelines, upgrading components, resolving security issues, doing deployments, designing systems, architecting systems, and more. You will be on call so must be okay with this.There will be a lot of dealing with components of Kubernetes, whether it's adding a storage layer, adding a GPU node, or fixing Kubernetes problems, rotating certificates, upgrading Nexus, or upgrading Gitlab, there's a lot of upgrading, migration. You'll work on new things for example, the Machine Learning team will want a database so standing up a database and doing all the things that come with it. Ability to understand monitoring and learning, adding monitoring, managing some of the backend services for instance may need to touch Kafka or resize Linux volumes, or manage ELK stack monitoring tool that we self-host. We automate a lot of stuff. Things that are manual, we write code to automate a lot of things. Big plus if you have backend software development experience, and you've actually written code and deployed the applications versus just managing the infrastructure. We're looking for jack of all trades (with specific Kubernetes and Linux experience).Duties and Responsibilities Participate in the design, architecture and implementation of systems, software, networks, and services required to operate Seekr platform. Work in close collaboration with software development teams to build scalable and efficient services. Identify and remedy operational inefficiencies through automation. Troubleshoot and assist with deployment related issues and incident response on live systems. Remain at the forefront of the latest Build/Release tooling technologies and systems to manage software releases into production. Lead development of solutions to complex operational and reliability challenges and proactive detection of system failures and scalability issues in production.Skills And Qualifications 4+ years working in System Engineering, DevOps, Site Reliability Engineering, or similar capacity preferably managing SaaS environments. 4+ years of experience working with Linux systems, familiar with Linux fundamentals including network protocols. (Windows experience is a plus) Experience with programming and/or scripting languages (Python, Ruby - strongly desired, Bash, Go, Java, PowerShell) Experience with container technologies Docker, Kubernetes required Experience working with ElasticSearch or similar search technology at scale (1+ billion docs) desired Experience with Hadoop strongly desired Systems configuration management experience with automation tools such as Puppet, Chef, Ansible, and Terraform (Puppet and Terraform preferred). Experience with Foreman strongly desired Experience building automation tools and managing Continuous Integration (CI) pipelines (Gitlab, Jenkins, TeamCity). Experience with Monitoring, Metrics and Central logging tools (ELK - preferred, Prometheus, InfluxDB, Grafana, etc.) Experience with Git (on prem or Github) - Gitlab experience a bonus Demonstrated ability to deliver results on time and with high quality. Effective communication skills and the ability to work effectively across multiple business and technical teams.Interested in hearing more? Easy Apply now by clicking the \"Apply\" button.Want to learn more about this role and Jobot?Click our Jobot logo and follow our LinkedIn page!\n",
    "title": null,
    "company": null,
    "location": null,
    "salary": null,
    "seniority_level": "\n            Mid-Senior level\n          ",
    "employment_type": "\n          Full-time\n        ",
    "job_function": "\n            Engineering and Information Technology\n          ",
    "industries": "\n          IT Services and IT Consulting and Software Development\n          ",
    "hiring_manager": null
}