{
    "id": "601591c6-42a3-46c2-b98a-6d22c5dbe674",
    "url": "https://www.glassdoor.com/Job/lead-python-engineer-jobs-SRCH_KO0,20.htm?suggestCount=0&suggestChosen=false&clickSource=searchBtn&typedKeyword=Lead%2520Python%2520Engineer",
    "description": "We’re a team of bright, kind individuals who are motivated by challenge and who care deeply about achieving great things. We know our individual strengths, but believe we only win as a team. We’re transforming the way people find what they love - and we need your big ideas. We just might be the perfect fit.\nAPI ENGINEER, LEAD I\nREMOTE, USA OR SAN FRANCISCO, CA\nAt Stitch Fix, our goal is to help our customers look great and feel great about themselves by revolutionizing how people shop. In a time-starved world where shopping often feels overwhelming, our business connects customers to clothes they love. Whether it’s helping someone dress for success at a new job or taking the stress out of packing for a family vacation, we fix clients’ closets – and they love us for it!\nWe’ve built unique, innovative software for merchandising, warehouse and inventory management, remote styling, and logistics. We leverage vast amounts of client data to make decisions throughout the company. All of this results in a simple, powerful offering to our clients and a very successful business. We believe we are only scratching the surface of our opportunity, and we’re looking for incredible people to contribute!\nABOUT ENGINEERING\nOur team is made up of people from varied backgrounds, including engineers who built and scaled organizations like Google, Netflix, eBay, GitHub, and LivingSocial. We build modern software with modern techniques like TDD, continuous delivery, DevOps, and service-oriented architecture. Cross-functional partnerships are deeply meaningful to us and are how we’ve built up immense trust with the people running the business. We focus on high-value products that solve clearly identified problems but are designed in a sustainable way so that value continues to deliver in the long term. In fact, some of our proudest moments come from solving business problems without writing a line of code.\nABOUT THE ROLE\nStitch Fix’s Home Feed engineering team is looking for an experienced API engineer to join our team to help propel the next generation of API tooling and infrastructure forward for our evolving product. We strive to enable our web and iOS engineers by building quality API’s and backend services, so they can focus on the most pressing product problems instead of fighting with the platform. We accomplish this by building API’s and services in close pairing and collaboration with mobile & web teammates that enable them to easily and safely make changes to build out new feature-sets with autonomy. We’re motivated by our ability to help our engineering and product partners continue delivering value and providing an enjoyable experience for our customers.\nYou will work as a valuable member of the engineering team building key API infrastructure supporting customer- and internal-facing systems across the company. You will spend your time helping guide solutions to problems that face us as we continue to grow and scale the business.\nYOU’RE EXCITED ABOUT THIS OPPORTUNITY BECAUSE...\nYou will work directly with web and iOS engineers to drive the future of the Stitch Fix home feed.\nYou will partner with cross platform feature teams and backend service teams\nYou will have the opportunity to help guide, develop and continue to grow infrastructure and tooling that directly supports product development teams.\nYou will have a significant impact on the API offerings at Stitch Fix by helping guide API infrastructure, implementation and tooling development.\nWe work collaboratively as a distributed team across the US, and we use GitHub, Slack, and Zoom extensively to collaborate.\nYou will help us continue to develop new methods of collaborating with close partners across engineering and other teams.\nWE ARE EXCITED ABOUT YOU BECAUSE...\nYou get excited about solving hard web & mobile problems in GraphQL, REST, RPC or other technologies.\nYou’re excited about building and evangelizing beautiful new GraphQL APIs across a far-flung organization.\nYou love to collaborate with many teams in sequence that are solving super interesting problems.\nYou have a background in providing GraphQL and Ruby on Rails backend support for both web and mobile development.\nYou treasure helping your team members grow and learn.\nYou believe in clear and honest communication.\nYou believe that strong teams are built on trust.\nYou clearly set and share your priorities with your team and partners.\nYou understand and focus on what is right for your customer.\nYou are passionate about building high-quality solutions, but know when to be pragmatic.\nYou are flexible, dedicated to your craft and curious.\nABOUT THE TECHNOLOGY\nTechnologies we rely on to pursue solutions to business problems include things like:\nGraphQL\nApollo Federation\nRuby on Rails\nPython\nSwift\nKotlin\nGolang\nNode.js\nWhile experience with any of these is a bonus, our primary focus is hiring an engineer with a passion for solving problems first and foremost.\nYOU'LL LOVE WORKING AT STITCH FIX BECAUSE WE...\nAre a successful, vibrant, fast-growing company.\nAre a technologically and data-driven business.\nAre at the forefront of tech and fashion, redefining shopping for the next generation.\nAre passionate about our clients and live/breathe the client experience.\nGet to be creative every day.\nHave a smart, experienced, and diverse leadership team that wants to do it right & is open to new ideas.\nBelieve in autonomy & taking initiative.\nFull support for remote work—and you get the opportunity to connect with your peers and partners at our yearly team summits.\nOffer transparent, equitable, and competitive compensation based on your level to help eliminate bias in salaries, as well as equity and comprehensive health benefits.\nAre serious about our commitment to work-life balance, and have generous parental leave policies.\nABOUT STITCH FIX\nAt Stitch Fix, we’re about personal styling for everybody and we believe in both a service and a workplace where you can be your best, most authentic self. We’re the first fashion retailer to combine technology and data science with the human instinct of a Stylist to deliver a deeply personalized shopping experience. This novel juxtaposition attracts an extraordinary collection of talented people who are both thinkers and doers. All of this results in a simple, powerful offering to our customers and a successful, growing business serving millions of men, women, and kids. We believe we are only scratching the surface on our opportunity, and we’re looking for incredible people like you to help us carry on that trend.\n\n#LI-VG1\nOur anticipated compensation reflects the cost of labor across several US geographic markets, and the range below indicates the low end of the lowest-compensated market to the high end of the highest-compensated market. This position is eligible for new hire and ongoing grants of restricted stock units depending on employee and company performance. In addition, the position is eligible for medical, dental, vision, and other benefits. Applicants should apply via our internal or external careers site.\nPay Range\n$156,000—$166,000 USD\nThis link leads to the machine readable files that are made available in response to the federal Transparency in Coverage Rule and includes negotiated service rates and out-of-network allowed amounts between health plans and healthcare providers. The machine-readable files are formatted to allow researchers, regulators, and application developers to more easily access and analyze data.\nPlease review Stitch Fix's US Applicant Privacy Policy and Notice at Collection here:https://stitchfix.com/careers/workforce-applicant-privacy-policy\nStart your job application: click Apply Now\nShow Less\nReport",
    "title": "KEY NOT FOUND: ctas.save",
    "company": "Stitch Fix",
    "location": "API Engineer, Lead I",
    "salary": null,
    "seniority_level": null,
    "employment_type": null,
    "job_function": null,
    "industries": null,
    "hiring_manager": null
}