{
    "id": "6e4947ba-1057-4af8-bf8e-f257c5b2a4fd",
    "url": "https://www.glassdoor.com/Job/lead-python-engineer-jobs-SRCH_KO0,20.htm?suggestCount=0&suggestChosen=false&clickSource=searchBtn&typedKeyword=Lead%2520Python%2520Engineer",
    "description": "At Sonos we want to create the ultimate listening experience for our customers and know that it starts by listening to each other. As part of the Sonos team, you’ll collaborate with people of all styles, skill sets, and backgrounds to realize our vision while fostering a community where everyone feels included and empowered to do the best work of their lives.\nAs a Principal DevOps Engineer on the Build Engineering Team, you'll work with the team to create and maintain the continuous integration and software delivery pipelines for Sonos. You’ll design, develop, and improve source control management systems, continuous integration and continuous test platforms, artifact repositories, and workflow automation. Your goal is to make it easy and efficient to take code from development environment to releasable artifact. This is a critical role for a DevOps, CI/CD, build automation, or software delivery enthusiast who wants to work in a modern environment creating a great product that people love. If this sounds like you, let’s talk.\n\nResponsibilities\nOperate and streamline source control (GitHub), continuous integration and build (GitHub Actions and Jenkins), and artifact management (Artifactory) systems with critical service level objectives (SLOs) around reliability, performance, and scalability.\nWork with development teams to design and implement new source control automation, software build systems, and artifact management solutions.\nDefine and drive strategic initiatives that create the next generation Sonos software developer experience, improve software delivery performance, and reduce developer toil.\nDevelop and implement DevOps operational best practices while maintaining agility.\nAct as a project and team lead. Mentor and train other engineers on the team.\n\nQualifications:\n10+ years overall software engineering experience in technical software development roles (software development, software quality engineering, build engineering, etc.)\n3+ years experience as a DevOps Engineer, Build Engineer, Senior SDET, or related role\nDeep experience with modern programming language (Python preferred)\nDeep experience with source control systems, branching strategies, and source control automation (GitHub preferred)\nDeep experience with software build systems (Yocto, CMake, Xcode, Gradle preferred)\nDeep experience with artifact management systems (Artifactory preferred)\nDeep experience using cloud infrastructure to create software delivery platforms (AWS preferred)\nDeep experience using Linux containers and container based infrastructure to create software delivery platforms (Docker and Kubernetes preferred)\nExperience operating critical development platforms with logging, monitoring, alerting, on-call support, incident management, and service level performance objectives (SLOs)\nExperience with securing the software supply chain\nExperience leading and mentoring junior developers\nPassionate drive for DevOps, automation, and modern tooling\nExcellent written and verbal communication skills\nWe consider a wide range of factors when determining compensation, which may cause compensation to vary depending on your skills, experience and qualifications. This job is also eligible for discretionary bonuses as well as an opportunity to become a Sonos shareholder because all full time employees are eligible for stock grants. The minimum base pay may be modified in the future based on changing market conditions. The starting minimum base pay for this role is:\n$152,000\nWe offer a comprehensive package of benefits including open time off, medical/dental/vision insurance, 401(k), and other benefits subject to eligibility requirements.\nNote: No amount of pay is considered to be wages or compensation until such amount is earned, vested, and determinable. The amount and availability of any bonus, benefits, or any other form of compensation and benefits that are allocable to a particular employee remains in the Company's sole discretion unless and until paid and may be modified at the Company’s sole discretion, consistent with the law.\nYour profile will be reviewed and you'll hear from us once we have an update. At Sonos we take the time to hire right and appreciate your patience.\nNotice to U.S. Job Applicants: Sonos is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics.\n\nFollow the links to review the\nEEO is the Law poster\nand its\nsupplement\n. The pay transparency policy is available\nhere\n. Sonos is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please send an e-mail to accommodations@sonos.com and let us know the nature of your request and your contact information.\nApply Now: click Apply Now\nShow Less\nReport",
    "title": "KEY NOT FOUND: ctas.save",
    "company": "Sonos, Inc",
    "location": "Lead Architect - Build Engineer",
    "salary": null,
    "seniority_level": null,
    "employment_type": null,
    "job_function": null,
    "industries": null,
    "hiring_manager": null
}