{
    "id": "7552bf5f-b517-4c2c-8ab0-540569e204ad",
    "url": "https://www.glassdoor.com/Job/lead-python-engineer-jobs-SRCH_KO0,20.htm?suggestCount=0&suggestChosen=false&clickSource=searchBtn&typedKeyword=Lead%2520Python%2520Engineer",
    "description": "Job Title: Lead Software Engineer - RCS\nJob Location: Southfield, MI\nWhat we offer:\nThe company develops cutting-edge technology for the Future Car. Our international, agile and highly collaborative teams aim to accelerate the growth in Autonomous Driving and be the leader in Advanced Driver Assistance Systems. We empower our people and are dedicated to their professional development and growth.\nWith 7500 employees in 13 countries, our growing team has the goal to lead the revolution underway in the automotive industry…and then be the pioneer for what comes next.\nWhat you'll do:\nLeading software team of local and offshore resources .\nProvided support to development team in requirement specification, software architecture, detailed design, implementation, static analysis, unit test, integration and integration test of software components.\nSupport software verification and validation activities.\nResponsible for analyzing and troubleshooting delivery issues.\nPlanning, effort estimation, tracking, risk analysis and risk mitigation plans.\nResponsible for overseeing the daily activities of the software development team and providing direction and guidance as required.\nResponsible for workload assignments and resource allocations according to delivery requirements.\nResponsible for configuration management of the project which also includes project builds, release scripts and all related documentation.\nProblem report and change request tracking / handling.\nMentoring and providing the technical support to team members.\nInterface with internal and external customer from multiple global locations.\nReport status to internal and external customers.\nWhat you'll bring:\nBachelor’s Degree in Engineering or Computer Science\n10+ years of Software Development for Real-Time Embedded Systems\n3+ years in leading and/or managing a software team\n3+ years in resource planning\nProficient knowledge of C Programming\nPossess solid teamwork/social interaction skills\nProficient of software process models (such as ASPICE/CMMi)\nGlobal interaction with remote team members, including BCC sites and external suppliers\nALM tools & methodologies (Code Beamer, PTC Integrity Manager, JIRA, etc.)\n8D, 5-Why, or similar problem-solving processes\nAUTOSAR\nConfiguration Management Tools (PTC Integrity, Bitbucket/Git, etc.)\nFunctional Safety (ISO 26262)\nCAN, Flexray, Ethernet Communications\nMicroprocessor peripherals (SPI, A/D, digital I/O, etc.)\nMicroprocessor architectures\nScripting languages (Perl, Python, Java, etc.)\nSoftware Validation / Unit Testing\nModel-Based Code Generation\nUML\nPrevious Experience with airbag, brake control, engine/powertrain control, steering control, ADAS.\nSupplier Management\nCustomer Diagnostics (UDS or other)\nFamiliarity with Real-time operating Systems\nBootloader\nCyberSecurity\nOver the Air programming\nMessage Authentication\nTo apply to this job, click Apply Now\nShow Less\nReport",
    "title": "KEY NOT FOUND: ctas.save",
    "company": "Kelly",
    "location": "Lead Software Engineer",
    "salary": null,
    "seniority_level": null,
    "employment_type": null,
    "job_function": null,
    "industries": null,
    "hiring_manager": null
}