{
    "id": "768e0dcb-e0ff-4e6e-9bc1-c3b3e4d7f118",
    "url": "https://www.glassdoor.com/Job/lead-python-engineer-jobs-SRCH_KO0,20.htm?suggestCount=0&suggestChosen=false&clickSource=searchBtn&typedKeyword=Lead%2520Python%2520Engineer",
    "description": "At Stonehenge Technology Labs, we help leading CPG teams win in the omni-commerce space by bringing together data that powers insights and drives autonomous actions. The faster STOPWATCH™ Members identify opportunities and command gaps across their total online and in-store assortment, the faster they win! Learn more here: https://stopwatch.tech\nThe team at Stonehenge Technology Labs operates off three distinct principles: 1) Empower Unique Talent; 2) Operate as a World-Class Team; 3) Solve Complex Problems with Speed & Simplicity. Stonehenge recruits, employs, trains, compensates, and promotes regardless of race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.\nVisa sponsorship is not available for this role.\nPurpose:\nAs the Lead Power BI Engineer at STOPWATCH™, you will be the leading Power BI expert for the organization and lead a team of engineers transforming structured, semi-structured, and unstructured data into reporting solutions for our platform.\nYou will:\n· Be the company’s top Power BI expert, developing, monitoring, maintaining, optimizing and sunsetting data models & reports leveraging best practices.\n· Transform both simple and complex member (customer) data to create insightful, beautiful, actionable and accurate reporting with varying levels of artistic freedom.\n· Be one of the company’s top Databricks experts, leveraging it for data modeling and feature creation.\n· Leverage our stack, including but not limited to Databricks, SQL and Power BI, in the most optimal way, making recommendations and executing on them in close partnership with the leadership team.\n· Take on projects hands-on or delegate in a way that yields the highest ROI for the business while building up team’s skillset.\n· In partnership with the Lead Data Engineer, you will be one of the main administrators of Databricks, including cluster configuration & safeguards.\n· Act as both an individual contributor & team leader.\n· Be able to independently make decisions around tradeoffs between downstream and upstream modeling, as well as work in collaboration with other experienced Power BI developers in other functional areas.\n· Partner closely with security engineer, cloud architect, product teams, and data engineers.\n· Be a servant-leader, proactively working to develop junior talent.\nWe expect you to operate with speed, simplicity, and store your work on the group system with a focus on process mapping and documentation enabling rapid scale and interconnected efficiencies between work groups.\nAs part of the application process, all candidates are required to complete a skills test.\nSKILLSET/EXPERIENCES:\n· Expert level understanding of Power BI both on data modeling and reporting, with experience building efficient data models and reports is a must\n· 3+ Years of Power BI data modeling experience with best practices is a must\n· 3+ Years of Power BI report creation and maintenance experience is a must\n· 3+ Years of SQL experience is a must\n· 2+ Years experience of experience using Databricks OR advance Python skills and willingness to learn Databricks independently is a must\n· 1+ Years of experience leveraging object and row level security is a must\n· Embedded PBI reporting experience is a big plus\n· Extreme attention to detail including self-monitoring QA\n· Penchant for documentation, reproducibility, and standardization especially in terms of standard data model matrices\n· Familiarity with retail/retailer/supply chain data is a plus; experience working for a major retailer or CPG brand even bigger plus\n· Scrappy mindset; resourceful and relentless in finding answers\nThis role (and every role at Stonehenge Technology Labs) is expected to read, notate and arrive ready to discuss THE GOAL by Eliyahu Goldratt on Day 1.\nHere’s what we offer in addition to competitive base pay:\nStock incentives based on individual and team performance\n5 weeks paid vacation, 11 paid holidays\nFlexible (albeit intense) work schedule\n100% Company Paid Health Care for Employee and Spouse/Partner\nAvailable Dental and Vision Plans\nAvailable 401K Program\nContribution matching to qualified 501c3 organization (team member’s choice),\nKid/pet/partner focused culture\nPaid maternity/paternity leave and financial assistance in support of adoptive & fostering activities\nExecutive coaching (certain roles)\nJob Type: Full-time\nPay: $130,000.00 - $155,000.00 per year\nBenefits:\n401(k)\nDental insurance\nHealth insurance\nHealth savings account\nPaid time off\nParental leave\nRetirement plan\nVision insurance\nSchedule:\nMonday to Friday\nApplication Question(s):\nDo you now or in the future require visa sponsorship to continue working in the United States?\nExperience:\nPower BI Data Modeling: 3 years (Required)\nPower BI Report Creation/Maintenance: 3 years (Required)\nSQL: 3 years (Required)\nRow or Object level security: 1 year (Required)\nWork Location: Remote\nShow Less\nReport",
    "title": "KEY NOT FOUND: ctas.save",
    "company": "Stonehenge Technology Labs",
    "location": "Lead PowerBI Engineer",
    "salary": null,
    "seniority_level": null,
    "employment_type": null,
    "job_function": null,
    "industries": null,
    "hiring_manager": null
}