{
    "id": "9959c31e-3896-437d-8f63-9396e39143a9",
    "url": "https://www.glassdoor.com/Job/lead-python-engineer-jobs-SRCH_KO0,20.htm?suggestCount=0&suggestChosen=false&clickSource=searchBtn&typedKeyword=Lead%2520Python%2520Engineer",
    "description": "Job description\nThe Director of Technology/Software Development (TSD) will provide oversight and direction for TSD solutions that facilitate OmniMetrix’s strategy, approach, and business model. Working closely with executive leadership and internal/external stakeholders, the Director will identify and prioritize key technology projects needed to sustain existing applications, support new strategies, and provide alternative cost-effective technology solutions. This role will report to the Chief Operations Officer and work collaboratively both cross functionally as well as with external clients as needed.\nThis role will participate in and oversee all software development, technology infrastructure, operations and IT projects, ensuring that commitments are properly planned, staffed, monitored and reported. Qualified candidates will bring demonstrated experience in Azure cloud architecture, software development, SQL coding, technical leadership, financial management, staff management and team development.\nMust have hands-on software development skills in Python, C Sharp and SQL and PHP Java Script. Also working knowledge of Angular for UI/UX interface development.\nThis is an on-site role (Buford, GA) with opportunity for hybrid work from home (3 days in office/2 days remote) after the first 90 days.\nWhat you will do:\nParticipate as a member of the Executive Management team\nCreate and develop a small infrastructure team from scratch that is agile and positions the company for further growth and streamlined processes\nEvaluate Azure Cloud environment to re-architect cloud environment on Azure with full autoscaling and full CI/CD implementation\nEvaluate the SQL code for all current applications and direct/oversee updates, revisions, enhancements performed by SQL Developer role\nIdentify ways to increase company profit and streamline operations and processes through leveraging technology\nLook for ways to reduce cost of software and third party expense by creating processes and software in house\nCreate Technology Road Maps to drive the strategic direction of the Company\nEvaluate, expand and enhance Cyber Security and internal control plan\n· Support the organization’s ongoing transformation by determining technology and software development needs, developing implementation plans and optimizing the system benefits.\n· Design, participate in and oversee software development projects to continue to enhance the Company’s customer data offerings.\n· Manage, develop and maintain a highly qualified hybrid team of IT professionals (FTE and consulting resources) to meet the company’s needs while fostering a culture of innovation, transparency, and accountability.\n· Assure team structure and assignments include clarity around prioritization of internal requests and needs versus customer need and commitments.\n· Define and communicate project milestones, service level agreements, and resource allocation to executive team, department leads, support staff and end users.\n· Oversee the deployment, maintenance and support of all hardware and software based on organizational and customer needs.\n· Review performance of IT systems and make recommendations for the improvement and optimization of infrastructure.\n· Ensure effective systems oversight and support for all external platforms and Cloud systems including, Azure, O365 and the web portal.\n· Serve as main cybersecurity resource for the organization and maintain ongoing security initiatives around SIEM, authentication, and incident management.\n· Establish and enforce IT policies to support operating infrastructure needs of the organization.\n· Serve as integrations management lead across enterprise systems on data mapping, triggers, and automation.\n· Maintain comprehensive and consistent documentation of systems and interdependencies.\n· Preserve assets by implementing disaster recovery and backup procedures and information security and control structures.\n· Develop and maintain budgets for IT department in alignment with organization’s digital transformation goals.\n· Develop priorities for IT acquisitions, business case justifications, and cost/benefit analysis for IT spending and initiatives.\n· Manage negotiation and administration of IT vendor, outsourcer, and service agreements.\n· Monitor the industry for developments in IT operations; evaluate and implement relevant new tools and service management frameworks.\nWhat you will bring:\n· Strong alignment with OmniMetrix’s Vision, Mission and Approach and our organizational values of respect, equity, empowerment, accountability, and creativity\n· Commitment to supporting OmniMetrix’s values and goals: ability keep strategic vision in mind while managing day-to-day workflow.\n· Proven problem-solving capability: collaborative and proactive approach to identifying areas for improvement and refining processes for optimal accuracy and efficiency.\n· Hands-on software development skills in Python, C Sharp and SQL and PHP Java Script.\n· Customer service orientation and strong communication skills: ability to explain and rectify any IT issues staff may have in a manner that supports the organization's culture of open communications and drive for excellence.\n· Ability to lead and facilitate effective prioritization and assignments to make consistent progress on prioritized projects while providing excellent service and support on an as needed basis to internal stakeholders, engineering, sales and customers. Demonstrated ability to hold information confidential with excellent judgment and maintain consistent, high-level work ethic in all relationships and duties.\n· Ability to hold self and others accountable for high-quality, effective results.\n· Proven experience in IT infrastructure strategic planning and development, digital transformation, project management, vendor management and policy development,\nincluding migrating business systems and infrastructure to the Cloud (Azure cloud experience is a strong plus).\n· Solid understanding of data analysis, budgeting, and business operations.\n· Strong knowledge of current network and PC operating systems, hardware, protocols, and standards.\n· Experience with systems design and development from business requirements analysis through to day-to-day management.\nEducation & Experience:\n· Bachelor’s degree in IT, Computer Science, or relevant business or technical discipline (or equivalent experience)\n· Knowledge and experience in Python, C-Sharp, SQL, and PHP Java Script\n· Working knowledge of Azure cloud hosting environments and cyber security tools\n· 7+ years’ experience in IT management\n· Familiarity with wireless communication systems (monitoring), carriers and protocols, internet of things (IoT)\n· Proven staff management experience: demonstrated ability to lead a team to excellence by delegating roles and responsibilities and developing talent through ongoing mentorship.\n· Experience in tech organization where balance of internal IT needs with customer and sales priorities is essential.\nJob Type: Full-time\nSalary: $140,000.00 - $170,000.00 per year\nBenefits:\n401(k)\nDental insurance\nEmployee assistance program\nFlexible schedule\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nTuition reimbursement\nVision insurance\nCompensation package:\nStock options\nExperience level:\n7 years\nSchedule:\nMonday to Friday\nAbility to commute/relocate:\nBuford, GA 30518: Reliably commute or planning to relocate before starting work (Required)\nExperience:\nIT service management: 7 years (Required)\nWork Location: Hybrid remote in Buford, GA 30518\nJob Type: Full-time\nPay: $140,000.00 - $170,000.00 per year\nBenefits:\n401(k)\nDental insurance\nEmployee assistance program\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nTuition reimbursement\nVision insurance\nSchedule:\n8 hour shift\nAbility to commute/relocate:\nBuford, GA 30518: Reliably commute or planning to relocate before starting work (Required)\nWork Location: Hybrid remote in Buford, GA 30518\nShow Less\nReport",
    "title": "Innovative Technology-Software Development Transformation Leader",
    "company": "KEY NOT FOUND: ctas.save",
    "location": "Buford, GA",
    "salary": null,
    "seniority_level": null,
    "employment_type": null,
    "job_function": null,
    "industries": null,
    "hiring_manager": null
}