{
    "id": "a0ac1bab-ca0c-4662-8248-f844c43cde8c",
    "url": "https://www.glassdoor.com/Job/lead-python-engineer-jobs-SRCH_KO0,20.htm?suggestCount=0&suggestChosen=false&clickSource=searchBtn&typedKeyword=Lead%2520Python%2520Engineer",
    "description": "Job Description\nJob Summary: Operational Training of end customer NOC staff on capacity management, troubleshooting, fault management, change management, and fault resolution of reported and detected faults, within the Arista Cloudvision telemetry management solution.\nThese roles involve working with a highly automated global network deployment, therefore experience writing software is essential.\nThere are 2 main areas of focus involved in these roles:\nAutomation and testing: Using the latest automation techniques and tools\nCloud services: Implementing and operating scalable, flexible and cloud agnostic solutions for internal and external customers\nQualifications\nUS Citizen\n10+ years experience\nWorking-level experience in Datacenter Switching Network Operations which includes; network device monitoring, device failures, communication line alarms (such as bit errors, framing errors, line coding errors, and circuits down) and other performance issues that may affect the network or any datacenter devices.\nArista Data Center Switching knowledge is desirable\nMinimum Education and Experience:\nMinimum 7+ years of technical support experience\nMinimum 7+ years of experience and understanding of event/alert management, incident and change management processes\nMinimum 7+ years of experience of basic networking, routers, switches, Firewalls, and Wireless devices.\nMust possess a strong understanding of Route/Switch, Wireless.\nAutomation Experience - (Ansible, Terraform) - Desired\nScripting Experience - (Bash, Python)\nJob Type: Full-time\nPay: $65.00 per hour\nBenefits:\n401(k)\nDental insurance\nHealth insurance\nVision insurance\nSchedule:\n8 hour shift\nMonday to Friday\nAbility to commute/relocate:\nRichmond, VA: Reliably commute or planning to relocate before starting work (Required)\nApplication Question(s):\nDue to the nature of the role, US Citizenship is required. Do you possess US Citizenship?\nEducation:\nBachelor's (Preferred)\nExperience:\nNetwork engineering: 8 years (Preferred)\nData center: 5 years (Preferred)\nCloud: 5 years (Preferred)\nScripting: 5 years (Preferred)\nAutomation: 3 years (Preferred)\nNOC (Network Operations Center): 3 years (Preferred)\nWork Location: In person\nShow Less\nReport",
    "title": "KEY NOT FOUND: ctas.save",
    "company": "Gridiron IT",
    "location": "Lead Network Engineer",
    "salary": null,
    "seniority_level": null,
    "employment_type": null,
    "job_function": null,
    "industries": null,
    "hiring_manager": null
}