{
    "id": "ab0dc01b-d61d-4b55-981b-5e8274f58cc2",
    "url": "https://www.glassdoor.com/Job/lead-python-engineer-jobs-SRCH_KO0,20.htm?suggestCount=0&suggestChosen=false&clickSource=searchBtn&typedKeyword=Lead%2520Python%2520Engineer",
    "description": "We are looking for a Data Engineering Manager to join our growing team of Data Engineers and manage the processes and people responsible for accurate data collection, processing, modeling, and analysis.\nYou will work closely with leaders across product, sales, and marketing to support and implement high-quality, data-driven decisions. You will ensure accuracy and consistency in our reporting and decision support by designing appropriate data architectures, setting up alerting and observability frameworks and correcting business processes to prevent data quality issues. You will become an expert administrator of our data engineering technology stack, which includes dbt and Snowflake, and a coach to the rest of the team for these technologies.\nThis is a remote opportunity within the US. You will be expected to be fully remote, ideally in the Eastern Time Zone.\nResponsibilities include, but are not limited to:\nDesign, implement, and maintain data pipelines to support business objectives\nImplement tests, monitoring, and data quality processes to maintain data integrity and accuracy\nDiagnose and resolve performance issues with user SQL queries\nDiagnose and resolve failures of production systems in a timely manner\nManage and mentor a team of data engineers, providing technical guidance, performance feedback, and coaching\nCollaborate with cross-functional teams to identify and prioritize projects, ensuring timely delivery and alignment with business goals\nConduct ongoing research and evaluation to improve data infrastructure and processes\nDeveloping business continuity plans\nRequired Qualifications:\nBachelor's degree in Computer Science or related field\n8+ years of experience in data engineering, software development, or related field\nExpert knowledge of SQL\nExperienced at database administration for a relational or NoSQL database\nExperienced at performance tuning for databases & queries\nProfessional experience using Git or another source code management system\nProfessional experience using Linux for software development\nStrong technical skills in data architecture, data modeling, ETL, and data warehousing\nStrong project management and leadership skills\nExcellent interpersonal, teamwork, and problem-solving skills\nStrong communication skills, including the ability to explain intricate database concepts to other members of their team\nAbility to work in a fast-paced, collaborative environment\nMust be able to travel occasionally, and work more than 40 hours a week, as needed.\nPreferred Qualifications:\nExperience with cloud analytical data warehouses (Snowflake preferred)\nExperience with data pipeline tools (dbt, Airflow, or similar)\nExperience with database replication including High Availability setups\nExperience operating & monitoring systems on cloud-based platforms (AWS preferred)\nExperience implementing statistical process control to monitor and control a data analytics pipeline (DataOps)\nProfessional experience using Python for data processing\nKnowledge of Kimball dimensional modeling\nKnowledge of data security and privacy regulations such as GDPR, CCPA and good PII data practices to support their enforcement\nA plus if you love books!\nThis position will have an annual salary of $140,000-$165,000\nMacmillan Publishers is the U.S. trade division of the Holtzbrinck Publishing Group, a large family-owned media company headquartered in Stuttgart, Germany. Its publishing companies include prominent imprints around the world that publish a broad range of award-winning books for children and adults in all categories and formats.\nU.S. publishers include Celadon Books, Farrar, Straus and Giroux, Flatiron Books, Henry Holt & Company, Macmillan Audio, Macmillan Children’s Publishing Group, The St. Martin's Publishing Group, and Tor Publishing Group. In the UK, Australia, India, and South Africa, Macmillan publishes under the Pan Macmillan name. The German company, Holtzbrinck Deutsche Buchverlage, includes among its imprints S. Fischer, Kiepenheuer & Witsch, Rowohlt, and Droemer Knaur.\nWe are an Equal Opportunity Employer. We are actively seeking job applicants who reflect a broad representation of differences, including race, ethnicity, religion, sex, sexual orientation, gender identity/expression, physical ability, neurodiversity, age, family status, economic background and status, geographical background and status, and perspective. We believe that the best companies reflect the incredible diversity in viewpoints, backgrounds, and identities of the world in their staffs, and are committed to inclusive hiring across departments and levels. The successful candidate for this position will be an employee of Macmillan Publishing Group, LLC.\nShow Less\nReport",
    "title": "KEY NOT FOUND: ctas.save",
    "company": "Macmillan Publishers",
    "location": "Lead Data Engineer",
    "salary": null,
    "seniority_level": null,
    "employment_type": null,
    "job_function": null,
    "industries": null,
    "hiring_manager": null
}