{
    "id": "b92c2cbb-b0a2-49ff-9831-6432affa729c",
    "url": "https://www.glassdoor.com/Job/lead-python-engineer-jobs-SRCH_KO0,20.htm?suggestCount=0&suggestChosen=false&clickSource=searchBtn&typedKeyword=Lead%2520Python%2520Engineer",
    "description": "Locations: US Remote, United States of America\nLead Data Engineer (Remote)\nDo you love building and pioneering in the technology space? Do you enjoy solving complex business problems in a fast-paced, collaborative, inclusive, and iterative delivery environment? At Capital One, you'll be part of a big group of makers, breakers, doers and disruptors, who solve real problems and meet real customer needs. We are seeking Data Engineers who are passionate about marrying data with emerging technologies. As a Capital One Lead Data Engineer, you’ll have the opportunity to be on the forefront of driving a major transformation within Capital One.\nWhat You’ll Do:\nCollaborate with and across Agile teams to design, develop, test, implement, and support technical solutions in full-stack development tools and technologies\nWork with a team of developers with deep experience in machine learning, distributed microservices, and full stack systems\nUtilize programming languages like Java, Scala, Python and Open Source RDBMS and NoSQL databases and Cloud based data warehousing services such as Redshift and Snowflake\nShare your passion for staying on top of tech trends, experimenting with and learning new technologies, participating in internal & external technology communities, and mentoring other members of the engineering community\nCollaborate with digital product managers, and deliver robust cloud-based solutions that drive powerful experiences to help millions of Americans achieve financial empowerment\nPerform unit tests and conduct reviews with other team members to make sure your code is rigorously designed, elegantly coded, and effectively tuned for performance\n\nBasic Qualifications:\nBachelor’s Degree\nAt least 6 years of experience in application development (Internship experience does not apply)\nAt least 2 years of experience in big data technologies\nAt least 1 year experience with cloud computing (AWS, Microsoft Azure, Google Cloud)\nPreferred Qualifications:\n7+ years of experience in application development including Python, SQL, Scala, or Java\n4+ years of experience with a public cloud (AWS, Microsoft Azure, Google Cloud)\n4+ years experience with Distributed data/computing tools (MapReduce, Hadoop, Hive, EMR, Kafka, Spark, Gurobi, or MySQL)\n4+ year experience working on real-time data and streaming applications\n4+ years of experience with NoSQL implementation (Mongo, Cassandra)\n4+ years of data warehousing experience (Redshift or Snowflake)\n4+ years of experience with UNIX/Linux including basic commands and shell scripting\n2+ years of experience with Agile engineering practices\nAt this time, Capital One will not sponsor a new applicant for employment authorization for this position.\nThe minimum and maximum full-time annual salaries for this role are listed below, by location. Please note that this salary information is solely for candidates hired to perform work within one of these locations, and refers to the amount Capital One is willing to pay at the time of this posting. Salaries for part-time roles will be prorated based upon the agreed upon number of hours to be regularly worked.\nLocation is New York City: $197,400 - $225,300 for Lead Data Engineer\nLocation is San Francisco, California: $209,200 - $238,700 for Lead Data Engineer\nRemote roles in other areas of New York & California, and across Colorado & Washington: $167,400 - $191,000 for Lead Data Engineer\nCandidates hired to work in other locations will be subject to the pay range associated with that location, and the actual annualized salary amount offered to any candidate at the time of hire will be reflected solely in the candidate’s offer letter.\nThis role is also eligible to earn performance based incentive compensation, which may include cash bonus(es) and/or long term incentives (LTI). Incentives could be discretionary or non discretionary depending on the plan.\nCapital One offers a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being. Learn more at the Capital One Careers website. Eligibility varies based on full or part-time status, exempt or non-exempt status, and management level.\nNo agencies please. Capital One is an Equal Opportunity Employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to sex, race, color, age, national origin, religion, physical and mental disability, genetic information, marital status, sexual orientation, gender identity/assignment, citizenship, pregnancy or maternity, protected veteran status, or any other status prohibited by applicable national, federal, state or local law. Capital One promotes a drug-free workplace. Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901-4920; New York City’s Fair Chance Act; Philadelphia’s Fair Criminal Records Screening Act; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1-800-304-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\nCapital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).\nTo apply to this job, click Apply Now\nShow Less\nReport",
    "title": "KEY NOT FOUND: ctas.save",
    "company": "Capital One",
    "location": "Lead Data Engineer (Remote)",
    "salary": null,
    "seniority_level": null,
    "employment_type": null,
    "job_function": null,
    "industries": null,
    "hiring_manager": null
}