{
    "id": "ba604476-d348-4174-a816-59bbc61b8d39",
    "url": "https://www.linkedin.com/jobs/view/senior-net-engineer-at-jobot-3542599716?refId=OcP09I1hKbROsXlnYYVHNw%3D%3D&trackingId=3zAgK%2B3qRxA06JtWDCp20g%3D%3D&position=13&pageNum=0",
    "description": "\n        Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!Job details100% REMOTE Senior .NET Developer / Senior Software Engineer Needed for Growing Security Company!This Jobot Job is hosted by Reed KellickAre you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.Salary $130,000 - $160,000 per yearA Bit About UsWe are the growing software division of an established organization in the security industry. Our company has been around for over 15 years and we employ over 300 people. Our team is currently looking to add a talented Senior .NET Software Developer / Senior Full Stack Engineer to the group!Why join us?As a Senior .NET Software Engineer / Senior Full Stack Developer in our company, we are able to offer Competitive base salary between $130k and $160k! A discretionary and performance based year-end bonus! 401k! Disability! PTO! Medical, dental and vision coverage!Job DetailsAs a Senior C# Developer/ Senior Fullstack Engineer on our team, we are looking for Strong C# / .NET background Vue.js experience strongly preferred. Strong JavaScript/TypeScript background is a must AWS background would be a plus Must be willing to take a 1 hour assessment after your first interviewInterested in hearing more? Easy Apply now by clicking the \"Apply\" button.Want to learn more about this role and Jobot?Click our Jobot logo and follow our LinkedIn page!\n",
    "title": null,
    "company": null,
    "location": null,
    "salary": null,
    "seniority_level": "\n            Mid-Senior level\n          ",
    "employment_type": "\n          Full-time\n        ",
    "job_function": "\n            Engineering and Information Technology\n          ",
    "industries": "\n          IT Services and IT Consulting and Software Development\n          ",
    "hiring_manager": null
}