{
    "id": "c4e94941-5f2f-454a-a2a6-01b543d0d2d6",
    "url": "https://www.glassdoor.com/Job/lead-python-engineer-jobs-SRCH_KO0,20.htm?suggestCount=0&suggestChosen=false&clickSource=searchBtn&typedKeyword=Lead%2520Python%2520Engineer",
    "description": "The Advanced/Lead Scientist, Energy Solutions leads H&V Battery Testing Laboratory and Research and Development activities for Battery products including absorptive glass mat (AGM) Lead-acid battery separators. Leads new product / process initiatives using established scientific techniques leading to commercialization of products.\nESSENTIAL FUNCTIONS AND RESPONSIBILITIES:\nElectrochemistry & battery lab responsibilities\nProvide expert electrochemistry guidance to the Battery Product Development group.\nLead battery testing including characterization, life testing and abuse testing.\nContinuously develop and improve testing processes and methodologies through revisions to test protocols, testing equipment for reliability, and quality\nPerform benchmarking of battery evaluation of competitive products and competing electrochemical systems.\nContribute to product design aspects, understanding and utilizing impact of electrochemistry on lead-acid batteries.\nDemonstrate proper safety practices and continuously improve level of safety for the Battery and Development laboratories.\nLead product or process development projects for products including glass mat and other wetlaid composites.\nWork directly with customers and Sales & Marketing to develop new products for existing markets opportunities.\nUtilize expertise in materials technology to plan, execute and evaluate laboratory, pilot and production scale development projects.\nApply appropriate Design of Experiment (DOE), Six Sigma tools (DMAIC,DFSS) and Stage Gate processes in development projects.\nPatent novel inventions.\nCommunicate effectively, support teammate’s growth and forge collaborative relationships within the company and externally.\nCommunicate plans and results effectively.\nSupervise laboratory technicians to perform technical work and support their professional and personal skill base to maximumize potential.\nInfluence scientists and managers at multiple locations.\nDevelop relationships with customers and suppliers.\nProvide technical reports, papers and presentations to internal and external project stakeholders and to the greater battery industry.\nKeep abreast of relevant industry, applications and materials technology trends through literature, seminars and market contact.\nEDUCATION AND EXPERIENCE:\nBS or higher degree in Chemical Engineering, Materials Science Engineering, Electrical Engineering plus 5+ years relevant R&D work experience in electrochemical systems OR completed Ph.D. in Electrochemical Engineering, Chemical Engineering or Chemistry working in the electrochemical area.\nExperience working in a testing environment or in a design, process, or academic role that required test responsibility; electrochemical or battery testing\nProficiency with scripting languages and/or statistical software, Python/JMP\nClear analytical thinking, attention to detail, problem solving skills and creativity\nHands-on skills in battery cell construction, electrode preparation, tools and machining skills\nSkill in 3D CAD modeling and familiarity with additive (3D printing) and subtractive (CNC routing/milling) a plus\nPHYSICAL REQUIREMENTS AND ENVIRONMENT:\nPotential musculoskeletal stresses from repetitive motion of arms/hands, standing for prolonged periods, performing frequent bending and twisting motions, lifting of light weight objects.\nSteady hands and dexterity to perform tasks repeatedly and accurately.\nPerform tasks that require constant state of alertness.\nWork performed in laboratory environment with potential exposure to hazardous materials.\nWork performed in production area with potential exposure to large equipment/machinery and loud noises.\nAble to lift 20 lbs\nHollingsworth & Vose is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, gender, sexual orientation, gender identity or expression, religion, national origin, marital status, age, disability, veteran status, genetic information, or any other protected status\nJob Type: Full-time\nBenefits:\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nParental leave\nProfessional development assistance\nReferral program\nTuition reimbursement\nVision insurance\nSchedule:\n8 hour shift\nWork Location: In person\nShow Less\nReport",
    "title": "KEY NOT FOUND: ctas.save",
    "company": "Hollingsworth & Vose Company",
    "location": "Advanced/Lead Scientist, Energy Solutions",
    "salary": null,
    "seniority_level": null,
    "employment_type": null,
    "job_function": null,
    "industries": null,
    "hiring_manager": null
}