{
    "id": "c910f1db-a4d8-41b6-b630-5d5d7ddce3a0",
    "url": "https://www.glassdoor.com/Job/lead-python-engineer-jobs-SRCH_KO0,20.htm?suggestCount=0&suggestChosen=false&clickSource=searchBtn&typedKeyword=Lead%2520Python%2520Engineer",
    "description": "JOB PURPOSE\nTo ensure that electrical design software development, embedded code, device drivers, is compliant with customer requirements and all relevant standards, rules, and regulations.\nJOB RESPONSIBILITY SUMMARY\nCoordinate all activities within the software development discipline\nCarry out detailed design, planning and calculations and verify the software completed by others\nEnsure appropriate engineering and design methods are applied by all within the discipline\nEnsure all design engineering procedures are followed consistently across the discipline\nProvide guidance and advice to all within the design team\nDevelop methods and procedures to improve efficiency and quality\nEnsure latest Rules and requirements are understood by all within the engineering team\nCreate processes and ensure all processes are followed and in compliance with ISO9001-2015\nDefines, creates, develops, and verifies product designs and related intellectual property, conferring with other engineering personnel and resolving problems as required.\nResearches and analyzes available specifications, tools and components related to product designs and test.\nPerforms feasibility, cost, and reliability analyses of product proposals to influence decisions related to design tradeoffs and specifications.\nCollaborates with members of interdisciplinary teams to implement and release high quality, reliable, designs to production.\nFollows development processes and manages project and product data as required for long-range customer and product support.\nQualifies potential design partners, software vendors, and commodity vendors.\nCompiles and verifies project verification data.\nCompetent in the use of software development software\nAble to problem solve and troubleshoot as the need arises\nKeep current with the latest technical innovations in software development\nDevelops software by studying customer requirements, researching, testing manufacturing and assembly methods and materials.\nMaintains professional and technical knowledge by attending educational workshops; reviewing professional publications; establishing personal networks; participating in professional societies.\nContributes to team effort by accomplishing related results as needed.\nManages multidiscipline teams to implement projects as needed\nREQUIRED KNOWLEDGE, SKILLS, & ABILITIES\nElectronic Systems, Electronics Troubleshooting, Electronic Testing Design, Project Management, Quality Focus, Database Design, Analyzing Information , Reporting Research Results, Attention to Detail, Emphasizing Excellence, Innovation\nEducation\nRequired: Bachelor’s Degree in Computer Science\nPreferred: MS degree Computer Science\nExperience\nRequired: 10+ years of Software development experience\nPreferred: Minimum of 15 years’ work experience in a product development environment\nSpecial Knowledge/Skills\nProgramming Languages: C, C++, Java, C#, ARM assembly, Python\nTool Chains: Microsoft Visual Studio(all versions), GNU Compiler Collection, Mentor GraphicsCode Sourcery, Windriver Diab, GHS Compiler/MULTI, IAR\nEmbedded Development Environments: Sourcery Codebench with Sourcery Probe, Windriver Workbench with ICE, IAR With J-Link/Trace, GHS Probe w/ MULTI, TI Codebench, Eclipse CDT\nOperating Systems: MS Windows(XP+), Linux(Debian, Ubuntu, Redhat/Centos, Embedded Linux (STLinux, Yocto), VxWorks, Nucleus RTOS, GHS Integrity, FreeRTOS, TI RTOS\nCPU Architectures: ARMv7(Cortex-A, Cortex-M), PowerPC, x86, AVR, ARMv8\nBuses/Protocols: I2C/SMBus, PCIe, Ethernet, HDLC, SPI, Custom busses, BLE, TCP/IP, IPv6,SSL/TLS\nGeneral Development Tools: CVS, TFS, Continuus, SVN, Mercurial, Git, Change Synergy, Rational ReqPro, MS Office, Logic analyzer (Agilent), Oscilloscopes, signal generators, multimeters\nBenefits\nHealth Care\nVision\nDental\nSimple IRA with company matching funds\n10 Paid Holidays\nFlex Time PTO\nCompany Paid Life Insurance\nCompany Paid Long Term Disability\nJob Type: Full-time\nPay: $140,000.00 - $175,000.00 per year\nBenefits:\n401(k)\n401(k) matching\nDental insurance\nFlexible schedule\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nVision insurance\nSchedule:\n8 hour shift\nDay shift\nMonday to Friday\nSupplemental pay types:\nBonus pay\nAbility to commute/relocate:\nNorwood, MA: Reliably commute or planning to relocate before starting work (Required)\nExperience:\nSoftware Development: 10 years (Required)\nWork Location: In person\nShow Less\nReport",
    "title": "Lead Firmware Development Engineer",
    "company": "KEY NOT FOUND: ctas.save",
    "location": "Norwood, MA",
    "salary": null,
    "seniority_level": null,
    "employment_type": null,
    "job_function": null,
    "industries": null,
    "hiring_manager": null
}