{
    "id": "d030d11a-3ab1-4575-8675-2048409c0a06",
    "url": "https://www.glassdoor.com/Job/lead-python-engineer-jobs-SRCH_KO0,20.htm?suggestCount=0&suggestChosen=false&clickSource=searchBtn&typedKeyword=Lead%2520Python%2520Engineer",
    "description": "The Lead Python Engineer will re-envision a legacy risk platform and build a state of the art, scalable, cloud native platform in Python. The is an unusual opportunity to put your signature on the design and implementation of a new platform where you will:\n\nWhat you'll do:\nMake macro/micro architectural proposals and collaborate with other architectures\nStructure a brand new code base to enable modularity, code reuse and granular API access\nWork with cutting edge, cloud native data technologies\nEngage with business stakeholder and tech leadership to understand requirements\nWrite initial implementations of critical code patterns\nDevise an automated testing strategy\nLead a cross functional team\nMentor a team of engineers to bring your technology vision to life\nSet and uphold standards for code quality\nSKILLS AND EXPERIENCE\nHave 2+ years of experience guiding teams in the successful delivery of web applications\nHave 7+ years of experience in the delivery and support of web applications\nAdvanced knowledge of Python and Flask\nEnjoy working in an agile delivery environment\nCan lead in the delivery of a CI/CD environment\nCan lead as an individual contributor and the review of pull requests\nCan lead on simple to complex Debugging / Troubleshooting problems\nCan lead with implementing observability in your application\nWe are hiring across multiple levels for this job.\nThe base salary range across different levels are -\nMid to Senior level – $140,000 - $210,000\nSenior level - $200,000 - $225,000\nLeadership level - $210,000 - $250,000\nPlacement within the range provided above is based on the individual’s relevant experience and skills for the role and level. We are hiring across multiple levels for this job.\n\nBase salary is only one component of our total compensation package. Employees may be eligible for a discretionary bonus, which is determined upon company and individual performance.\nSalary range disclosure as required by S9427A when hiring in New York.\n\nLab49 is a specialist strategy, design, and technology consulting company dedicated to the financial services industry. We were founded in 2002 to fill a need in the Financial Technology marketplace for high-end execution and reliable delivery of technology projects.\n\nOur consultants are experts in strategy, user experience, architecture, engineering, and delivery management. We combine knowledge of the latest trends in technology with deep domain expertise to deliver innovative solutions with accelerated time-to-market.\n\nWe have office hubs in Midtown Manhattan, Washington DC, London, Budapest, New Delhi and Sydney.\n\nLab49/ION is committed to maintaining a supportive and inclusive environment for people with diverse backgrounds and experiences. We respect the varied identities, abilities, cultures, and traditions of the individuals who comprise our organization and recognize the value that different backgrounds and points of view bring to our business.\nLab49/ION adheres to an equal employment opportunity policy that prohibits discriminatory practices or harassment against applicants or employees based on any legally impermissible factor.\nStart your job application: click Apply Now\nShow Less\nReport",
    "title": "KEY NOT FOUND: ctas.save",
    "company": "Lab49",
    "location": "Lead Python Engineer",
    "salary": null,
    "seniority_level": null,
    "employment_type": null,
    "job_function": null,
    "industries": null,
    "hiring_manager": null
}