[
    {
        "title": null,
        "company": null,
        "description": "RemoteData Engineer12+ MonthsDevelop and maintain SQL scripts, stored procedures, and queries to extract and manipulate\ndata from various sources, including MSSQL and Postgres databases.Work with MuleSoft (Mule) for data integration and API\ndevelopment, if required or willing to learn it.Monitor and optimize data pipelines, troubleshoot issues, and ensure\ndata integrity and performance.Collaborate with data analysts to understand data requirements and support their data\nanalysis and modeling efforts.Stay up to date with industry trends, best practices, and emerging technologies related to\ndata engineering, Snowflake, ETL, SQL, and related tools.Solid understanding and hands-on experience with ETL tools and\nframeworks.Excellent communication and collaboration skills to work effectively with cross-functional teams.",
        "location": null,
        "salary": null,
        "job_function": "Information Technology",
        "industries": "IT Services and IT Consulting",
        "employment_type": "Contract",
        "seniority_level": "Mid-Senior level",
        "education_level": null,
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-accroid-\ninc-3778553874?refId=yYkaI0G4nwepPxFJ3klj8A%3D%3D&trackingId=o2sgacdM4tWj%2BuQyJl4lNg%3D%3D&position=17&pageNum=0"
    },
    {
        "title": null,
        "company": null,
        "description": "Role: Data Engineer (DE)Location: Scottsdale AZ (day 1 onsite)Duration: Fulltime Must have skill set: Java, Scala,\nPython, Spark, S3, Glue, RedshiftYou have 6-8 years of relevant software development experience. You have hands-on\nexperience in Java/Scala/Python, Spark, S3, Glue, Redshift. This is critical. Highly analytical and data oriented.\nExperience in SQL, NoSql Database Data masking of on prem PII data. Develop API calls with using secure data transfer.\nTake standard output data to lower environments for pre prod testing! Enable secured channels for data models and data\nscience activities. Need a solution that can scale to handle millions of data. i.e., masking 10 million records in 15\nmins You have experience with development tools and agile methodologies.",
        "location": null,
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Human Resources Services",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "education_level": null,
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-de-at-zortech-solutions-\n3778562998?refId=yYkaI0G4nwepPxFJ3klj8A%3D%3D&trackingId=m5Ttw%2BALz%2FZBFTL2QLNOjw%3D%3D&position=13&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "KPIT",
        "description": "We KPIT (www.kpit.com) are a global technologies company specializing in CASE (Connected, Autonomous, Shared, Electric)\ndomains. Systems and Software in Electric & Conventional Powertrain, Autonomous Driving & ADAS, Digital Connected\nSolutions, Connected Vehicles, Vehicle Diagnostics, and Vehicle Networks.Join the leading software development and\nintegration team helping mobility leapfrog towards a clean, smart, and safe future. A company specializing in embedded\nsoftware, AI, and digital solutions, KPIT accelerates clients’ implementation of next-generation\ntechnologies.Responsibilities:Develop and maintain ETL (Extract, Transform, Load) processes for efficient data\nintegration.Able to design and implement database schemas and write queries to retrieve and manipulate data.Build and\noptimize efficient data pipelines and architectures.Ensure data availability, integrity, and security.Using scripting\nlanguages (e.g., Python, Bash) for automation of data workflows and processes.Implementing containerization (e.g.,\nDocker) and orchestration tools (e.g., Kubernetes) for efficient deployment and management of data\napplications.Collaborate with data scientists, analysts, and other stakeholders to understand data\nrequirements.Requirements:Bachelor’s/master’s degree.Experience in data engineer role.Proficiency in designing and\nimplementing ETL processes to move and transform data (e.g., extracting data, data cleaning, joining data).Proficient in\nat least one programming language, such as Python, Java, or Scala.Proficiency in using SQL for data querying and\nmanipulation.Good understanding of database systems, both relational and NoSQL.Good understanding of data warehousing\nand big data technologies, such as Hadoop, Spark, and Kafka, Amazon Redshift, Google BigQuery.Knowledge on Apache Spark\nand PySpark.Familiarity with AWS/Azure/GCP Cloud platform.Familiar with concepts such as scalability, fault tolerance,\nand load balancing.Good understanding of continuous integration/continuous delivery (CI/CD).Knowledge of\ncontainerization (e.g., Docker) and orchestration tools (e.g., Kubernetes).",
        "location": "Global",
        "salary": null,
        "job_function": "Engineering",
        "industries": "Motor Vehicle Manufacturing",
        "employment_type": "Full-time",
        "seniority_level": "Associate",
        "education_level": "Bachelor’s/master’s degree",
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-\nkpit-3763812955?refId=ACNf%2FwdQfBNm%2BGsMg51brQ%3D%3D&trackingId=cdHLS4Mhb2zM5bcKTu3o%2BA%3D%3D&position=25&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Sierra",
        "description": "Data EngineerSierra has been asked by a large risk management and intelligence services firm to identify a Data Engineer\nto join their staff. You'll play a critical role in designing, building, and maintaining thier dark web and open-source\ndata repositories, search applications, and APIs. Will also work closely with a cross-functional team to improve and\nmaintain the reliability, scalability, and performance of these tools and technologies.PAY: 150K plus 10% bonus, great\nbenefits. No sponsorship available.LOCATION: Hybrid remote/in-office in downtown Chicago (2-3 dayds per week). Chicago\narea applicants only - no third parties please.ResponsibilitiesDesign and develop scalable search applications to enable\nefficient data retrieval and indexing from the deep and dark web.Work with internal and external stakeholders to\noptimize data infrastructure and identify cost savings, where possible.Build and maintain data pipelines to ingest,\ntransform, and process large volumes of open, deep, and dark web data from diverse sources.Develop and maintain API\nendpoints for querying dark web data, ensuring efficient and reliable access to our systems.Monitor and optimize search\nperformance, address bottlenecks, and implement enhancementsImplement data quality and validation measures to ensure\naccuracy and integrity of indexed data.Identify and integrate optimal database solutions.QualificationsExpertise in data\nmodeling, infrastructure design, and data integration to enhance thier dataBachelor's or Master's degree in Computer\nScience, Data Science, or a related field.Proficiency in working with large-scale data processing frameworks, especially\nElasticsearchSolid understanding of data modeling and schema design principles for efficient search and\nretrievalFamiliarity with open source intelligence (OSINT) and/or dark web intelligence collection and/or\nprocessesExperience with API development and management, including authentication, versioning, and performance\noptimizationProven experience as a Data Engineer, preferably in the development and management of search engines and\nAPIsDemonstrated knowledge of cloud platforms, especially AWS and AzureExcellent communication and collaboration skills\nto work effectively in a cross-functional team environmentFamiliarity with building CI/CD pipelines to ensure the\ndelivery of high-quality softwareKnowledge of data privacy and security considerations when working with sensitive\ndataStrong programming skills in Python",
        "location": "Hybrid remote/in-office in downtown Chicago (2-3 days per week)",
        "salary": "150K plus 10% bonus",
        "job_function": "Information Technology",
        "industries": "Information Services",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "education_level": "Bachelor's or Master's degree in Computer Science, Data Science, or a related field",
        "notes": "",
        "hiring_manager": "Not specified",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-chicago-165k-at-sierra-\nits-3676932344?refId=INeQLMNNzZr3z6agBAxedA%3D%3D&trackingId=%2FY9Cx%2Bx36mWmZ57XKyedAQ%3D%3D&position=10&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Fusemachines",
        "description": "About FusemachinesFusemachines is a leading AI strategy, talent, and education services provider. Founded by Sameer\nMaskey Ph.D., Adjunct Associate Professor at Columbia University, Fusemachines has a core mission of democratizing AI.\nWith a presence in 4 countries (Nepal, United States, Canada, and Dominican Republic and more than 350 full-time\nemployees) Fusemachines seeks to bring its global expertise in AI to transform companies around the world.About the\nrole:This is a remote, 6 months contract role, with a possibility of extension, responsible for designing, building, and\nmaintaining the infrastructure required for data integration, storage, processing, and analytics (BI, visualization and\nAdvanced Analytics). Working in the Financial sector and implementing cyber-security use cases.Salary Range:\nUS$7000/monthJob Type: 1099 ContractStart Date: The contract for this position is scheduled to begin in January\n2024Qualification / Skill Set Requirement:3+ years of real-world data engineering development experience in Snowflake\nand AWS (certifications preferred)Proven experience as a Snowflake Developer, with a strong understanding of Snowflake\narchitecture and concepts.Proficient in snowflake services such as snowpipe, stages, stored procedures, views,\nmaterialized views, tasks and streams.Must have previous experience working with security datasetsStrong programming\nskills in SQL, with proficiency in writing efficient and optimized code for data integration, storage, processing, and\nmanipulation.Robust understanding of data partitioning and other optimization techniques in Snowflake.Knowledge of data\nsecurity measures in Snowflake, including role-based access control (RBAC) and data encryption.Highly skilled in one or\nmore languages such as Python, Scala, and proficient in writing efficient and optimized code for data integration,\nstorage, processing and manipulation.Strong knowledge of SDLC tools and technologies, including project management\nsoftware (Jira or similar), source code management (GitHub or similar), CI/CD system (GitHub actions, AWS CodeBuild or\nsimilar) and binary repository manager (AWS CodeArtifact or similar).Skilled in Data Integration from different sources\nsuch as APIs, databases, flat files, event streaming.Good understanding of Data Modeling and Database Design Principles.\nBeing able to design and implement efficient database schemas that meet the requirements of the data architecture to\nsupport data solutions.Strong experience in working with ELT and ETL tools and being able to develop custom integration\nsolutions as needed.Strong experience with scalable and distributed Data Technologies such as Spark/PySpark, DBT and\nKafka, to be able to handle large volumes of data.Strong experience in designing and implementing Data Warehousing\nsolutions in AWS with RedShift. Demonstrated experience in designing and implementing efficient ELT/ETL processes that\nextract data from source systems, transform it (DBT), and load it into the data warehouse.Strong experience in\nOrchestration using Apache Airflow.Expert in Cloud Computing in AWS, including deep knowledge of a variety of AWS\nservices like Lambda, Kinesis, S3, Lake Formation, EC2, ECS/ECR, IAM, CloudWatch, Redshift, etcGood understanding of\nData Quality and Governance, including implementation of data quality checks and monitoring processes to ensure that\ndata is accurate, complete, and consistent.Good Problem-Solving skills: being able to troubleshoot data processing\npipelines and identify performance bottlenecks and other issues.Responsibilities:Follow established design, constructed\ndata architectures. Developing and maintaining data pipelines, ensuring data flows smoothly from source to destination.\nHandle ELT processes, including data extraction, loading, transformation and load data from various sources into\nSnowflake.Ensure the reliability, scalability, and efficiency of data systems are maintained at all timesAssist in the\nconfiguration and management of Snowflake data warehousing and data lake solutions, working under the guidance of senior\nteam members.Collaborate closely with cross-functional teams including Product, Engineering, Data Scientists, and\nAnalysts to thoroughly understand data requirements and provide data engineering support.Contribute to data quality\nassurance efforts, such as implementing data validation checks and tests.Evaluate and implement cutting-edge\ntechnologies and continue learning and expanding skills in data engineering and cloud platforms.Develop, design, and\nexecute data governance strategies encompassing cataloging, lineage tracking, quality control, and data governance\nframeworks that align with current analytics demands and industry best practicesDocument data engineering processes and\ndata flows.Care about architecture, observability, testing, and building reliable infrastructure and data\npipelines.Takes ownership of storage layer, SQL database management tasks, including schema design, indexing, and\nperformance tuning.Swiftly address and resolve complex data engineering issues, incidents and resolve bottlenecks in SQL\nqueries and database operations.Assess best practices and design schemas that matches business needs for delivering a\nmodern analytics solution (descriptive, diagnostic, predictive, prescriptive)Be an active member of our Agile team,\nparticipating in all ceremonies and continuous improvement activities.Equal Opportunity Employer: Race, Color, Religion,\nSex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran\nStatus, or any other legally protected group status.Powered by JazzHRshDrx201iX",
        "location": "Remote",
        "salary": "US$7000/month",
        "job_function": "Information Technology",
        "industries": "Internet Publishing",
        "employment_type": "Contract",
        "seniority_level": "Mid-Senior level",
        "education_level": "N/A",
        "notes": "",
        "hiring_manager": "N/A",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-fusemachines-\n3733596267?refId=INeQLMNNzZr3z6agBAxedA%3D%3D&trackingId=QT0wp%2Bv2xp8ufPnqrnn3xQ%3D%3D&position=24&pageNum=0"
    },
    {
        "title": "Big Data Engineer",
        "company": "Walgreens",
        "description": "Job SummaryBuilds & maintains big data pipelines to support advanced analytics and data science solutions. Identifies\nvaluable internal and external data. Collaborates closely with data scientists to define data for the design,\ndevelopment, and deployment of new solutions that support business priorities.Job Responsibilities Develops software\nthat processes, stores and serves data for use by others.Develops data structures and pipelines to organize, collect and\nstandardize data that helps generate insights and addresses reporting needs.Writes ETL (Extract / Transform / Load)\nprocesses, designs database systems and develops tools for real-time and offline analytic processing.Develops data\npipelines that are scalable, repeatable and secure.Troubleshoots software and processes for data consistency and\nintegrity. Integrates data from a variety of sources, assuring that they adhere to data quality and accessibility\nstandards.Effectively resolves problems and roadblocks as they occur.Interacts with internal and external peers and/or\nmanagers to exchange semi-complex information related to assigned activities.About Walgreens and WBAWalgreens\n(www.walgreens.com) is included in the U.S. Retail Pharmacy and U.S. Healthcare segments of Walgreens Boots Alliance,\nInc. (Nasdaq: WBA), an integrated healthcare, pharmacy and retail leader with a 170 year heritage of caring for\ncommunities. WBA’s purpose is to create more joyful lives through better health. Operating nearly 9,000 retail locations\nacross America, Puerto Rico and the U.S. Virgin Islands, Walgreens is proud to be a neighborhood health destination\nserving nearly 10 million customers each day. Walgreens pharmacists play a critical role in the U.S. healthcare system\nby providing a wide range of pharmacy and healthcare services, including those that drive equitable access to care for\nthe nation’s medically underserved populations. To best meet the needs of customers and patients, Walgreens offers a\ntrue omnichannel experience, with fully integrated physical and digital platforms supported by the latest technology to\ndeliver high quality products and services in communities nationwide.Basic QualificationsBachelor's degree and at least\n2 years of experience in data engineering; OR Graduate Degree in a technical discipline.Advanced knowledge of\nSQLExperience establishing and maintaining key relationships with internal (peers, business partners and leadership) and\nexternal (business community, clients and vendors) within a matrix organization to ensure quality standards for\nservice.Experience analyzing and reporting data in order to identify issues, trends, or exceptions to drive improvement\nof results and find solutions.Willing to travel up to 10% of the time for business purposes (within state and out of\nstate).Preferred QualificationsGraduate Degree in a technical disciplineExperience with REST API developmentExperience\nwith Azure application deploymentExperience in Azure technologies like Azure Data Factory, Azure Databricks using Python\nor Scala, App Services, Azure Data Lake, Azure Functions, Event Hubs, Event Grids and Logic AppExperience in building\nAzure DevOPS pipelines to enable CI/CD, Infrastructure as Code (Iaas), and automation.",
        "location": "United States",
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Wellness and Fitness Services, Pharmaceutical Manufacturing, and Retail",
        "employment_type": "Full-time",
        "seniority_level": "Not Applicable",
        "education_level": "Bachelor's degree and at least 2 years of experience in data engineering; OR Graduate Degree in a technical discipline",
        "notes": "",
        "hiring_manager": "Not provided",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-talend-at-\nwalgreens-3763922227?refId=hUqfFzzrGisp%2F7qdM%2BRWqw%3D%3D&trackingId=krs8lYwI97XE0JhC41s94w%3D%3D&position=6&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Dollar General Corporation",
        "description": "Dollar General Corporation has been delivering value to shoppers for more than 80 years. Dollar General helps shoppers\nSave time. Save money. Every day.® by offering products that are frequently used and replenished, such as food, snacks,\nhealth and beauty aids, cleaning supplies, basic apparel, housewares and seasonal items at everyday low prices in\nconvenient neighborhood locations. Dollar General operates more than 18,000 stores in 47 states, and we’re still\ngrowing. Learn more about Dollar General at www.dollargeneral.com.General Summary Dollar General Corporation has been\ndelivering value to shoppers for more than 80 years. Dollar General helps shoppers Save time. Save money. Every day.® by\noffering products that are frequently used and replenished, such as food, snacks, health and beauty aids, cleaning\nsupplies, basic apparel, housewares and seasonal items at everyday low prices in convenient neighborhood locations.\nDollar General operates more than 18,000 stores in 47 states, and we’re still growing. Learn more about Dollar General\nat www.dollargeneral.com.Duties & Responsibilities Advanced working SQL knowledge and experience working with relational\ndatabases, query authoring (SQL) as well as working familiarity with a variety of databases.Assemble large, complex data\nsets that meet functional / non-functional business requirements.Identify, design, and implement internal process\nimprovements automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability,\netc.Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of\ndata sources using SQL and cloud technologies.Build analytics tools that utilize the data pipelines to provide\nactionable insights into customer acquisition, operational efficiency and other key business performance metrics.Work\nwith stakeholders including the Product, Data and Design teams to assist with data-related technical issues and support\ntheir data infrastructure needs.Knowledge, Skills and Abilities Knowledge of programming languages (e.g. Java and\nPython)Hands-on experience with SQL database designGreat numerical and analytical skillsDegree in Computer Science, IT,\nor similar field; a Master’s is a plusData engineering certification (e.g IBM Certified Data Engineer) is a\nplusExperience with big data tools Hadoop, Spark, Kafka, etc.Experience with relational SQL and NoSQL databases,\nincluding Postgres and Cassandra.Experience with data pipeline and workflow management tools Azkaban, Luigi, Airflow,\netc.Experience with Snowflake/Azure cloud services EC2, EMR, RDS, RedshiftExperience with stream-processing systems\nStorm, Spark-Streaming, etc.Experience with object-oriented/object function scripting languages Python, Java, C++,\nScala, etcWork Experience &/or Education Degree in information technology or computer science with additional vendor-\nspecific certification.BS or MS degree in Computer Science or a related technical field4+ years of Python or Java\ndevelopment experience4+ years of SQL experience (No-SQL experience is a plus)4+ years of experience with schema design\nand dimensional data modelingAbility in managing and communicating data warehouse plans to internal clientsExperience\ndesigning, building, and maintaining data processing systemsExperience working with a cloud platform such as Snowflake /\nAzure or Databricks#mogul#",
        "location": "N/A",
        "salary": "N/A",
        "job_function": "Information Technology",
        "industries": "Retail",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "education_level": "Degree in Computer Science, IT, or similar field; a Master’s is a plus",
        "notes": "",
        "hiring_manager": "N/A",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-dollar-\ngeneral-3745487485?refId=ld9q3KSO2a4lEIsngwp2vg%3D%3D&trackingId=Abt%2BuR6icV3J7h%2B42Vt6NQ%3D%3D&position=25&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Dollar General Corporation",
        "description": "Dollar General Corporation has been delivering value to shoppers for more than 80 years. Dollar General helps shoppers\nSave time. Save money. Every day.® by offering products that are frequently used and replenished, such as food, snacks,\nhealth and beauty aids, cleaning supplies, basic apparel, housewares and seasonal items at everyday low prices in\nconvenient neighborhood locations. Dollar General operates more than 18,000 stores in 47 states, and we’re still\ngrowing. Learn more about Dollar General at www.dollargeneral.com.General Summary Dollar General Corporation has been\ndelivering value to shoppers for more than 80 years. Dollar General helps shoppers Save time. Save money. Every day.® by\noffering products that are frequently used and replenished, such as food, snacks, health and beauty aids, cleaning\nsupplies, basic apparel, housewares and seasonal items at everyday low prices in convenient neighborhood locations.\nDollar General operates more than 18,000 stores in 47 states, and we’re still growing. Learn more about Dollar General\nat www.dollargeneral.com.Duties & Responsibilities Advanced working SQL knowledge and experience working with relational\ndatabases, query authoring (SQL) as well as working familiarity with a variety of databases.Assemble large, complex data\nsets that meet functional / non-functional business requirements.Identify, design, and implement internal process\nimprovements automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability,\netc.Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of\ndata sources using SQL and cloud technologies.Build analytics tools that utilize the data pipelines to provide\nactionable insights into customer acquisition, operational efficiency and other key business performance metrics.Work\nwith stakeholders including the Product, Data and Design teams to assist with data-related technical issues and support\ntheir data infrastructure needs.Knowledge, Skills and Abilities Knowledge of programming languages (e.g. Java and\nPython)Hands-on experience with SQL database designGreat numerical and analytical skillsDegree in Computer Science, IT,\nor similar field; a Master’s is a plusData engineering certification (e.g IBM Certified Data Engineer) is a\nplusExperience with big data tools Hadoop, Spark, Kafka, etc.Experience with relational SQL and NoSQL databases,\nincluding Postgres and Cassandra.Experience with data pipeline and workflow management tools Azkaban, Luigi, Airflow,\netc.Experience with Snowflake/Azure cloud services EC2, EMR, RDS, RedshiftExperience with stream-processing systems\nStorm, Spark-Streaming, etc.Experience with object-oriented/object function scripting languages Python, Java, C++,\nScala, etcWork Experience &/or Education Degree in information technology or computer science with additional vendor-\nspecific certification.BS or MS degree in Computer Science or a related technical field4+ years of Python or Java\ndevelopment experience4+ years of SQL experience (No-SQL experience is a plus)4+ years of experience with schema design\nand dimensional data modelingAbility in managing and communicating data warehouse plans to internal clientsExperience\ndesigning, building, and maintaining data processing systemsExperience working with a cloud platform such as Snowflake /\nAzure or Databricks#mogul#",
        "location": "Unknown",
        "salary": "Unknown",
        "job_function": "Information Technology",
        "industries": "Retail",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "education_level": "Degree in Computer Science, IT, or similar field; a Master’s is a plus",
        "notes": "",
        "hiring_manager": "Unknown",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-dollar-\ngeneral-3745487485?refId=KiOufBohy9Hx7d%2BO7QPHXA%3D%3D&trackingId=ZaHR3aKH%2FaomcLvReZzhyA%3D%3D&position=22&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "KPIT",
        "description": "We KPIT (www.kpit.com) are a global technologies company specializing in CASE (Connected, Autonomous, Shared, Electric)\ndomains. Systems and Software in Electric & Conventional Powertrain, Autonomous Driving & ADAS, Digital Connected\nSolutions, Connected Vehicles, Vehicle Diagnostics, and Vehicle Networks.Join the leading software development and\nintegration team helping mobility leapfrog towards a clean, smart, and safe future. A company specializing in embedded\nsoftware, AI, and digital solutions, KPIT accelerates clients’ implementation of next-generation\ntechnologies.Responsibilities:Develop and maintain ETL (Extract, Transform, Load) processes for efficient data\nintegration.Able to design and implement database schemas and write queries to retrieve and manipulate data.Build and\noptimize efficient data pipelines and architectures.Ensure data availability, integrity, and security.Using scripting\nlanguages (e.g., Python, Bash) for automation of data workflows and processes.Implementing containerization (e.g.,\nDocker) and orchestration tools (e.g., Kubernetes) for efficient deployment and management of data\napplications.Collaborate with data scientists, analysts, and other stakeholders to understand data\nrequirements.Requirements:Bachelor’s/master’s degree.Experience in data engineer role.Proficiency in designing and\nimplementing ETL processes to move and transform data (e.g., extracting data, data cleaning, joining data).Proficient in\nat least one programming language, such as Python, Java, or Scala.Proficiency in using SQL for data querying and\nmanipulation.Good understanding of database systems, both relational and NoSQL.Good understanding of data warehousing\nand big data technologies, such as Hadoop, Spark, and Kafka, Amazon Redshift, Google BigQuery.Knowledge on Apache Spark\nand PySpark.Familiarity with AWS/Azure/GCP Cloud platform.Familiar with concepts such as scalability, fault tolerance,\nand load balancing.Good understanding of continuous integration/continuous delivery (CI/CD).Knowledge of\ncontainerization (e.g., Docker) and orchestration tools (e.g., Kubernetes).",
        "location": "Global",
        "salary": null,
        "job_function": "Engineering",
        "industries": "Motor Vehicle Manufacturing",
        "employment_type": "Full-time",
        "seniority_level": "Associate",
        "education_level": "Bachelor's/master's degree",
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-\nkpit-3763812955?refId=5eyAniSzCOFqPd2ejukkvQ%3D%3D&trackingId=FEuQBYlAGtZS6hCxdomrzw%3D%3D&position=24&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "KPIT",
        "description": "We KPIT (www.kpit.com) are a global technologies company specializing in CASE (Connected, Autonomous, Shared, Electric)\ndomains. Systems and Software in Electric & Conventional Powertrain, Autonomous Driving & ADAS, Digital Connected\nSolutions, Connected Vehicles, Vehicle Diagnostics, and Vehicle Networks.Join the leading software development and\nintegration team helping mobility leapfrog towards a clean, smart, and safe future. A company specializing in embedded\nsoftware, AI, and digital solutions, KPIT accelerates clients’ implementation of next-generation\ntechnologies.Responsibilities:Develop and maintain ETL (Extract, Transform, Load) processes for efficient data\nintegration.Able to design and implement database schemas and write queries to retrieve and manipulate data.Build and\noptimize efficient data pipelines and architectures.Ensure data availability, integrity, and security.Using scripting\nlanguages (e.g., Python, Bash) for automation of data workflows and processes.Implementing containerization (e.g.,\nDocker) and orchestration tools (e.g., Kubernetes) for efficient deployment and management of data\napplications.Collaborate with data scientists, analysts, and other stakeholders to understand data\nrequirements.Requirements:Bachelor’s/master’s degree.Experience in data engineer role.Proficiency in designing and\nimplementing ETL processes to move and transform data (e.g., extracting data, data cleaning, joining data).Proficient in\nat least one programming language, such as Python, Java, or Scala.Proficiency in using SQL for data querying and\nmanipulation.Good understanding of database systems, both relational and NoSQL.Good understanding of data warehousing\nand big data technologies, such as Hadoop, Spark, and Kafka, Amazon Redshift, Google BigQuery.Knowledge on Apache Spark\nand PySpark.Familiarity with AWS/Azure/GCP Cloud platform.Familiar with concepts such as scalability, fault tolerance,\nand load balancing.Good understanding of continuous integration/continuous delivery (CI/CD).Knowledge of\ncontainerization (e.g., Docker) and orchestration tools (e.g., Kubernetes).",
        "location": "Global",
        "salary": null,
        "job_function": "Engineering",
        "industries": "Motor Vehicle Manufacturing",
        "employment_type": "Full-time",
        "seniority_level": "Associate",
        "education_level": "Bachelor’s/master’s degree",
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-\nkpit-3763812955?refId=Qozz%2FEQHEt%2Bj9JDO9K3q4g%3D%3D&trackingId=G2tiNcWKcF0nwH0F1HKi0A%3D%3D&position=24&pageNum=0"
    },
    {
        "title": "Data Engineer I",
        "company": "N/A",
        "description": "Title:Data Engineer I, Req# 27194964Location:Cupertino,CA(Hybrid)Contract: 12+ MonthJob Description Develop data\nautomation tool for collection, processing, and storing lab data. Set up, maintain, and monitor continuous operation\nclient devices in labs. Develop test scripts for various client devices. Maintain software revisions through GitHub.\nBuild ETL for telemetry field dataset and automate data integrity and optimization routines for automatic reporting,\nanalysis, and error detection. Analyze user and experimental data and use engineering and analytical understanding to\nresolve battery problems. Provide ad-hoc analysis as necessary.Qualifications 1+ years of experience in software\nengineering/data science engineering. Proficient in Python for data processing and analysis tool development. Proficient\nin Linux/Unix (Bash and Shell). Proficient in C for software development Proficient in revision control software such as\nGitHub. Strong working knowledge in designing, building, and maintaining data ETL pipeline. Experience in SQL.\nExperience in database modeling and data warehousing principles. Familiarity with job scheduling system. Experience in\ndata science and analytics, statistical analyses, A/B testing and conducting experiments and investigations in large-\nscale usage data environment. Self-started with a proven ability to handle multiple tasks with strict deadlines. Proven\ncreativity to go beyond current tools to deliver best solution to the problem. Outstanding problem solving, critical\nthinking and interpersonal skills.PayRate: $50-55/hr, W2",
        "location": "Cupertino, CA",
        "salary": "$50-55/hr, W2",
        "job_function": "Information Technology",
        "industries": "Staffing and Recruiting",
        "employment_type": "Contract",
        "seniority_level": "Entry level",
        "education_level": "N/A",
        "notes": "",
        "hiring_manager": "N/A",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-i-at-\nwinmax-3759969537?refId=KiOufBohy9Hx7d%2BO7QPHXA%3D%3D&trackingId=Gbk8PvOFOQ38NPx7P5QDeA%3D%3D&position=16&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Sierra",
        "description": "Data EngineerSierra has been asked by a large risk management and intelligence services firm to identify a Data Engineer\nto join their staff. You'll play a critical role in designing, building, and maintaining thier dark web and open-source\ndata repositories, search applications, and APIs. Will also work closely with a cross-functional team to improve and\nmaintain the reliability, scalability, and performance of these tools and technologies.PAY: 150K plus 10% bonus, great\nbenefits. No sponsorship available.LOCATION: Hybrid remote/in-office in downtown Chicago (2-3 dayds per week). Chicago\narea applicants only - no third parties please.ResponsibilitiesDesign and develop scalable search applications to enable\nefficient data retrieval and indexing from the deep and dark web.Work with internal and external stakeholders to\noptimize data infrastructure and identify cost savings, where possible.Build and maintain data pipelines to ingest,\ntransform, and process large volumes of open, deep, and dark web data from diverse sources.Develop and maintain API\nendpoints for querying dark web data, ensuring efficient and reliable access to our systems.Monitor and optimize search\nperformance, address bottlenecks, and implement enhancementsImplement data quality and validation measures to ensure\naccuracy and integrity of indexed data.Identify and integrate optimal database solutions.QualificationsExpertise in data\nmodeling, infrastructure design, and data integration to enhance thier dataBachelor's or Master's degree in Computer\nScience, Data Science, or a related field.Proficiency in working with large-scale data processing frameworks, especially\nElasticsearchSolid understanding of data modeling and schema design principles for efficient search and\nretrievalFamiliarity with open source intelligence (OSINT) and/or dark web intelligence collection and/or\nprocessesExperience with API development and management, including authentication, versioning, and performance\noptimizationProven experience as a Data Engineer, preferably in the development and management of search engines and\nAPIsDemonstrated knowledge of cloud platforms, especially AWS and AzureExcellent communication and collaboration skills\nto work effectively in a cross-functional team environmentFamiliarity with building CI/CD pipelines to ensure the\ndelivery of high-quality softwareKnowledge of data privacy and security considerations when working with sensitive\ndataStrong programming skills in Python",
        "location": "Hybrid remote/in-office in downtown Chicago (2-3 days per week)",
        "salary": "150K plus 10% bonus",
        "job_function": "Information Technology",
        "industries": "Information Services",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "education_level": "Bachelor's or Master's degree in Computer Science, Data Science, or a related field",
        "notes": "",
        "hiring_manager": "Not specified",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-chicago-165k-at-sierra-\nits-3676932344?refId=1j12dYfGDaJUMcjoDEzPUg%3D%3D&trackingId=VFj4229rq1e%2FmcyIpQQDqw%3D%3D&position=10&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "The Walt Disney Company",
        "description": "About The Role & TeamJoin the Data Engineering team within the Disney Decision Science + Integration (DDSI) organization\nat The Walt Disney Company. We support clients within Disney Experiences which include Parks & Resorts both domestic and\ninternational, Consumer Products and Disney Signature Experiences as well as the Disney Entertainment segment which\ninclude Studios Content (Disney Theatrical Group), General Entertainment Content, and ESPN and Sports Content.We use\ntechnology, data analytics, optimization, statistical and econometric modeling to explore opportunities, shape business\ndecisions and drive business value.As a member of the Data Engineering team you will be responsible for partnering with\nDecision Science Products, Decision Science, Client and Technology team members on various development and sustainment\nprojects, ad-hoc requests, prototyping and research initiatives by providing data pipeline and database engineering\nservices.As a Data Engineer you will work on projects such as Adventures by Disney (AbD), VIP Tours, Resort Inventory\nOptimization (RIO), and several upcoming initiatives. In this position, the candidate will have tasks to develop,\nimplement, improve and support our solutions. The work will involve various data engineering activities throughout the\nproject SDLC.What You Will DoWork assignments may cover activities such as participation in data requirements gathering,\nsource-to-target mapping, develop and maintaining ELT data pipelines, data quality monitoring, producing input datasets\nfor science models and visualizations and Batch/Orchestration job scheduling. In addition to technical abilities, the\nrole is responsible for understanding the business domain and processes, then applying that knowledge to the assigned\nwork. This role communicates data engineering progress to the project leadership team, and actively participates in\nmeetings and discussions.Required Qualifications & SkillsMinimum 3 years of related work experienceExperience with\nELT/ETL data pipeline development and maintenanceExpertise using Python and SQLAbility to showcase an understanding of\none or more business domainsPrior experience gathering data requirements and producing data design solutionsExperience\nwith developing in a multi environment (Dev, QA, Prod, etc.) and DevOps procedures for code\ndeployment/promotionExperience crafting and building relational databases (preferably in Postgres or\nSnowflake)Experience leading and deploying code using a source control product such as GitLab/GitHubAble to formulate\nsolutions and communicate sophisticated technical concepts to non-technical team membersPreferred\nQualificationsKnowledgeable with theme park attendance, reservations and/or productsShowed strength interacting with\nAPI’sExperience with data orchestration tools such as Apache AirflowKnowledgeable on cloud architecture and product\nofferings, preferably AWSExperience using containerization technologies such as Docker or KubernetesEducationBachelor’s\ndegree in Computer Science, Mathematics, Engineering or related field preferred/or equivalent work experienceMaster’s\ndegree preferred Computer Science, Mathematics, Engineering or related field preferred",
        "location": "Not specified",
        "salary": "Not specified",
        "job_function": "Information Technology",
        "industries": "Entertainment Providers",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "education_level": "Bachelor's degree in Computer Science, Mathematics, Engineering or related field preferred/or equivalent work experience. Master's degree preferred.",
        "notes": "",
        "hiring_manager": "Not specified",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-the-walt-disney-\ncompany-3764137624?refId=UQ7Y3xGbf7FjVTCwWTFe5g%3D%3D&trackingId=U9qrAvJ%2Bb2tF9CGPI6f6vA%3D%3D&position=12&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "KPIT",
        "description": "We KPIT (www.kpit.com) are a global technologies company specializing in CASE (Connected, Autonomous, Shared, Electric)\ndomains. Systems and Software in Electric & Conventional Powertrain, Autonomous Driving & ADAS, Digital Connected\nSolutions, Connected Vehicles, Vehicle Diagnostics, and Vehicle Networks.Join the leading software development and\nintegration team helping mobility leapfrog towards a clean, smart, and safe future. A company specializing in embedded\nsoftware, AI, and digital solutions, KPIT accelerates clients’ implementation of next-generation\ntechnologies.Responsibilities:Develop and maintain ETL (Extract, Transform, Load) processes for efficient data\nintegration.Able to design and implement database schemas and write queries to retrieve and manipulate data.Build and\noptimize efficient data pipelines and architectures.Ensure data availability, integrity, and security.Using scripting\nlanguages (e.g., Python, Bash) for automation of data workflows and processes.Implementing containerization (e.g.,\nDocker) and orchestration tools (e.g., Kubernetes) for efficient deployment and management of data\napplications.Collaborate with data scientists, analysts, and other stakeholders to understand data\nrequirements.Requirements:Bachelor’s/master’s degree.Experience in data engineer role.Proficiency in designing and\nimplementing ETL processes to move and transform data (e.g., extracting data, data cleaning, joining data).Proficient in\nat least one programming language, such as Python, Java, or Scala.Proficiency in using SQL for data querying and\nmanipulation.Good understanding of database systems, both relational and NoSQL.Good understanding of data warehousing\nand big data technologies, such as Hadoop, Spark, and Kafka, Amazon Redshift, Google BigQuery.Knowledge on Apache Spark\nand PySpark.Familiarity with AWS/Azure/GCP Cloud platform.Familiar with concepts such as scalability, fault tolerance,\nand load balancing.Good understanding of continuous integration/continuous delivery (CI/CD).Knowledge of\ncontainerization (e.g., Docker) and orchestration tools (e.g., Kubernetes).",
        "location": "Global",
        "salary": null,
        "job_function": "Engineering",
        "industries": "Motor Vehicle Manufacturing",
        "employment_type": "Full-time",
        "seniority_level": "Associate",
        "education_level": "Bachelor's/master's degree",
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-\nkpit-3763812955?refId=HSbYYR67Af9HPAndWNdraw%3D%3D&trackingId=RmTEeYHuU9VgJ3o2nwjCzQ%3D%3D&position=24&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "REALLY",
        "description": "As a Data Engineer at REALLY, your primary responsibility is to seamlessly integrate data from internal and external\nsources into a unified warehouse data model. You will play a crucial part in facilitating data and analytics endeavors\nacross REALLY’s business functions.We’re seeking an individual with hands-on experience in data modeling, test\nautomation, and the development of efficient data pipelines. You are comfortable with rapid-prototyping, while\nunderstanding how to build sustainable and scalable solutions. You are eager to understand our business, enabling you to\nshape the vision of data's impact and value at REALLY.Responsibilities:Create and maintain an internal database for\ningesting data from various sources into one centralized platform, unlocking the ability for the business to analyze all\nkey metrics across REALLY’s multiple business functionsThrough your work, the business will be able to analyze the full\ncustomer journey from first engagement to purchase and track the full lifecycle in one single view of the\ncustomerPartner with executives and engineering team to bring to life our data philosophy through the right processes\nand toolsAutomate manual data processes; design and implement internal process improvements for optimizing data delivery\nand ensuring the highest level of data qualityBecome a subject matter expert on the tools REALLY uses to track data\nacross the businessAbility to perform root cause analysis on external and internal processes and data to identify\nopportunities for improvement and answer questionsBuild analytics tools that utilize different data pipeline sources to\nprovide actionable insights into customer acquisition, behavior (ex. Google Analytics, Search Console, Ads, etc).\nPartner with our software engineers to develop architectures that enable scalable data extraction and transformation for\nboth predictive and prescriptive modeling.Qualifications:5+ years of professional (or comparable) data/analytics\nexperienceExperience with SQL and relational databasesExperience with Data Warehouses such as SnowflakeExperience with\nBI platforms such as Looker and TableauTechnical expertise in designing and creating data modelsStrong attention to\ndetailA passion for problem solving with strong analytical capabilities associated with working on unstructured\ndatasetsA desire to follow exceptional software engineering processes, and familiarity with common engineering process\ntools like Github and GitlabExcellent written and verbal communication skillsAbility to communicate complex information\nto non-technical audiencesBonus Experience:Experience with Snowflake, Redshift, or BigQueryProgramming experience in\nPythonExperience creating data visualizations using JavascriptPerks and Benefits:Competitive compensationMedical,\ndental, and vision coverage for you and your familyLife insurance paid for by REALLYREALLY is an equal opportunity\nemployer and we welcome everyone to our team. We believe that diversity is integral to our success, and do not\ndiscriminate based on race, color, religion, age, or any other basis protected by law.This position is based in Austin,\nTX.REALLY is an equal opportunity employer and we welcome everyone to our team. We believe that diversity is integral to\nour success, and do not discriminate based on race, color, religion, age, or any other basis protected by law.Powered by\nJazzHRO0te1Osi3U",
        "location": "Austin, TX",
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Internet Publishing",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "education_level": null,
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-\nreally-3771328759?refId=HSbYYR67Af9HPAndWNdraw%3D%3D&trackingId=6SqREIZnMePxvPI9IZ9stg%3D%3D&position=4&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Robinhood",
        "description": "Join a leading fintech company that’s democratizing finance for all.Robinhood was founded on a simple idea: that our\nfinancial markets should be accessible to all. With customers at the heart of our decisions, Robinhood is lowering\nbarriers and providing greater access to financial information. Together, we are building products and services that\nhelp create a financial system everyone can participate in.As we continue to build...We’re seeking curious, growth\nminded thinkers to help shape our vision, structures and systems; playing a key-role as we launch into our ambitious\nfuture. If you’re invigorated by our mission, values, and drive to change the world — we’d love to have you apply.About\nthe team + role Robinhood is a metrics driven company and data is foundational to all key decisions from growth strategy\nto product optimization to our day-to-day operations. We are looking for a Data Engineer to build and maintain\nfoundational datasets that will allow us to reliably and efficiently power decision making at Robinhood. These datasets\ninclude application events, database snapshots, and the derived datasets that describe and track Robinhood's key metrics\nacross all products. You’ll partner closely with engineers, data scientists and business teams to power analytics,\nexperimentation, and machine learning use cases. We are a fast-paced team in a fast growing company and this is a unique\nopportunity to help lay the foundation for reliable, impactful, data-driven decisions across the company for years to\ncome.The role is located in the office location(s) listed on this job description which will align with our in-office\nworking environment. Please connect with your recruiter for more information regarding our in-office philosophy and\nexpectations.What You’ll DoHelp define and build key datasets across all Robinhood product areas. Lead the evolution of\nthese datasets as use cases grow.Build scalable data pipelines using Python, Spark and Airflow to move data from\ndifferent applications into our data lake.Partner with upstream engineering teams to enhance data generation\npatterns.Partner with data consumers across Robinhood to understand consumption patterns and design intuitive data\nmodels.Ideate and contribute to shared data engineering tooling and standards.Define and promote data engineering best\npractices across the company.What You Bring4+ years of professional experience building end-to-end data pipelinesProven\nability to implement software engineering-caliber code (preferably Python)Expert at building and maintaining large-scale\ndata pipelines using open source frameworks (Spark, Flink, etc)Strong SQL (Presto, Spark SQL, etc) skills.Experience\nsolving problems across the data stack (Data Infrastructure, Analytics and Visualization platforms)Expert collaborator\nwith the ability to democratize data through actionable insights and solutions.What We OfferMarket competitive and pay\nequity-focused compensation structure100% paid health insurance for employees with 90% coverage for dependentsAnnual\nlifestyle wallet for personal wellness, learning and development, and more!Lifetime maximum benefit for family forming\nand fertility benefitsDedicated mental health support for employees and eligible dependentsGenerous time away including\ncompany holidays, paid time off, sick time, parental leave, and more!Lively office environment with catered meals, fully\nstocked kitchens, and geo-specific commuter benefitsBase pay for the successful applicant will depend on a variety of\njob-related factors, which may include education, training, experience, location, business needs, or market demands. The\nexpected salary range for this role is based on the location where the work will be performed and is aligned to one of 3\ncompensation zones. This role is also eligible to participate in a Robinhood bonus plan and Robinhood’s equity plan. For\nother locations not listed, compensation can be discussed with your recruiter during the interview process.US Zone 1:\n$157000 - $185000Menlo Park, CA; New York, NY; Seattle, WA; Washington, DCUS Zone 2: $139000 - $163000Denver, CO;\nWestlake, TX; Chicago, ILUS Zone 3: $122000 - $144000Lake Mary, FLClick Here To Learn More About Robinhood’s\nBenefits.We’re looking for more growth-minded and collaborative people to be a part of our journey in democratizing\nfinance for all. If you’re ready to give 100% in helping us achieve our mission—we’d love to have you apply even if you\nfeel unsure about whether you meet every single requirement in this posting. At Robinhood, we're looking for people\ninvigorated by our mission, values, and drive to change the world, not just those who simply check off all the\nboxes.Robinhood embraces a diversity of backgrounds and experiences and provides equal opportunity for all applicants\nand employees. We are dedicated to building a company that represents a variety of backgrounds, perspectives, and\nskills. We believe that the more inclusive we are, the better our work (and work environment) will be for everyone.\nAdditionally, Robinhood provides reasonable accommodations for candidates on request and respects applicants' privacy\nrights. To review Robinhood's Privacy Policy please review the specific policy applicable to your region: Canada\nApplicant Privacy Policy / UK/EEA Applicant Privacy Policy / US Applicant Privacy Policy",
        "location": "Menlo Park, CA; New York, NY; Seattle, WA; Washington, DC",
        "salary": "$157000 - $185000",
        "job_function": "Information Technology",
        "industries": "Financial Services",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "education_level": null,
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-robinhood-\n3737638667?refId=Qozz%2FEQHEt%2Bj9JDO9K3q4g%3D%3D&trackingId=0zfBeMROwFoqfH7OREbR9w%3D%3D&position=13&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Fusemachines",
        "description": "About FusemachinesFusemachines is a leading AI strategy, talent, and education services provider. Founded by Sameer\nMaskey Ph.D., Adjunct Associate Professor at Columbia University, Fusemachines has a core mission of democratizing AI.\nWith a presence in 4 countries (Nepal, United States, Canada, and Dominican Republic and more than 350 full-time\nemployees) Fusemachines seeks to bring its global expertise in AI to transform companies around the world.About the\nrole:This is a remote, 6 months contract role, with a possibility of extension, responsible for designing, building, and\nmaintaining the infrastructure required for data integration, storage, processing, and analytics (BI, visualization and\nAdvanced Analytics). Working in the Financial sector and implementing cyber-security use cases.Salary Range:\nUS$7000/monthJob Type: 1099 ContractStart Date: The contract for this position is scheduled to begin in January\n2024Qualification / Skill Set Requirement:3+ years of real-world data engineering development experience in Snowflake\nand AWS (certifications preferred)Proven experience as a Snowflake Developer, with a strong understanding of Snowflake\narchitecture and concepts.Proficient in snowflake services such as snowpipe, stages, stored procedures, views,\nmaterialized views, tasks and streams.Must have previous experience working with security datasetsStrong programming\nskills in SQL, with proficiency in writing efficient and optimized code for data integration, storage, processing, and\nmanipulation.Robust understanding of data partitioning and other optimization techniques in Snowflake.Knowledge of data\nsecurity measures in Snowflake, including role-based access control (RBAC) and data encryption.Highly skilled in one or\nmore languages such as Python, Scala, and proficient in writing efficient and optimized code for data integration,\nstorage, processing and manipulation.Strong knowledge of SDLC tools and technologies, including project management\nsoftware (Jira or similar), source code management (GitHub or similar), CI/CD system (GitHub actions, AWS CodeBuild or\nsimilar) and binary repository manager (AWS CodeArtifact or similar).Skilled in Data Integration from different sources\nsuch as APIs, databases, flat files, event streaming.Good understanding of Data Modeling and Database Design Principles.\nBeing able to design and implement efficient database schemas that meet the requirements of the data architecture to\nsupport data solutions.Strong experience in working with ELT and ETL tools and being able to develop custom integration\nsolutions as needed.Strong experience with scalable and distributed Data Technologies such as Spark/PySpark, DBT and\nKafka, to be able to handle large volumes of data.Strong experience in designing and implementing Data Warehousing\nsolutions in AWS with RedShift. Demonstrated experience in designing and implementing efficient ELT/ETL processes that\nextract data from source systems, transform it (DBT), and load it into the data warehouse.Strong experience in\nOrchestration using Apache Airflow.Expert in Cloud Computing in AWS, including deep knowledge of a variety of AWS\nservices like Lambda, Kinesis, S3, Lake Formation, EC2, ECS/ECR, IAM, CloudWatch, Redshift, etcGood understanding of\nData Quality and Governance, including implementation of data quality checks and monitoring processes to ensure that\ndata is accurate, complete, and consistent.Good Problem-Solving skills: being able to troubleshoot data processing\npipelines and identify performance bottlenecks and other issues.Responsibilities:Follow established design, constructed\ndata architectures. Developing and maintaining data pipelines, ensuring data flows smoothly from source to destination.\nHandle ELT processes, including data extraction, loading, transformation and load data from various sources into\nSnowflake.Ensure the reliability, scalability, and efficiency of data systems are maintained at all timesAssist in the\nconfiguration and management of Snowflake data warehousing and data lake solutions, working under the guidance of senior\nteam members.Collaborate closely with cross-functional teams including Product, Engineering, Data Scientists, and\nAnalysts to thoroughly understand data requirements and provide data engineering support.Contribute to data quality\nassurance efforts, such as implementing data validation checks and tests.Evaluate and implement cutting-edge\ntechnologies and continue learning and expanding skills in data engineering and cloud platforms.Develop, design, and\nexecute data governance strategies encompassing cataloging, lineage tracking, quality control, and data governance\nframeworks that align with current analytics demands and industry best practicesDocument data engineering processes and\ndata flows.Care about architecture, observability, testing, and building reliable infrastructure and data\npipelines.Takes ownership of storage layer, SQL database management tasks, including schema design, indexing, and\nperformance tuning.Swiftly address and resolve complex data engineering issues, incidents and resolve bottlenecks in SQL\nqueries and database operations.Assess best practices and design schemas that matches business needs for delivering a\nmodern analytics solution (descriptive, diagnostic, predictive, prescriptive)Be an active member of our Agile team,\nparticipating in all ceremonies and continuous improvement activities.Equal Opportunity Employer: Race, Color, Religion,\nSex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran\nStatus, or any other legally protected group status.Powered by JazzHRshDrx201iX",
        "location": "Remote",
        "salary": "US$7000/month",
        "job_function": "Information Technology",
        "industries": "Internet Publishing",
        "employment_type": "Contract",
        "seniority_level": "Mid-Senior level",
        "education_level": "Not specified",
        "notes": "",
        "hiring_manager": "Not specified",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-fusemachines-\n3733596267?refId=m4cyTa0q3I%2F0REHifu8sDQ%3D%3D&trackingId=EWqSoebqXK4C%2ByQw051tjw%3D%3D&position=24&pageNum=0"
    },
    {
        "title": null,
        "company": null,
        "description": "RemoteData Engineer12+ MonthsDevelop and maintain SQL scripts, stored procedures, and queries to extract and manipulate\ndata from various sources, including MSSQL and Postgres databases.Work with MuleSoft (Mule) for data integration and API\ndevelopment, if required or willing to learn it.Monitor and optimize data pipelines, troubleshoot issues, and ensure\ndata integrity and performance.Collaborate with data analysts to understand data requirements and support their data\nanalysis and modeling efforts.Stay up to date with industry trends, best practices, and emerging technologies related to\ndata engineering, Snowflake, ETL, SQL, and related tools.Solid understanding and hands-on experience with ETL tools and\nframeworks.Excellent communication and collaboration skills to work effectively with cross-functional teams.",
        "location": null,
        "salary": null,
        "job_function": "Information Technology",
        "industries": "IT Services and IT Consulting",
        "employment_type": "Contract",
        "seniority_level": "Mid-Senior level",
        "education_level": null,
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-accroid-\ninc-3778553874?refId=Qozz%2FEQHEt%2Bj9JDO9K3q4g%3D%3D&trackingId=RzQ%2F91bOrv5InYo1NJcTEQ%3D%3D&position=17&pageNum=0"
    },
    {
        "title": "Big Data Engineer",
        "company": "Walgreens Boots Alliance",
        "description": "Job SummaryBuilds & maintains big data pipelines to support advanced analytics and data science solutions. Identifies\nvaluable internal and external data. Collaborates closely with data scientists to define data for the design,\ndevelopment, and deployment of new solutions that support business priorities.Job Responsibilities Develops software\nthat processes, stores and serves data for use by others.Develops data structures and pipelines to organize, collect and\nstandardize data that helps generate insights and addresses reporting needs.Writes ETL (Extract / Transform / Load)\nprocesses, designs database systems and develops tools for real-time and offline analytic processing.Develops data\npipelines that are scalable, repeatable and secure.Troubleshoots software and processes for data consistency and\nintegrity. Integrates data from a variety of sources, assuring that they adhere to data quality and accessibility\nstandards.Effectively resolves problems and roadblocks as they occur.Interacts with internal and external peers and/or\nmanagers to exchange semi-complex information related to assigned activities.About Walgreens and WBAWalgreens\n(www.walgreens.com) is included in the U.S. Retail Pharmacy and U.S. Healthcare segments of Walgreens Boots Alliance,\nInc. (Nasdaq: WBA), an integrated healthcare, pharmacy and retail leader with a 170 year heritage of caring for\ncommunities. WBA’s purpose is to create more joyful lives through better health. Operating nearly 9,000 retail locations\nacross America, Puerto Rico and the U.S. Virgin Islands, Walgreens is proud to be a neighborhood health destination\nserving nearly 10 million customers each day. Walgreens pharmacists play a critical role in the U.S. healthcare system\nby providing a wide range of pharmacy and healthcare services, including those that drive equitable access to care for\nthe nation’s medically underserved populations. To best meet the needs of customers and patients, Walgreens offers a\ntrue omnichannel experience, with fully integrated physical and digital platforms supported by the latest technology to\ndeliver high quality products and services in communities nationwide.Basic QualificationsBachelor's degree and at least\n2 years of experience in data engineering; OR Graduate Degree in a technical discipline.Advanced knowledge of\nSQLExperience establishing and maintaining key relationships with internal (peers, business partners and leadership) and\nexternal (business community, clients and vendors) within a matrix organization to ensure quality standards for\nservice.Experience analyzing and reporting data in order to identify issues, trends, or exceptions to drive improvement\nof results and find solutions.Willing to travel up to 10% of the time for business purposes (within state and out of\nstate).Preferred QualificationsGraduate Degree in a technical disciplineExperience with REST API developmentExperience\nwith Azure application deploymentExperience in Azure technologies like Azure Data Factory, Azure Databricks using Python\nor Scala, App Services, Azure Data Lake, Azure Functions, Event Hubs, Event Grids and Logic AppExperience in building\nAzure DevOPS pipelines to enable CI/CD, Infrastructure as Code (Iaas), and automation.",
        "location": "United States",
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Wellness and Fitness Services, Pharmaceutical Manufacturing, and Retail",
        "employment_type": "Full-time",
        "seniority_level": "Not Applicable",
        "education_level": "Bachelor's degree and at least 2 years of experience in data engineering; OR Graduate Degree in a technical discipline",
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-talend-at-\nwalgreens-3763922227?refId=KiOufBohy9Hx7d%2BO7QPHXA%3D%3D&trackingId=t%2Foor2GMZ6x46ObZTCHr9A%3D%3D&position=6&pageNum=0"
    },
    {
        "title": "Big Data Engineer",
        "company": "Walgreens",
        "description": "Job SummaryBuilds & maintains big data pipelines to support advanced analytics and data science solutions. Identifies\nvaluable internal and external data. Collaborates closely with data scientists to define data for the design,\ndevelopment, and deployment of new solutions that support business priorities.Job Responsibilities Develops software\nthat processes, stores and serves data for use by others.Develops data structures and pipelines to organize, collect and\nstandardize data that helps generate insights and addresses reporting needs.Writes ETL (Extract / Transform / Load)\nprocesses, designs database systems and develops tools for real-time and offline analytic processing.Develops data\npipelines that are scalable, repeatable and secure.Troubleshoots software and processes for data consistency and\nintegrity. Integrates data from a variety of sources, assuring that they adhere to data quality and accessibility\nstandards.Effectively resolves problems and roadblocks as they occur.Interacts with internal and external peers and/or\nmanagers to exchange semi-complex information related to assigned activities.About Walgreens and WBAWalgreens\n(www.walgreens.com) is included in the U.S. Retail Pharmacy and U.S. Healthcare segments of Walgreens Boots Alliance,\nInc. (Nasdaq: WBA), an integrated healthcare, pharmacy and retail leader with a 170 year heritage of caring for\ncommunities. WBA’s purpose is to create more joyful lives through better health. Operating nearly 9,000 retail locations\nacross America, Puerto Rico and the U.S. Virgin Islands, Walgreens is proud to be a neighborhood health destination\nserving nearly 10 million customers each day. Walgreens pharmacists play a critical role in the U.S. healthcare system\nby providing a wide range of pharmacy and healthcare services, including those that drive equitable access to care for\nthe nation’s medically underserved populations. To best meet the needs of customers and patients, Walgreens offers a\ntrue omnichannel experience, with fully integrated physical and digital platforms supported by the latest technology to\ndeliver high quality products and services in communities nationwide.Basic QualificationsBachelor's degree and at least\n2 years of experience in data engineering; OR Graduate Degree in a technical discipline.Advanced knowledge of\nSQLExperience establishing and maintaining key relationships with internal (peers, business partners and leadership) and\nexternal (business community, clients and vendors) within a matrix organization to ensure quality standards for\nservice.Experience analyzing and reporting data in order to identify issues, trends, or exceptions to drive improvement\nof results and find solutions.Willing to travel up to 10% of the time for business purposes (within state and out of\nstate).Preferred QualificationsGraduate Degree in a technical disciplineExperience with REST API developmentExperience\nwith Azure application deploymentExperience in Azure technologies like Azure Data Factory, Azure Databricks using Python\nor Scala, App Services, Azure Data Lake, Azure Functions, Event Hubs, Event Grids and Logic AppExperience in building\nAzure DevOPS pipelines to enable CI/CD, Infrastructure as Code (Iaas), and automation.",
        "location": "United States",
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Wellness and Fitness Services, Pharmaceutical Manufacturing, and Retail",
        "employment_type": "Full-time",
        "seniority_level": "Not Applicable",
        "education_level": "Bachelor's degree or Graduate Degree in a technical discipline",
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-talend-at-\nwalgreens-3763922227?refId=bBU5TqxCxwdiQdibF%2FBcSA%3D%3D&trackingId=8a2d3BLr%2FO5CgSTT4Fa2pQ%3D%3D&position=6&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Robinhood",
        "description": "Join a leading fintech company that’s democratizing finance for all.Robinhood was founded on a simple idea: that our\nfinancial markets should be accessible to all. With customers at the heart of our decisions, Robinhood is lowering\nbarriers and providing greater access to financial information. Together, we are building products and services that\nhelp create a financial system everyone can participate in.As we continue to build...We’re seeking curious, growth\nminded thinkers to help shape our vision, structures and systems; playing a key-role as we launch into our ambitious\nfuture. If you’re invigorated by our mission, values, and drive to change the world — we’d love to have you apply.About\nthe team + role Robinhood is a metrics driven company and data is foundational to all key decisions from growth strategy\nto product optimization to our day-to-day operations. We are looking for a Data Engineer to build and maintain\nfoundational datasets that will allow us to reliably and efficiently power decision making at Robinhood. These datasets\ninclude application events, database snapshots, and the derived datasets that describe and track Robinhood's key metrics\nacross all products. You’ll partner closely with engineers, data scientists and business teams to power analytics,\nexperimentation, and machine learning use cases. We are a fast-paced team in a fast growing company and this is a unique\nopportunity to help lay the foundation for reliable, impactful, data-driven decisions across the company for years to\ncome.The role is located in the office location(s) listed on this job description which will align with our in-office\nworking environment. Please connect with your recruiter for more information regarding our in-office philosophy and\nexpectations.What You’ll DoHelp define and build key datasets across all Robinhood product areas. Lead the evolution of\nthese datasets as use cases grow.Build scalable data pipelines using Python, Spark and Airflow to move data from\ndifferent applications into our data lake.Partner with upstream engineering teams to enhance data generation\npatterns.Partner with data consumers across Robinhood to understand consumption patterns and design intuitive data\nmodels.Ideate and contribute to shared data engineering tooling and standards.Define and promote data engineering best\npractices across the company.What You Bring4+ years of professional experience building end-to-end data pipelinesProven\nability to implement software engineering-caliber code (preferably Python)Expert at building and maintaining large-scale\ndata pipelines using open source frameworks (Spark, Flink, etc)Strong SQL (Presto, Spark SQL, etc) skills.Experience\nsolving problems across the data stack (Data Infrastructure, Analytics and Visualization platforms)Expert collaborator\nwith the ability to democratize data through actionable insights and solutions.What We OfferMarket competitive and pay\nequity-focused compensation structure100% paid health insurance for employees with 90% coverage for dependentsAnnual\nlifestyle wallet for personal wellness, learning and development, and more!Lifetime maximum benefit for family forming\nand fertility benefitsDedicated mental health support for employees and eligible dependentsGenerous time away including\ncompany holidays, paid time off, sick time, parental leave, and more!Lively office environment with catered meals, fully\nstocked kitchens, and geo-specific commuter benefitsBase pay for the successful applicant will depend on a variety of\njob-related factors, which may include education, training, experience, location, business needs, or market demands. The\nexpected salary range for this role is based on the location where the work will be performed and is aligned to one of 3\ncompensation zones. This role is also eligible to participate in a Robinhood bonus plan and Robinhood’s equity plan. For\nother locations not listed, compensation can be discussed with your recruiter during the interview process.US Zone 1:\n$157000 - $185000Menlo Park, CA; New York, NY; Seattle, WA; Washington, DCUS Zone 2: $139000 - $163000Denver, CO;\nWestlake, TX; Chicago, ILUS Zone 3: $122000 - $144000Lake Mary, FLClick Here To Learn More About Robinhood’s\nBenefits.We’re looking for more growth-minded and collaborative people to be a part of our journey in democratizing\nfinance for all. If you’re ready to give 100% in helping us achieve our mission—we’d love to have you apply even if you\nfeel unsure about whether you meet every single requirement in this posting. At Robinhood, we're looking for people\ninvigorated by our mission, values, and drive to change the world, not just those who simply check off all the\nboxes.Robinhood embraces a diversity of backgrounds and experiences and provides equal opportunity for all applicants\nand employees. We are dedicated to building a company that represents a variety of backgrounds, perspectives, and\nskills. We believe that the more inclusive we are, the better our work (and work environment) will be for everyone.\nAdditionally, Robinhood provides reasonable accommodations for candidates on request and respects applicants' privacy\nrights. To review Robinhood's Privacy Policy please review the specific policy applicable to your region: Canada\nApplicant Privacy Policy / UK/EEA Applicant Privacy Policy / US Applicant Privacy Policy",
        "location": "Menlo Park, CA; New York, NY; Seattle, WA; Washington, DC",
        "salary": "$157000 - $185000",
        "job_function": "Information Technology",
        "industries": "Financial Services",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "education_level": "Not specified",
        "notes": "",
        "hiring_manager": "Not provided",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-robinhood-\n3737638667?refId=INeQLMNNzZr3z6agBAxedA%3D%3D&trackingId=nl5gyqbd%2BtiNF6Hp%2B3mttQ%3D%3D&position=14&pageNum=0"
    },
    {
        "title": "Data Engineer I",
        "company": "Unknown",
        "description": "Title:Data Engineer I, Req# 27194964Location:Cupertino,CA(Hybrid)Contract: 12+ MonthJob Description Develop data\nautomation tool for collection, processing, and storing lab data. Set up, maintain, and monitor continuous operation\nclient devices in labs. Develop test scripts for various client devices. Maintain software revisions through GitHub.\nBuild ETL for telemetry field dataset and automate data integrity and optimization routines for automatic reporting,\nanalysis, and error detection. Analyze user and experimental data and use engineering and analytical understanding to\nresolve battery problems. Provide ad-hoc analysis as necessary.Qualifications 1+ years of experience in software\nengineering/data science engineering. Proficient in Python for data processing and analysis tool development. Proficient\nin Linux/Unix (Bash and Shell). Proficient in C for software development Proficient in revision control software such as\nGitHub. Strong working knowledge in designing, building, and maintaining data ETL pipeline. Experience in SQL.\nExperience in database modeling and data warehousing principles. Familiarity with job scheduling system. Experience in\ndata science and analytics, statistical analyses, A/B testing and conducting experiments and investigations in large-\nscale usage data environment. Self-started with a proven ability to handle multiple tasks with strict deadlines. Proven\ncreativity to go beyond current tools to deliver best solution to the problem. Outstanding problem solving, critical\nthinking and interpersonal skills.PayRate: $50-55/hr, W2",
        "location": "Cupertino, CA",
        "salary": "$50-55/hr, W2",
        "job_function": "Information Technology",
        "industries": "Staffing and Recruiting",
        "employment_type": "Contract",
        "seniority_level": "Entry level",
        "education_level": "Unknown",
        "notes": "",
        "hiring_manager": "Unknown",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-i-at-\nwinmax-3759969537?refId=INeQLMNNzZr3z6agBAxedA%3D%3D&trackingId=yJnNVjBVaBfbbc5TsdaGag%3D%3D&position=16&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Sierra",
        "description": "Data EngineerSierra has been asked by a large risk management and intelligence services firm to identify a Data Engineer\nto join their staff. You'll play a critical role in designing, building, and maintaining thier dark web and open-source\ndata repositories, search applications, and APIs. Will also work closely with a cross-functional team to improve and\nmaintain the reliability, scalability, and performance of these tools and technologies.PAY: 150K plus 10% bonus, great\nbenefits. No sponsorship available.LOCATION: Hybrid remote/in-office in downtown Chicago (2-3 dayds per week). Chicago\narea applicants only - no third parties please.ResponsibilitiesDesign and develop scalable search applications to enable\nefficient data retrieval and indexing from the deep and dark web.Work with internal and external stakeholders to\noptimize data infrastructure and identify cost savings, where possible.Build and maintain data pipelines to ingest,\ntransform, and process large volumes of open, deep, and dark web data from diverse sources.Develop and maintain API\nendpoints for querying dark web data, ensuring efficient and reliable access to our systems.Monitor and optimize search\nperformance, address bottlenecks, and implement enhancementsImplement data quality and validation measures to ensure\naccuracy and integrity of indexed data.Identify and integrate optimal database solutions.QualificationsExpertise in data\nmodeling, infrastructure design, and data integration to enhance thier dataBachelor's or Master's degree in Computer\nScience, Data Science, or a related field.Proficiency in working with large-scale data processing frameworks, especially\nElasticsearchSolid understanding of data modeling and schema design principles for efficient search and\nretrievalFamiliarity with open source intelligence (OSINT) and/or dark web intelligence collection and/or\nprocessesExperience with API development and management, including authentication, versioning, and performance\noptimizationProven experience as a Data Engineer, preferably in the development and management of search engines and\nAPIsDemonstrated knowledge of cloud platforms, especially AWS and AzureExcellent communication and collaboration skills\nto work effectively in a cross-functional team environmentFamiliarity with building CI/CD pipelines to ensure the\ndelivery of high-quality softwareKnowledge of data privacy and security considerations when working with sensitive\ndataStrong programming skills in Python",
        "location": "Hybrid remote/in-office in downtown Chicago (2-3 days per week)",
        "salary": "150K plus 10% bonus",
        "job_function": "Information Technology",
        "industries": "Information Services",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "education_level": "Bachelor's or Master's degree in Computer Science, Data Science, or a related field",
        "notes": "",
        "hiring_manager": "Not specified",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-chicago-165k-at-sierra-\nits-3676932344?refId=bBU5TqxCxwdiQdibF%2FBcSA%3D%3D&trackingId=3Yuu%2FurWmEJrE3dF3wR%2FaA%3D%3D&position=9&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Fusemachines",
        "description": "About FusemachinesFusemachines is a leading AI strategy, talent, and education services provider. Founded by Sameer\nMaskey Ph.D., Adjunct Associate Professor at Columbia University, Fusemachines has a core mission of democratizing AI.\nWith a presence in 4 countries (Nepal, United States, Canada, and Dominican Republic and more than 350 full-time\nemployees) Fusemachines seeks to bring its global expertise in AI to transform companies around the world.About the\nrole:This is a remote, 6 months contract role, with a possibility of extension, responsible for designing, building, and\nmaintaining the infrastructure required for data integration, storage, processing, and analytics (BI, visualization and\nAdvanced Analytics). Working in the Financial sector and implementing cyber-security use cases.Salary Range:\nUS$7000/monthJob Type: 1099 ContractStart Date: The contract for this position is scheduled to begin in January\n2024Qualification / Skill Set Requirement:3+ years of real-world data engineering development experience in Snowflake\nand AWS (certifications preferred)Proven experience as a Snowflake Developer, with a strong understanding of Snowflake\narchitecture and concepts.Proficient in snowflake services such as snowpipe, stages, stored procedures, views,\nmaterialized views, tasks and streams.Must have previous experience working with security datasetsStrong programming\nskills in SQL, with proficiency in writing efficient and optimized code for data integration, storage, processing, and\nmanipulation.Robust understanding of data partitioning and other optimization techniques in Snowflake.Knowledge of data\nsecurity measures in Snowflake, including role-based access control (RBAC) and data encryption.Highly skilled in one or\nmore languages such as Python, Scala, and proficient in writing efficient and optimized code for data integration,\nstorage, processing and manipulation.Strong knowledge of SDLC tools and technologies, including project management\nsoftware (Jira or similar), source code management (GitHub or similar), CI/CD system (GitHub actions, AWS CodeBuild or\nsimilar) and binary repository manager (AWS CodeArtifact or similar).Skilled in Data Integration from different sources\nsuch as APIs, databases, flat files, event streaming.Good understanding of Data Modeling and Database Design Principles.\nBeing able to design and implement efficient database schemas that meet the requirements of the data architecture to\nsupport data solutions.Strong experience in working with ELT and ETL tools and being able to develop custom integration\nsolutions as needed.Strong experience with scalable and distributed Data Technologies such as Spark/PySpark, DBT and\nKafka, to be able to handle large volumes of data.Strong experience in designing and implementing Data Warehousing\nsolutions in AWS with RedShift. Demonstrated experience in designing and implementing efficient ELT/ETL processes that\nextract data from source systems, transform it (DBT), and load it into the data warehouse.Strong experience in\nOrchestration using Apache Airflow.Expert in Cloud Computing in AWS, including deep knowledge of a variety of AWS\nservices like Lambda, Kinesis, S3, Lake Formation, EC2, ECS/ECR, IAM, CloudWatch, Redshift, etcGood understanding of\nData Quality and Governance, including implementation of data quality checks and monitoring processes to ensure that\ndata is accurate, complete, and consistent.Good Problem-Solving skills: being able to troubleshoot data processing\npipelines and identify performance bottlenecks and other issues.Responsibilities:Follow established design, constructed\ndata architectures. Developing and maintaining data pipelines, ensuring data flows smoothly from source to destination.\nHandle ELT processes, including data extraction, loading, transformation and load data from various sources into\nSnowflake.Ensure the reliability, scalability, and efficiency of data systems are maintained at all timesAssist in the\nconfiguration and management of Snowflake data warehousing and data lake solutions, working under the guidance of senior\nteam members.Collaborate closely with cross-functional teams including Product, Engineering, Data Scientists, and\nAnalysts to thoroughly understand data requirements and provide data engineering support.Contribute to data quality\nassurance efforts, such as implementing data validation checks and tests.Evaluate and implement cutting-edge\ntechnologies and continue learning and expanding skills in data engineering and cloud platforms.Develop, design, and\nexecute data governance strategies encompassing cataloging, lineage tracking, quality control, and data governance\nframeworks that align with current analytics demands and industry best practicesDocument data engineering processes and\ndata flows.Care about architecture, observability, testing, and building reliable infrastructure and data\npipelines.Takes ownership of storage layer, SQL database management tasks, including schema design, indexing, and\nperformance tuning.Swiftly address and resolve complex data engineering issues, incidents and resolve bottlenecks in SQL\nqueries and database operations.Assess best practices and design schemas that matches business needs for delivering a\nmodern analytics solution (descriptive, diagnostic, predictive, prescriptive)Be an active member of our Agile team,\nparticipating in all ceremonies and continuous improvement activities.Equal Opportunity Employer: Race, Color, Religion,\nSex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran\nStatus, or any other legally protected group status.Powered by JazzHRshDrx201iX",
        "location": "Remote",
        "salary": "US$7000/month",
        "job_function": "Information Technology",
        "industries": "Internet Publishing",
        "employment_type": "Contract",
        "seniority_level": "Mid-Senior level",
        "education_level": "N/A",
        "notes": "",
        "hiring_manager": "Sameer Maskey",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-\nfusemachines-3733596267?refId=UQ7Y3xGbf7FjVTCwWTFe5g%3D%3D&trackingId=uEHWGb0zOPzlwsRgSoyIAg%3D%3D&position=24&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Dollar General Corporation",
        "description": "Dollar General Corporation has been delivering value to shoppers for more than 80 years. Dollar General helps shoppers\nSave time. Save money. Every day.® by offering products that are frequently used and replenished, such as food, snacks,\nhealth and beauty aids, cleaning supplies, basic apparel, housewares and seasonal items at everyday low prices in\nconvenient neighborhood locations. Dollar General operates more than 18,000 stores in 47 states, and we’re still\ngrowing. Learn more about Dollar General at www.dollargeneral.com.General Summary Dollar General Corporation has been\ndelivering value to shoppers for more than 80 years. Dollar General helps shoppers Save time. Save money. Every day.® by\noffering products that are frequently used and replenished, such as food, snacks, health and beauty aids, cleaning\nsupplies, basic apparel, housewares and seasonal items at everyday low prices in convenient neighborhood locations.\nDollar General operates more than 18,000 stores in 47 states, and we’re still growing. Learn more about Dollar General\nat www.dollargeneral.com.Duties & Responsibilities Advanced working SQL knowledge and experience working with relational\ndatabases, query authoring (SQL) as well as working familiarity with a variety of databases.Assemble large, complex data\nsets that meet functional / non-functional business requirements.Identify, design, and implement internal process\nimprovements automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability,\netc.Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of\ndata sources using SQL and cloud technologies.Build analytics tools that utilize the data pipelines to provide\nactionable insights into customer acquisition, operational efficiency and other key business performance metrics.Work\nwith stakeholders including the Product, Data and Design teams to assist with data-related technical issues and support\ntheir data infrastructure needs.Knowledge, Skills and Abilities Knowledge of programming languages (e.g. Java and\nPython)Hands-on experience with SQL database designGreat numerical and analytical skillsDegree in Computer Science, IT,\nor similar field; a Master’s is a plusData engineering certification (e.g IBM Certified Data Engineer) is a\nplusExperience with big data tools Hadoop, Spark, Kafka, etc.Experience with relational SQL and NoSQL databases,\nincluding Postgres and Cassandra.Experience with data pipeline and workflow management tools Azkaban, Luigi, Airflow,\netc.Experience with Snowflake/Azure cloud services EC2, EMR, RDS, RedshiftExperience with stream-processing systems\nStorm, Spark-Streaming, etc.Experience with object-oriented/object function scripting languages Python, Java, C++,\nScala, etcWork Experience &/or Education Degree in information technology or computer science with additional vendor-\nspecific certification.BS or MS degree in Computer Science or a related technical field4+ years of Python or Java\ndevelopment experience4+ years of SQL experience (No-SQL experience is a plus)4+ years of experience with schema design\nand dimensional data modelingAbility in managing and communicating data warehouse plans to internal clientsExperience\ndesigning, building, and maintaining data processing systemsExperience working with a cloud platform such as Snowflake /\nAzure or Databricks#mogul#",
        "location": "Unknown",
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Retail",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "education_level": "Degree in Computer Science, IT, or similar field; a Master’s is a plus",
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-dollar-general-\n3745487485?refId=ACNf%2FwdQfBNm%2BGsMg51brQ%3D%3D&trackingId=OySZQasZF%2BpLrTldhOKjnw%3D%3D&position=23&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "The Walt Disney Company",
        "description": "About The Role & TeamJoin the Data Engineering team within the Disney Decision Science + Integration (DDSI) organization\nat The Walt Disney Company. We support clients within Disney Experiences which include Parks & Resorts both domestic and\ninternational, Consumer Products and Disney Signature Experiences as well as the Disney Entertainment segment which\ninclude Studios Content (Disney Theatrical Group), General Entertainment Content, and ESPN and Sports Content.We use\ntechnology, data analytics, optimization, statistical and econometric modeling to explore opportunities, shape business\ndecisions and drive business value.As a member of the Data Engineering team you will be responsible for partnering with\nDecision Science Products, Decision Science, Client and Technology team members on various development and sustainment\nprojects, ad-hoc requests, prototyping and research initiatives by providing data pipeline and database engineering\nservices.As a Data Engineer you will work on projects such as Adventures by Disney (AbD), VIP Tours, Resort Inventory\nOptimization (RIO), and several upcoming initiatives. In this position, the candidate will have tasks to develop,\nimplement, improve and support our solutions. The work will involve various data engineering activities throughout the\nproject SDLC.What You Will DoWork assignments may cover activities such as participation in data requirements gathering,\nsource-to-target mapping, develop and maintaining ELT data pipelines, data quality monitoring, producing input datasets\nfor science models and visualizations and Batch/Orchestration job scheduling. In addition to technical abilities, the\nrole is responsible for understanding the business domain and processes, then applying that knowledge to the assigned\nwork. This role communicates data engineering progress to the project leadership team, and actively participates in\nmeetings and discussions.Required Qualifications & SkillsMinimum 3 years of related work experienceExperience with\nELT/ETL data pipeline development and maintenanceExpertise using Python and SQLAbility to showcase an understanding of\none or more business domainsPrior experience gathering data requirements and producing data design solutionsExperience\nwith developing in a multi environment (Dev, QA, Prod, etc.) and DevOps procedures for code\ndeployment/promotionExperience crafting and building relational databases (preferably in Postgres or\nSnowflake)Experience leading and deploying code using a source control product such as GitLab/GitHubAble to formulate\nsolutions and communicate sophisticated technical concepts to non-technical team membersPreferred\nQualificationsKnowledgeable with theme park attendance, reservations and/or productsShowed strength interacting with\nAPI’sExperience with data orchestration tools such as Apache AirflowKnowledgeable on cloud architecture and product\nofferings, preferably AWSExperience using containerization technologies such as Docker or KubernetesEducationBachelor’s\ndegree in Computer Science, Mathematics, Engineering or related field preferred/or equivalent work experienceMaster’s\ndegree preferred Computer Science, Mathematics, Engineering or related field preferred",
        "location": "Not specified",
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Entertainment Providers",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "education_level": "Bachelor's degree preferred",
        "notes": "",
        "hiring_manager": "Not specified",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-the-walt-disney-\ncompany-3764137624?refId=INeQLMNNzZr3z6agBAxedA%3D%3D&trackingId=P2lFJJpLK8MndDa%2FuNJxqQ%3D%3D&position=13&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Rockstar Games",
        "description": "At Rockstar Games, we create world-class entertainment experiences.A career at Rockstar Games is about being part of a\nteam working on some of the most creatively rewarding and ambitious projects to be found in any entertainment medium.\nYou would be welcomed to a dedicated and inclusive environment where you can learn, and collaborate with some of the\nmost talented people in the industry.Rockstar is seeking a Data Engineer to join a team focused on building a cutting-\nedge game analytics platform and tools to better understand our players and enhance their experience in our games. This\nis a full-time permanent position based out of Rockstar’s unique game development studio in Andover, MA.The ideal\ncandidate will be skilled in developing complex ingestion and transformation processes with an emphasis on reliability\nand performance. In collaboration with other data engineers, machine learning engineers, and software engineers, the\ncandidate will empower the team of analysts and data scientists to deliver data driven insights and applications to\ncompany stakeholders.What We DoThe Rockstar Analytics team provide insights and actionable results to a wide variety of\nstakeholders across the organization in support of their decision making.We are currently adding team members to\nmultiple verticals including; Machine Learning and Game Data Pipeline.ResponsibilitiesImplement and maintain real-time\nand batch Data Models.Deliver real-time and non-real-time data models to analysts and data scientists who create\ninsights and analytics applications for our stakeholders.Implement and support streaming technologies such as Kafka,\nSpark, Cassandra & AzureML.Assist in the development of deployment automation and operational support strategies.Assist\nin the development of a big data platform in Hadoop using pipeline technologies such as Spark, Airflow, and more to\nsupport a variety of requirements and applications.Set the standards for warehouse and schema design in massively\nparallel processing engines such as Hadoop and Snowflake while collaborating with analysts and data scientist in the\ncreation of efficient data models.Maintain and extend our CI/CD processes and documentation.Qualifications3+ years of\nwork experience with data modeling, business intelligence and machine learning on big data architectures.2+ years of\nexperience with the Hadoop ecosystem (HDFS, Spark, Oozie, Impala, etc.) and big data ecosystems (Kafka, Cassandra,\netc.).2+ years of experience with the Azure ecosystem (Azure ML, Azure Data Factory) Expert in at least one SQL language\nsuch as T-SQL or PL/SQL.Experience developing and managing data warehouses on a terabyte or petabyte scale.Strong\nexperience in massively parallel processing & columnar databases.Experience building Real-Time and/or Near-Real-Time ML\npipelines.Experience with Python, Scala, or Java.Experience with shell scripting.Experience working in a Linux\nenvironment.SkillsDeep understanding of advanced data warehousing concepts and track record of applying these concepts\non the job.Ability to manage numerous projects concurrently and strategically, prioritizing when necessary.Good\ncommunication skills.Dynamic team player.A passion for technology.PLUSESPlease note that these are desirable skills and\nare not required to apply for the position.Experience with Python based libraries such as Scikit-Learn Experience with\nDatabricksExperience with Spark-ML, Jupyter Notebook, AzureML.Experience in Lambda architecture.Experience with\nCI/CD.Familiar with Restful APIs.Experience with Artifact Repositories.Knowledge of the video game industry.How To\nApplyPlease apply with a resume and cover letter demonstrating how you meet the skills above. If we would like to move\nforward with your application, a Rockstar recruiter will reach out to you to explain next steps and guide you through\nthe process.Rockstar is proud to be an equal opportunity employer, and we are committed to hiring, promoting, and\ncompensating employees based on their qualifications and demonstrated ability to perform job responsibilities.If you’ve\ngot the right skills for the job, we want to hear from you. We encourage applications from all suitable candidates\nregardless of age, disability, gender identity, sexual orientation, religion, belief, or race.",
        "location": "Andover, MA",
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Computer Games",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "education_level": null,
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-rockstar-\ngames-3719384994?refId=hUqfFzzrGisp%2F7qdM%2BRWqw%3D%3D&trackingId=dem1zuojf%2BMKP3r4k5IuPw%3D%3D&position=24&pageNum=0"
    },
    {
        "title": "Software Development and Integration",
        "company": "KPIT",
        "description": "We KPIT (www.kpit.com) are a global technologies company specializing in CASE (Connected, Autonomous, Shared, Electric)\ndomains. Systems and Software in Electric & Conventional Powertrain, Autonomous Driving & ADAS, Digital Connected\nSolutions, Connected Vehicles, Vehicle Diagnostics, and Vehicle Networks.Join the leading software development and\nintegration team helping mobility leapfrog towards a clean, smart, and safe future. A company specializing in embedded\nsoftware, AI, and digital solutions, KPIT accelerates clients’ implementation of next-generation\ntechnologies.Responsibilities:Develop and maintain ETL (Extract, Transform, Load) processes for efficient data\nintegration.Able to design and implement database schemas and write queries to retrieve and manipulate data.Build and\noptimize efficient data pipelines and architectures.Ensure data availability, integrity, and security.Using scripting\nlanguages (e.g., Python, Bash) for automation of data workflows and processes.Implementing containerization (e.g.,\nDocker) and orchestration tools (e.g., Kubernetes) for efficient deployment and management of data\napplications.Collaborate with data scientists, analysts, and other stakeholders to understand data\nrequirements.Requirements:Bachelor’s/master’s degree.Experience in data engineer role.Proficiency in designing and\nimplementing ETL processes to move and transform data (e.g., extracting data, data cleaning, joining data).Proficient in\nat least one programming language, such as Python, Java, or Scala.Proficiency in using SQL for data querying and\nmanipulation.Good understanding of database systems, both relational and NoSQL.Good understanding of data warehousing\nand big data technologies, such as Hadoop, Spark, and Kafka, Amazon Redshift, Google BigQuery.Knowledge on Apache Spark\nand PySpark.Familiarity with AWS/Azure/GCP Cloud platform.Familiar with concepts such as scalability, fault tolerance,\nand load balancing.Good understanding of continuous integration/continuous delivery (CI/CD).Knowledge of\ncontainerization (e.g., Docker) and orchestration tools (e.g., Kubernetes).",
        "location": "Global",
        "salary": null,
        "job_function": "Engineering",
        "industries": "Motor Vehicle Manufacturing",
        "employment_type": "Full-time",
        "seniority_level": "Associate",
        "education_level": "Bachelor’s/master’s degree",
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-\nkpit-3763812955?refId=INeQLMNNzZr3z6agBAxedA%3D%3D&trackingId=7pp01BX0jYguD%2FbeMm4wOA%3D%3D&position=18&pageNum=0"
    },
    {
        "title": "Data Engineer (DE)",
        "company": "",
        "description": "Role: Data Engineer (DE)Location: Scottsdale AZ (day 1 onsite)Duration: Fulltime Must have skill set: Java, Scala,\nPython, Spark, S3, Glue, RedshiftYou have 6-8 years of relevant software development experience. You have hands-on\nexperience in Java/Scala/Python, Spark, S3, Glue, Redshift. This is critical. Highly analytical and data oriented.\nExperience in SQL, NoSql Database Data masking of on prem PII data. Develop API calls with using secure data transfer.\nTake standard output data to lower environments for pre prod testing! Enable secured channels for data models and data\nscience activities. Need a solution that can scale to handle millions of data. i.e., masking 10 million records in 15\nmins You have experience with development tools and agile methodologies.",
        "location": "Scottsdale AZ",
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Human Resources Services",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "education_level": null,
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-de-at-zortech-solutions-\n3778562998?refId=5eyAniSzCOFqPd2ejukkvQ%3D%3D&trackingId=U%2BSIJ%2BOjBUWNP1VsxbVk3A%3D%3D&position=13&pageNum=0"
    },
    {
        "title": null,
        "company": null,
        "description": "Join a leading fintech company that’s democratizing finance for all.Robinhood was founded on a simple idea: that our\nfinancial markets should be accessible to all. With customers at the heart of our decisions, Robinhood is lowering\nbarriers and providing greater access to financial information. Together, we are building products and services that\nhelp create a financial system everyone can participate in.As we continue to build...We’re seeking curious, growth\nminded thinkers to help shape our vision, structures and systems; playing a key-role as we launch into our ambitious\nfuture. If you’re invigorated by our mission, values, and drive to change the world — we’d love to have you apply.About\nthe team + role Robinhood is a metrics driven company and data is foundational to all key decisions from growth strategy\nto product optimization to our day-to-day operations. We are looking for a Data Engineer to build and maintain\nfoundational datasets that will allow us to reliably and efficiently power decision making at Robinhood. These datasets\ninclude application events, database snapshots, and the derived datasets that describe and track Robinhood's key metrics\nacross all products. You’ll partner closely with engineers, data scientists and business teams to power analytics,\nexperimentation, and machine learning use cases. We are a fast-paced team in a fast growing company and this is a unique\nopportunity to help lay the foundation for reliable, impactful, data-driven decisions across the company for years to\ncome.The role is located in the office location(s) listed on this job description which will align with our in-office\nworking environment. Please connect with your recruiter for more information regarding our in-office philosophy and\nexpectations.What You’ll DoHelp define and build key datasets across all Robinhood product areas. Lead the evolution of\nthese datasets as use cases grow.Build scalable data pipelines using Python, Spark and Airflow to move data from\ndifferent applications into our data lake.Partner with upstream engineering teams to enhance data generation\npatterns.Partner with data consumers across Robinhood to understand consumption patterns and design intuitive data\nmodels.Ideate and contribute to shared data engineering tooling and standards.Define and promote data engineering best\npractices across the company.What You Bring4+ years of professional experience building end-to-end data pipelinesProven\nability to implement software engineering-caliber code (preferably Python)Expert at building and maintaining large-scale\ndata pipelines using open source frameworks (Spark, Flink, etc)Strong SQL (Presto, Spark SQL, etc) skills.Experience\nsolving problems across the data stack (Data Infrastructure, Analytics and Visualization platforms)Expert collaborator\nwith the ability to democratize data through actionable insights and solutions.What We OfferMarket competitive and pay\nequity-focused compensation structure100% paid health insurance for employees with 90% coverage for dependentsAnnual\nlifestyle wallet for personal wellness, learning and development, and more!Lifetime maximum benefit for family forming\nand fertility benefitsDedicated mental health support for employees and eligible dependentsGenerous time away including\ncompany holidays, paid time off, sick time, parental leave, and more!Lively office environment with catered meals, fully\nstocked kitchens, and geo-specific commuter benefitsBase pay for the successful applicant will depend on a variety of\njob-related factors, which may include education, training, experience, location, business needs, or market demands. The\nexpected salary range for this role is based on the location where the work will be performed and is aligned to one of 3\ncompensation zones. This role is also eligible to participate in a Robinhood bonus plan and Robinhood’s equity plan. For\nother locations not listed, compensation can be discussed with your recruiter during the interview process.US Zone 1:\n$157000 - $185000Menlo Park, CA; New York, NY; Seattle, WA; Washington, DCUS Zone 2: $139000 - $163000Denver, CO;\nWestlake, TX; Chicago, ILUS Zone 3: $122000 - $144000Lake Mary, FLClick Here To Learn More About Robinhood’s\nBenefits.We’re looking for more growth-minded and collaborative people to be a part of our journey in democratizing\nfinance for all. If you’re ready to give 100% in helping us achieve our mission—we’d love to have you apply even if you\nfeel unsure about whether you meet every single requirement in this posting. At Robinhood, we're looking for people\ninvigorated by our mission, values, and drive to change the world, not just those who simply check off all the\nboxes.Robinhood embraces a diversity of backgrounds and experiences and provides equal opportunity for all applicants\nand employees. We are dedicated to building a company that represents a variety of backgrounds, perspectives, and\nskills. We believe that the more inclusive we are, the better our work (and work environment) will be for everyone.\nAdditionally, Robinhood provides reasonable accommodations for candidates on request and respects applicants' privacy\nrights. To review Robinhood's Privacy Policy please review the specific policy applicable to your region: Canada\nApplicant Privacy Policy / UK/EEA Applicant Privacy Policy / US Applicant Privacy Policy",
        "location": null,
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Financial Services",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "education_level": null,
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-\nrobinhood-3737638667?refId=m4cyTa0q3I%2F0REHifu8sDQ%3D%3D&trackingId=MSaQrSX9eYscU4yWysUUhQ%3D%3D&position=13&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Fusemachines",
        "description": "About FusemachinesFusemachines is a leading AI strategy, talent, and education services provider. Founded by Sameer\nMaskey Ph.D., Adjunct Associate Professor at Columbia University, Fusemachines has a core mission of democratizing AI.\nWith a presence in 4 countries (Nepal, United States, Canada, and Dominican Republic and more than 350 full-time\nemployees) Fusemachines seeks to bring its global expertise in AI to transform companies around the world.About the\nrole:This is a remote, 6 months contract role, with a possibility of extension, responsible for designing, building, and\nmaintaining the infrastructure required for data integration, storage, processing, and analytics (BI, visualization and\nAdvanced Analytics). Working in the Financial sector and implementing cyber-security use cases.Salary Range:\nUS$7000/monthJob Type: 1099 ContractStart Date: The contract for this position is scheduled to begin in January\n2024Qualification / Skill Set Requirement:3+ years of real-world data engineering development experience in Snowflake\nand AWS (certifications preferred)Proven experience as a Snowflake Developer, with a strong understanding of Snowflake\narchitecture and concepts.Proficient in snowflake services such as snowpipe, stages, stored procedures, views,\nmaterialized views, tasks and streams.Must have previous experience working with security datasetsStrong programming\nskills in SQL, with proficiency in writing efficient and optimized code for data integration, storage, processing, and\nmanipulation.Robust understanding of data partitioning and other optimization techniques in Snowflake.Knowledge of data\nsecurity measures in Snowflake, including role-based access control (RBAC) and data encryption.Highly skilled in one or\nmore languages such as Python, Scala, and proficient in writing efficient and optimized code for data integration,\nstorage, processing and manipulation.Strong knowledge of SDLC tools and technologies, including project management\nsoftware (Jira or similar), source code management (GitHub or similar), CI/CD system (GitHub actions, AWS CodeBuild or\nsimilar) and binary repository manager (AWS CodeArtifact or similar).Skilled in Data Integration from different sources\nsuch as APIs, databases, flat files, event streaming.Good understanding of Data Modeling and Database Design Principles.\nBeing able to design and implement efficient database schemas that meet the requirements of the data architecture to\nsupport data solutions.Strong experience in working with ELT and ETL tools and being able to develop custom integration\nsolutions as needed.Strong experience with scalable and distributed Data Technologies such as Spark/PySpark, DBT and\nKafka, to be able to handle large volumes of data.Strong experience in designing and implementing Data Warehousing\nsolutions in AWS with RedShift. Demonstrated experience in designing and implementing efficient ELT/ETL processes that\nextract data from source systems, transform it (DBT), and load it into the data warehouse.Strong experience in\nOrchestration using Apache Airflow.Expert in Cloud Computing in AWS, including deep knowledge of a variety of AWS\nservices like Lambda, Kinesis, S3, Lake Formation, EC2, ECS/ECR, IAM, CloudWatch, Redshift, etcGood understanding of\nData Quality and Governance, including implementation of data quality checks and monitoring processes to ensure that\ndata is accurate, complete, and consistent.Good Problem-Solving skills: being able to troubleshoot data processing\npipelines and identify performance bottlenecks and other issues.Responsibilities:Follow established design, constructed\ndata architectures. Developing and maintaining data pipelines, ensuring data flows smoothly from source to destination.\nHandle ELT processes, including data extraction, loading, transformation and load data from various sources into\nSnowflake.Ensure the reliability, scalability, and efficiency of data systems are maintained at all timesAssist in the\nconfiguration and management of Snowflake data warehousing and data lake solutions, working under the guidance of senior\nteam members.Collaborate closely with cross-functional teams including Product, Engineering, Data Scientists, and\nAnalysts to thoroughly understand data requirements and provide data engineering support.Contribute to data quality\nassurance efforts, such as implementing data validation checks and tests.Evaluate and implement cutting-edge\ntechnologies and continue learning and expanding skills in data engineering and cloud platforms.Develop, design, and\nexecute data governance strategies encompassing cataloging, lineage tracking, quality control, and data governance\nframeworks that align with current analytics demands and industry best practicesDocument data engineering processes and\ndata flows.Care about architecture, observability, testing, and building reliable infrastructure and data\npipelines.Takes ownership of storage layer, SQL database management tasks, including schema design, indexing, and\nperformance tuning.Swiftly address and resolve complex data engineering issues, incidents and resolve bottlenecks in SQL\nqueries and database operations.Assess best practices and design schemas that matches business needs for delivering a\nmodern analytics solution (descriptive, diagnostic, predictive, prescriptive)Be an active member of our Agile team,\nparticipating in all ceremonies and continuous improvement activities.Equal Opportunity Employer: Race, Color, Religion,\nSex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran\nStatus, or any other legally protected group status.Powered by JazzHRshDrx201iX",
        "location": "Remote",
        "salary": "US$7000/month",
        "job_function": "Information Technology",
        "industries": "Internet Publishing",
        "employment_type": "Contract",
        "seniority_level": "Mid-Senior level",
        "education_level": "3+ years of real-world data engineering development experience in Snowflake and AWS (certifications preferred)",
        "notes": "",
        "hiring_manager": "Sameer Maskey Ph.D.",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-\nfusemachines-3733596267?refId=ld9q3KSO2a4lEIsngwp2vg%3D%3D&trackingId=yfa4tBjNooeEZzdQx2ASWA%3D%3D&position=24&pageNum=0"
    },
    {
        "title": null,
        "company": null,
        "description": "RemoteData Engineer12+ MonthsDevelop and maintain SQL scripts, stored procedures, and queries to extract and manipulate\ndata from various sources, including MSSQL and Postgres databases.Work with MuleSoft (Mule) for data integration and API\ndevelopment, if required or willing to learn it.Monitor and optimize data pipelines, troubleshoot issues, and ensure\ndata integrity and performance.Collaborate with data analysts to understand data requirements and support their data\nanalysis and modeling efforts.Stay up to date with industry trends, best practices, and emerging technologies related to\ndata engineering, Snowflake, ETL, SQL, and related tools.Solid understanding and hands-on experience with ETL tools and\nframeworks.Excellent communication and collaboration skills to work effectively with cross-functional teams.",
        "location": null,
        "salary": null,
        "job_function": "Information Technology",
        "industries": "IT Services and IT Consulting",
        "employment_type": "Contract",
        "seniority_level": "Mid-Senior level",
        "education_level": null,
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-accroid-\ninc-3778553874?refId=m4cyTa0q3I%2F0REHifu8sDQ%3D%3D&trackingId=4Qvt1JCJR6K0SBWp5lfCYQ%3D%3D&position=18&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Robinhood",
        "description": "Join a leading fintech company that’s democratizing finance for all.Robinhood was founded on a simple idea: that our\nfinancial markets should be accessible to all. With customers at the heart of our decisions, Robinhood is lowering\nbarriers and providing greater access to financial information. Together, we are building products and services that\nhelp create a financial system everyone can participate in.As we continue to build...We’re seeking curious, growth\nminded thinkers to help shape our vision, structures and systems; playing a key-role as we launch into our ambitious\nfuture. If you’re invigorated by our mission, values, and drive to change the world — we’d love to have you apply.About\nthe team + role Robinhood is a metrics driven company and data is foundational to all key decisions from growth strategy\nto product optimization to our day-to-day operations. We are looking for a Data Engineer to build and maintain\nfoundational datasets that will allow us to reliably and efficiently power decision making at Robinhood. These datasets\ninclude application events, database snapshots, and the derived datasets that describe and track Robinhood's key metrics\nacross all products. You’ll partner closely with engineers, data scientists and business teams to power analytics,\nexperimentation, and machine learning use cases. We are a fast-paced team in a fast growing company and this is a unique\nopportunity to help lay the foundation for reliable, impactful, data-driven decisions across the company for years to\ncome.The role is located in the office location(s) listed on this job description which will align with our in-office\nworking environment. Please connect with your recruiter for more information regarding our in-office philosophy and\nexpectations.What You’ll DoHelp define and build key datasets across all Robinhood product areas. Lead the evolution of\nthese datasets as use cases grow.Build scalable data pipelines using Python, Spark and Airflow to move data from\ndifferent applications into our data lake.Partner with upstream engineering teams to enhance data generation\npatterns.Partner with data consumers across Robinhood to understand consumption patterns and design intuitive data\nmodels.Ideate and contribute to shared data engineering tooling and standards.Define and promote data engineering best\npractices across the company.What You Bring4+ years of professional experience building end-to-end data pipelinesProven\nability to implement software engineering-caliber code (preferably Python)Expert at building and maintaining large-scale\ndata pipelines using open source frameworks (Spark, Flink, etc)Strong SQL (Presto, Spark SQL, etc) skills.Experience\nsolving problems across the data stack (Data Infrastructure, Analytics and Visualization platforms)Expert collaborator\nwith the ability to democratize data through actionable insights and solutions.What We OfferMarket competitive and pay\nequity-focused compensation structure100% paid health insurance for employees with 90% coverage for dependentsAnnual\nlifestyle wallet for personal wellness, learning and development, and more!Lifetime maximum benefit for family forming\nand fertility benefitsDedicated mental health support for employees and eligible dependentsGenerous time away including\ncompany holidays, paid time off, sick time, parental leave, and more!Lively office environment with catered meals, fully\nstocked kitchens, and geo-specific commuter benefitsBase pay for the successful applicant will depend on a variety of\njob-related factors, which may include education, training, experience, location, business needs, or market demands. The\nexpected salary range for this role is based on the location where the work will be performed and is aligned to one of 3\ncompensation zones. This role is also eligible to participate in a Robinhood bonus plan and Robinhood’s equity plan. For\nother locations not listed, compensation can be discussed with your recruiter during the interview process.US Zone 1:\n$157000 - $185000Menlo Park, CA; New York, NY; Seattle, WA; Washington, DCUS Zone 2: $139000 - $163000Denver, CO;\nWestlake, TX; Chicago, ILUS Zone 3: $122000 - $144000Lake Mary, FLClick Here To Learn More About Robinhood’s\nBenefits.We’re looking for more growth-minded and collaborative people to be a part of our journey in democratizing\nfinance for all. If you’re ready to give 100% in helping us achieve our mission—we’d love to have you apply even if you\nfeel unsure about whether you meet every single requirement in this posting. At Robinhood, we're looking for people\ninvigorated by our mission, values, and drive to change the world, not just those who simply check off all the\nboxes.Robinhood embraces a diversity of backgrounds and experiences and provides equal opportunity for all applicants\nand employees. We are dedicated to building a company that represents a variety of backgrounds, perspectives, and\nskills. We believe that the more inclusive we are, the better our work (and work environment) will be for everyone.\nAdditionally, Robinhood provides reasonable accommodations for candidates on request and respects applicants' privacy\nrights. To review Robinhood's Privacy Policy please review the specific policy applicable to your region: Canada\nApplicant Privacy Policy / UK/EEA Applicant Privacy Policy / US Applicant Privacy Policy",
        "location": "Menlo Park, CA; New York, NY; Seattle, WA; Washington, DC",
        "salary": "$157000 - $185000",
        "job_function": "Information Technology",
        "industries": "Financial Services",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "education_level": "Not specified",
        "notes": "",
        "hiring_manager": "Not specified",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-\nrobinhood-3737638667?refId=ld9q3KSO2a4lEIsngwp2vg%3D%3D&trackingId=G%2FWtwSC16gFK43IJgJt47Q%3D%3D&position=13&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "KPIT",
        "description": "We KPIT (www.kpit.com) are a global technologies company specializing in CASE (Connected, Autonomous, Shared, Electric)\ndomains. Systems and Software in Electric & Conventional Powertrain, Autonomous Driving & ADAS, Digital Connected\nSolutions, Connected Vehicles, Vehicle Diagnostics, and Vehicle Networks.Join the leading software development and\nintegration team helping mobility leapfrog towards a clean, smart, and safe future. A company specializing in embedded\nsoftware, AI, and digital solutions, KPIT accelerates clients’ implementation of next-generation\ntechnologies.Responsibilities:Develop and maintain ETL (Extract, Transform, Load) processes for efficient data\nintegration.Able to design and implement database schemas and write queries to retrieve and manipulate data.Build and\noptimize efficient data pipelines and architectures.Ensure data availability, integrity, and security.Using scripting\nlanguages (e.g., Python, Bash) for automation of data workflows and processes.Implementing containerization (e.g.,\nDocker) and orchestration tools (e.g., Kubernetes) for efficient deployment and management of data\napplications.Collaborate with data scientists, analysts, and other stakeholders to understand data\nrequirements.Requirements:Bachelor’s/master’s degree.Experience in data engineer role.Proficiency in designing and\nimplementing ETL processes to move and transform data (e.g., extracting data, data cleaning, joining data).Proficient in\nat least one programming language, such as Python, Java, or Scala.Proficiency in using SQL for data querying and\nmanipulation.Good understanding of database systems, both relational and NoSQL.Good understanding of data warehousing\nand big data technologies, such as Hadoop, Spark, and Kafka, Amazon Redshift, Google BigQuery.Knowledge on Apache Spark\nand PySpark.Familiarity with AWS/Azure/GCP Cloud platform.Familiar with concepts such as scalability, fault tolerance,\nand load balancing.Good understanding of continuous integration/continuous delivery (CI/CD).Knowledge of\ncontainerization (e.g., Docker) and orchestration tools (e.g., Kubernetes).",
        "location": "",
        "salary": null,
        "job_function": "Engineering",
        "industries": "Motor Vehicle Manufacturing",
        "employment_type": "Full-time",
        "seniority_level": "Associate",
        "education_level": "Bachelor’s/master’s degree",
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-\nkpit-3763812955?refId=H4EGkXNa5BoDzVIjuvwgQQ%3D%3D&trackingId=wjV%2B%2BgYZvPhdc%2BaDeXwFag%3D%3D&position=18&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "KPIT",
        "description": "We KPIT (www.kpit.com) are a global technologies company specializing in CASE (Connected, Autonomous, Shared, Electric)\ndomains. Systems and Software in Electric & Conventional Powertrain, Autonomous Driving & ADAS, Digital Connected\nSolutions, Connected Vehicles, Vehicle Diagnostics, and Vehicle Networks.Join the leading software development and\nintegration team helping mobility leapfrog towards a clean, smart, and safe future. A company specializing in embedded\nsoftware, AI, and digital solutions, KPIT accelerates clients’ implementation of next-generation\ntechnologies.Responsibilities:Develop and maintain ETL (Extract, Transform, Load) processes for efficient data\nintegration.Able to design and implement database schemas and write queries to retrieve and manipulate data.Build and\noptimize efficient data pipelines and architectures.Ensure data availability, integrity, and security.Using scripting\nlanguages (e.g., Python, Bash) for automation of data workflows and processes.Implementing containerization (e.g.,\nDocker) and orchestration tools (e.g., Kubernetes) for efficient deployment and management of data\napplications.Collaborate with data scientists, analysts, and other stakeholders to understand data\nrequirements.Requirements:Bachelor’s/master’s degree.Experience in data engineer role.Proficiency in designing and\nimplementing ETL processes to move and transform data (e.g., extracting data, data cleaning, joining data).Proficient in\nat least one programming language, such as Python, Java, or Scala.Proficiency in using SQL for data querying and\nmanipulation.Good understanding of database systems, both relational and NoSQL.Good understanding of data warehousing\nand big data technologies, such as Hadoop, Spark, and Kafka, Amazon Redshift, Google BigQuery.Knowledge on Apache Spark\nand PySpark.Familiarity with AWS/Azure/GCP Cloud platform.Familiar with concepts such as scalability, fault tolerance,\nand load balancing.Good understanding of continuous integration/continuous delivery (CI/CD).Knowledge of\ncontainerization (e.g., Docker) and orchestration tools (e.g., Kubernetes).",
        "location": "Global",
        "salary": null,
        "job_function": "Engineering",
        "industries": "Motor Vehicle Manufacturing",
        "employment_type": "Full-time",
        "seniority_level": "Associate",
        "education_level": "Bachelor’s/master’s degree",
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-\nkpit-3763812955?refId=KiOufBohy9Hx7d%2BO7QPHXA%3D%3D&trackingId=v%2BCuFHF8yLGAMHxFoopfmQ%3D%3D&position=24&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Robinhood",
        "description": "Join a leading fintech company that’s democratizing finance for all.Robinhood was founded on a simple idea: that our\nfinancial markets should be accessible to all. With customers at the heart of our decisions, Robinhood is lowering\nbarriers and providing greater access to financial information. Together, we are building products and services that\nhelp create a financial system everyone can participate in.As we continue to build...We’re seeking curious, growth\nminded thinkers to help shape our vision, structures and systems; playing a key-role as we launch into our ambitious\nfuture. If you’re invigorated by our mission, values, and drive to change the world — we’d love to have you apply.About\nthe team + role Robinhood is a metrics driven company and data is foundational to all key decisions from growth strategy\nto product optimization to our day-to-day operations. We are looking for a Data Engineer to build and maintain\nfoundational datasets that will allow us to reliably and efficiently power decision making at Robinhood. These datasets\ninclude application events, database snapshots, and the derived datasets that describe and track Robinhood's key metrics\nacross all products. You’ll partner closely with engineers, data scientists and business teams to power analytics,\nexperimentation, and machine learning use cases. We are a fast-paced team in a fast growing company and this is a unique\nopportunity to help lay the foundation for reliable, impactful, data-driven decisions across the company for years to\ncome.The role is located in the office location(s) listed on this job description which will align with our in-office\nworking environment. Please connect with your recruiter for more information regarding our in-office philosophy and\nexpectations.What You’ll DoHelp define and build key datasets across all Robinhood product areas. Lead the evolution of\nthese datasets as use cases grow.Build scalable data pipelines using Python, Spark and Airflow to move data from\ndifferent applications into our data lake.Partner with upstream engineering teams to enhance data generation\npatterns.Partner with data consumers across Robinhood to understand consumption patterns and design intuitive data\nmodels.Ideate and contribute to shared data engineering tooling and standards.Define and promote data engineering best\npractices across the company.What You Bring4+ years of professional experience building end-to-end data pipelinesProven\nability to implement software engineering-caliber code (preferably Python)Expert at building and maintaining large-scale\ndata pipelines using open source frameworks (Spark, Flink, etc)Strong SQL (Presto, Spark SQL, etc) skills.Experience\nsolving problems across the data stack (Data Infrastructure, Analytics and Visualization platforms)Expert collaborator\nwith the ability to democratize data through actionable insights and solutions.What We OfferMarket competitive and pay\nequity-focused compensation structure100% paid health insurance for employees with 90% coverage for dependentsAnnual\nlifestyle wallet for personal wellness, learning and development, and more!Lifetime maximum benefit for family forming\nand fertility benefitsDedicated mental health support for employees and eligible dependentsGenerous time away including\ncompany holidays, paid time off, sick time, parental leave, and more!Lively office environment with catered meals, fully\nstocked kitchens, and geo-specific commuter benefitsBase pay for the successful applicant will depend on a variety of\njob-related factors, which may include education, training, experience, location, business needs, or market demands. The\nexpected salary range for this role is based on the location where the work will be performed and is aligned to one of 3\ncompensation zones. This role is also eligible to participate in a Robinhood bonus plan and Robinhood’s equity plan. For\nother locations not listed, compensation can be discussed with your recruiter during the interview process.US Zone 1:\n$157000 - $185000Menlo Park, CA; New York, NY; Seattle, WA; Washington, DCUS Zone 2: $139000 - $163000Denver, CO;\nWestlake, TX; Chicago, ILUS Zone 3: $122000 - $144000Lake Mary, FLClick Here To Learn More About Robinhood’s\nBenefits.We’re looking for more growth-minded and collaborative people to be a part of our journey in democratizing\nfinance for all. If you’re ready to give 100% in helping us achieve our mission—we’d love to have you apply even if you\nfeel unsure about whether you meet every single requirement in this posting. At Robinhood, we're looking for people\ninvigorated by our mission, values, and drive to change the world, not just those who simply check off all the\nboxes.Robinhood embraces a diversity of backgrounds and experiences and provides equal opportunity for all applicants\nand employees. We are dedicated to building a company that represents a variety of backgrounds, perspectives, and\nskills. We believe that the more inclusive we are, the better our work (and work environment) will be for everyone.\nAdditionally, Robinhood provides reasonable accommodations for candidates on request and respects applicants' privacy\nrights. To review Robinhood's Privacy Policy please review the specific policy applicable to your region: Canada\nApplicant Privacy Policy / UK/EEA Applicant Privacy Policy / US Applicant Privacy Policy",
        "location": "Menlo Park, CA; New York, NY; Seattle, WA; Washington, DC",
        "salary": "$157000 - $185000",
        "job_function": "Information Technology",
        "industries": "Financial Services",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "education_level": "Not specified",
        "notes": "",
        "hiring_manager": "Not specified",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-robinhood-\n3737638667?refId=ACNf%2FwdQfBNm%2BGsMg51brQ%3D%3D&trackingId=0vAwwSkHzdotcRAvOZKUPg%3D%3D&position=13&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Fusemachines",
        "description": "About FusemachinesFusemachines is a leading AI strategy, talent, and education services provider. Founded by Sameer\nMaskey Ph.D., Adjunct Associate Professor at Columbia University, Fusemachines has a core mission of democratizing AI.\nWith a presence in 4 countries (Nepal, United States, Canada, and Dominican Republic and more than 350 full-time\nemployees) Fusemachines seeks to bring its global expertise in AI to transform companies around the world.About the\nrole:This is a remote, 6 months contract role, with a possibility of extension, responsible for designing, building, and\nmaintaining the infrastructure required for data integration, storage, processing, and analytics (BI, visualization and\nAdvanced Analytics). Working in the Financial sector and implementing cyber-security use cases.Salary Range:\nUS$7000/monthJob Type: 1099 ContractStart Date: The contract for this position is scheduled to begin in January\n2024Qualification / Skill Set Requirement:3+ years of real-world data engineering development experience in Snowflake\nand AWS (certifications preferred)Proven experience as a Snowflake Developer, with a strong understanding of Snowflake\narchitecture and concepts.Proficient in snowflake services such as snowpipe, stages, stored procedures, views,\nmaterialized views, tasks and streams.Must have previous experience working with security datasetsStrong programming\nskills in SQL, with proficiency in writing efficient and optimized code for data integration, storage, processing, and\nmanipulation.Robust understanding of data partitioning and other optimization techniques in Snowflake.Knowledge of data\nsecurity measures in Snowflake, including role-based access control (RBAC) and data encryption.Highly skilled in one or\nmore languages such as Python, Scala, and proficient in writing efficient and optimized code for data integration,\nstorage, processing and manipulation.Strong knowledge of SDLC tools and technologies, including project management\nsoftware (Jira or similar), source code management (GitHub or similar), CI/CD system (GitHub actions, AWS CodeBuild or\nsimilar) and binary repository manager (AWS CodeArtifact or similar).Skilled in Data Integration from different sources\nsuch as APIs, databases, flat files, event streaming.Good understanding of Data Modeling and Database Design Principles.\nBeing able to design and implement efficient database schemas that meet the requirements of the data architecture to\nsupport data solutions.Strong experience in working with ELT and ETL tools and being able to develop custom integration\nsolutions as needed.Strong experience with scalable and distributed Data Technologies such as Spark/PySpark, DBT and\nKafka, to be able to handle large volumes of data.Strong experience in designing and implementing Data Warehousing\nsolutions in AWS with RedShift. Demonstrated experience in designing and implementing efficient ELT/ETL processes that\nextract data from source systems, transform it (DBT), and load it into the data warehouse.Strong experience in\nOrchestration using Apache Airflow.Expert in Cloud Computing in AWS, including deep knowledge of a variety of AWS\nservices like Lambda, Kinesis, S3, Lake Formation, EC2, ECS/ECR, IAM, CloudWatch, Redshift, etcGood understanding of\nData Quality and Governance, including implementation of data quality checks and monitoring processes to ensure that\ndata is accurate, complete, and consistent.Good Problem-Solving skills: being able to troubleshoot data processing\npipelines and identify performance bottlenecks and other issues.Responsibilities:Follow established design, constructed\ndata architectures. Developing and maintaining data pipelines, ensuring data flows smoothly from source to destination.\nHandle ELT processes, including data extraction, loading, transformation and load data from various sources into\nSnowflake.Ensure the reliability, scalability, and efficiency of data systems are maintained at all timesAssist in the\nconfiguration and management of Snowflake data warehousing and data lake solutions, working under the guidance of senior\nteam members.Collaborate closely with cross-functional teams including Product, Engineering, Data Scientists, and\nAnalysts to thoroughly understand data requirements and provide data engineering support.Contribute to data quality\nassurance efforts, such as implementing data validation checks and tests.Evaluate and implement cutting-edge\ntechnologies and continue learning and expanding skills in data engineering and cloud platforms.Develop, design, and\nexecute data governance strategies encompassing cataloging, lineage tracking, quality control, and data governance\nframeworks that align with current analytics demands and industry best practicesDocument data engineering processes and\ndata flows.Care about architecture, observability, testing, and building reliable infrastructure and data\npipelines.Takes ownership of storage layer, SQL database management tasks, including schema design, indexing, and\nperformance tuning.Swiftly address and resolve complex data engineering issues, incidents and resolve bottlenecks in SQL\nqueries and database operations.Assess best practices and design schemas that matches business needs for delivering a\nmodern analytics solution (descriptive, diagnostic, predictive, prescriptive)Be an active member of our Agile team,\nparticipating in all ceremonies and continuous improvement activities.Equal Opportunity Employer: Race, Color, Religion,\nSex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran\nStatus, or any other legally protected group status.Powered by JazzHRshDrx201iX",
        "location": "Remote",
        "salary": "$7000/month",
        "job_function": "Information Technology",
        "industries": "Internet Publishing",
        "employment_type": "Contract",
        "seniority_level": "Mid-Senior level",
        "education_level": "Not specified",
        "notes": "",
        "hiring_manager": "Not specified",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-fusemachines-\n3733596267?refId=kYTn7fN4pmu2wMuvUKnT5A%3D%3D&trackingId=R1LUZy6eP09W7N1Hfe%2BiWA%3D%3D&position=24&pageNum=0"
    },
    {
        "title": null,
        "company": null,
        "description": "RemoteData Engineer12+ MonthsDevelop and maintain SQL scripts, stored procedures, and queries to extract and manipulate\ndata from various sources, including MSSQL and Postgres databases.Work with MuleSoft (Mule) for data integration and API\ndevelopment, if required or willing to learn it.Monitor and optimize data pipelines, troubleshoot issues, and ensure\ndata integrity and performance.Collaborate with data analysts to understand data requirements and support their data\nanalysis and modeling efforts.Stay up to date with industry trends, best practices, and emerging technologies related to\ndata engineering, Snowflake, ETL, SQL, and related tools.Solid understanding and hands-on experience with ETL tools and\nframeworks.Excellent communication and collaboration skills to work effectively with cross-functional teams.",
        "location": null,
        "salary": null,
        "job_function": "Information Technology",
        "industries": "IT Services and IT Consulting",
        "employment_type": "Contract",
        "seniority_level": "Mid-Senior level",
        "education_level": null,
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-accroid-\ninc-3778553874?refId=H4EGkXNa5BoDzVIjuvwgQQ%3D%3D&trackingId=fzMGMgohhS9IePtOfIcFlg%3D%3D&position=17&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Rockstar Games",
        "description": "At Rockstar Games, we create world-class entertainment experiences.A career at Rockstar Games is about being part of a\nteam working on some of the most creatively rewarding and ambitious projects to be found in any entertainment medium.\nYou would be welcomed to a dedicated and inclusive environment where you can learn, and collaborate with some of the\nmost talented people in the industry.Rockstar is seeking a Data Engineer to join a team focused on building a cutting-\nedge game analytics platform and tools to better understand our players and enhance their experience in our games. This\nis a full-time permanent position based out of Rockstar’s unique game development studio in Andover, MA.The ideal\ncandidate will be skilled in developing complex ingestion and transformation processes with an emphasis on reliability\nand performance. In collaboration with other data engineers, machine learning engineers, and software engineers, the\ncandidate will empower the team of analysts and data scientists to deliver data driven insights and applications to\ncompany stakeholders.What We DoThe Rockstar Analytics team provide insights and actionable results to a wide variety of\nstakeholders across the organization in support of their decision making.We are currently adding team members to\nmultiple verticals including; Machine Learning and Game Data Pipeline.ResponsibilitiesImplement and maintain real-time\nand batch Data Models.Deliver real-time and non-real-time data models to analysts and data scientists who create\ninsights and analytics applications for our stakeholders.Implement and support streaming technologies such as Kafka,\nSpark, Cassandra & AzureML.Assist in the development of deployment automation and operational support strategies.Assist\nin the development of a big data platform in Hadoop using pipeline technologies such as Spark, Airflow, and more to\nsupport a variety of requirements and applications.Set the standards for warehouse and schema design in massively\nparallel processing engines such as Hadoop and Snowflake while collaborating with analysts and data scientist in the\ncreation of efficient data models.Maintain and extend our CI/CD processes and documentation.Qualifications3+ years of\nwork experience with data modeling, business intelligence and machine learning on big data architectures.2+ years of\nexperience with the Hadoop ecosystem (HDFS, Spark, Oozie, Impala, etc.) and big data ecosystems (Kafka, Cassandra,\netc.).2+ years of experience with the Azure ecosystem (Azure ML, Azure Data Factory) Expert in at least one SQL language\nsuch as T-SQL or PL/SQL.Experience developing and managing data warehouses on a terabyte or petabyte scale.Strong\nexperience in massively parallel processing & columnar databases.Experience building Real-Time and/or Near-Real-Time ML\npipelines.Experience with Python, Scala, or Java.Experience with shell scripting.Experience working in a Linux\nenvironment.SkillsDeep understanding of advanced data warehousing concepts and track record of applying these concepts\non the job.Ability to manage numerous projects concurrently and strategically, prioritizing when necessary.Good\ncommunication skills.Dynamic team player.A passion for technology.PLUSESPlease note that these are desirable skills and\nare not required to apply for the position.Experience with Python based libraries such as Scikit-Learn Experience with\nDatabricksExperience with Spark-ML, Jupyter Notebook, AzureML.Experience in Lambda architecture.Experience with\nCI/CD.Familiar with Restful APIs.Experience with Artifact Repositories.Knowledge of the video game industry.How To\nApplyPlease apply with a resume and cover letter demonstrating how you meet the skills above. If we would like to move\nforward with your application, a Rockstar recruiter will reach out to you to explain next steps and guide you through\nthe process.Rockstar is proud to be an equal opportunity employer, and we are committed to hiring, promoting, and\ncompensating employees based on their qualifications and demonstrated ability to perform job responsibilities.If you’ve\ngot the right skills for the job, we want to hear from you. We encourage applications from all suitable candidates\nregardless of age, disability, gender identity, sexual orientation, religion, belief, or race.",
        "location": "Andover, MA",
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Computer Games",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "education_level": null,
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-rockstar-\ngames-3719384994?refId=KiOufBohy9Hx7d%2BO7QPHXA%3D%3D&trackingId=aJv57y4okQ%2Fkfr6UKCivOg%3D%3D&position=23&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "The Walt Disney Company",
        "description": "About The Role & TeamJoin the Data Engineering team within the Disney Decision Science + Integration (DDSI) organization\nat The Walt Disney Company. We support clients within Disney Experiences which include Parks & Resorts both domestic and\ninternational, Consumer Products and Disney Signature Experiences as well as the Disney Entertainment segment which\ninclude Studios Content (Disney Theatrical Group), General Entertainment Content, and ESPN and Sports Content.We use\ntechnology, data analytics, optimization, statistical and econometric modeling to explore opportunities, shape business\ndecisions and drive business value.As a member of the Data Engineering team you will be responsible for partnering with\nDecision Science Products, Decision Science, Client and Technology team members on various development and sustainment\nprojects, ad-hoc requests, prototyping and research initiatives by providing data pipeline and database engineering\nservices.As a Data Engineer you will work on projects such as Adventures by Disney (AbD), VIP Tours, Resort Inventory\nOptimization (RIO), and several upcoming initiatives. In this position, the candidate will have tasks to develop,\nimplement, improve and support our solutions. The work will involve various data engineering activities throughout the\nproject SDLC.What You Will DoWork assignments may cover activities such as participation in data requirements gathering,\nsource-to-target mapping, develop and maintaining ELT data pipelines, data quality monitoring, producing input datasets\nfor science models and visualizations and Batch/Orchestration job scheduling. In addition to technical abilities, the\nrole is responsible for understanding the business domain and processes, then applying that knowledge to the assigned\nwork. This role communicates data engineering progress to the project leadership team, and actively participates in\nmeetings and discussions.Required Qualifications & SkillsMinimum 3 years of related work experienceExperience with\nELT/ETL data pipeline development and maintenanceExpertise using Python and SQLAbility to showcase an understanding of\none or more business domainsPrior experience gathering data requirements and producing data design solutionsExperience\nwith developing in a multi environment (Dev, QA, Prod, etc.) and DevOps procedures for code\ndeployment/promotionExperience crafting and building relational databases (preferably in Postgres or\nSnowflake)Experience leading and deploying code using a source control product such as GitLab/GitHubAble to formulate\nsolutions and communicate sophisticated technical concepts to non-technical team membersPreferred\nQualificationsKnowledgeable with theme park attendance, reservations and/or productsShowed strength interacting with\nAPI’sExperience with data orchestration tools such as Apache AirflowKnowledgeable on cloud architecture and product\nofferings, preferably AWSExperience using containerization technologies such as Docker or KubernetesEducationBachelor’s\ndegree in Computer Science, Mathematics, Engineering or related field preferred/or equivalent work experienceMaster’s\ndegree preferred Computer Science, Mathematics, Engineering or related field preferred",
        "location": "Unknown",
        "salary": "Not specified",
        "job_function": "Information Technology",
        "industries": "Entertainment Providers",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "education_level": "Bachelor's degree in Computer Science, Mathematics, Engineering or related field preferred/or equivalent work experience",
        "notes": "",
        "hiring_manager": "Unknown",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-the-walt-disney-\ncompany-3764137624?refId=5eyAniSzCOFqPd2ejukkvQ%3D%3D&trackingId=ulKZbmnwf6Rt9Y9pFJlFxA%3D%3D&position=16&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Walgreens Boots Alliance, Inc.",
        "description": "Job SummaryBuilds & maintains big data pipelines to support advanced analytics and data science solutions. Identifies\nvaluable internal and external data. Collaborates closely with data scientists to define data for the design,\ndevelopment, and deployment of new solutions that support business priorities.Job Responsibilities Develops software\nthat processes, stores and serves data for use by others.Develops data structures and pipelines to organize, collect and\nstandardize data that helps generate insights and addresses reporting needs.Writes ETL (Extract / Transform / Load)\nprocesses, designs database systems and develops tools for real-time and offline analytic processing.Develops data\npipelines that are scalable, repeatable and secure.Troubleshoots software and processes for data consistency and\nintegrity. Integrates data from a variety of sources, assuring that they adhere to data quality and accessibility\nstandards.Effectively resolves problems and roadblocks as they occur.Interacts with internal and external peers and/or\nmanagers to exchange semi-complex information related to assigned activities.About Walgreens and WBAWalgreens\n(www.walgreens.com) is included in the U.S. Retail Pharmacy and U.S. Healthcare segments of Walgreens Boots Alliance,\nInc. (Nasdaq: WBA), an integrated healthcare, pharmacy and retail leader with a 170 year heritage of caring for\ncommunities. WBA’s purpose is to create more joyful lives through better health. Operating nearly 9,000 retail locations\nacross America, Puerto Rico and the U.S. Virgin Islands, Walgreens is proud to be a neighborhood health destination\nserving nearly 10 million customers each day. Walgreens pharmacists play a critical role in the U.S. healthcare system\nby providing a wide range of pharmacy and healthcare services, including those that drive equitable access to care for\nthe nation’s medically underserved populations. To best meet the needs of customers and patients, Walgreens offers a\ntrue omnichannel experience, with fully integrated physical and digital platforms supported by the latest technology to\ndeliver high quality products and services in communities nationwide.Basic QualificationsBachelor's degree and at least\n2 years of experience in data engineering; OR Graduate Degree in a technical discipline.Advanced knowledge of\nSQLExperience establishing and maintaining key relationships with internal (peers, business partners and leadership) and\nexternal (business community, clients and vendors) within a matrix organization to ensure quality standards for\nservice.Experience analyzing and reporting data in order to identify issues, trends, or exceptions to drive improvement\nof results and find solutions.Willing to travel up to 10% of the time for business purposes (within state and out of\nstate).Preferred QualificationsGraduate Degree in a technical disciplineExperience with REST API developmentExperience\nwith Azure application deploymentExperience in Azure technologies like Azure Data Factory, Azure Databricks using Python\nor Scala, App Services, Azure Data Lake, Azure Functions, Event Hubs, Event Grids and Logic AppExperience in building\nAzure DevOPS pipelines to enable CI/CD, Infrastructure as Code (Iaas), and automation.",
        "location": "United States",
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Wellness and Fitness Services, Pharmaceutical Manufacturing, and Retail",
        "employment_type": "Full-time",
        "seniority_level": "Not Applicable",
        "education_level": "Bachelor's degree and at least 2 years of experience in data engineering; OR Graduate Degree in a technical discipline",
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-talend-at-\nwalgreens-3763922227?refId=UQ7Y3xGbf7FjVTCwWTFe5g%3D%3D&trackingId=pPUuxViSw95v81TFcR%2B4PA%3D%3D&position=7&pageNum=0"
    },
    {
        "title": null,
        "company": null,
        "description": "Role: Data Engineer (DE)Location: Scottsdale AZ (day 1 onsite)Duration: Fulltime Must have skill set: Java, Scala,\nPython, Spark, S3, Glue, RedshiftYou have 6-8 years of relevant software development experience. You have hands-on\nexperience in Java/Scala/Python, Spark, S3, Glue, Redshift. This is critical. Highly analytical and data oriented.\nExperience in SQL, NoSql Database Data masking of on prem PII data. Develop API calls with using secure data transfer.\nTake standard output data to lower environments for pre prod testing! Enable secured channels for data models and data\nscience activities. Need a solution that can scale to handle millions of data. i.e., masking 10 million records in 15\nmins You have experience with development tools and agile methodologies.",
        "location": null,
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Human Resources Services",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "education_level": null,
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-de-at-zortech-\nsolutions-3778562998?refId=UQ7Y3xGbf7FjVTCwWTFe5g%3D%3D&trackingId=cOTTZya5XMAUY8J0DkV%2BUA%3D%3D&position=14&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "REALLY",
        "description": "As a Data Engineer at REALLY, your primary responsibility is to seamlessly integrate data from internal and external\nsources into a unified warehouse data model. You will play a crucial part in facilitating data and analytics endeavors\nacross REALLY’s business functions.We’re seeking an individual with hands-on experience in data modeling, test\nautomation, and the development of efficient data pipelines. You are comfortable with rapid-prototyping, while\nunderstanding how to build sustainable and scalable solutions. You are eager to understand our business, enabling you to\nshape the vision of data's impact and value at REALLY.Responsibilities:Create and maintain an internal database for\ningesting data from various sources into one centralized platform, unlocking the ability for the business to analyze all\nkey metrics across REALLY’s multiple business functionsThrough your work, the business will be able to analyze the full\ncustomer journey from first engagement to purchase and track the full lifecycle in one single view of the\ncustomerPartner with executives and engineering team to bring to life our data philosophy through the right processes\nand toolsAutomate manual data processes; design and implement internal process improvements for optimizing data delivery\nand ensuring the highest level of data qualityBecome a subject matter expert on the tools REALLY uses to track data\nacross the businessAbility to perform root cause analysis on external and internal processes and data to identify\nopportunities for improvement and answer questionsBuild analytics tools that utilize different data pipeline sources to\nprovide actionable insights into customer acquisition, behavior (ex. Google Analytics, Search Console, Ads, etc).\nPartner with our software engineers to develop architectures that enable scalable data extraction and transformation for\nboth predictive and prescriptive modeling.Qualifications:5+ years of professional (or comparable) data/analytics\nexperienceExperience with SQL and relational databasesExperience with Data Warehouses such as SnowflakeExperience with\nBI platforms such as Looker and TableauTechnical expertise in designing and creating data modelsStrong attention to\ndetailA passion for problem solving with strong analytical capabilities associated with working on unstructured\ndatasetsA desire to follow exceptional software engineering processes, and familiarity with common engineering process\ntools like Github and GitlabExcellent written and verbal communication skillsAbility to communicate complex information\nto non-technical audiencesBonus Experience:Experience with Snowflake, Redshift, or BigQueryProgramming experience in\nPythonExperience creating data visualizations using JavascriptPerks and Benefits:Competitive compensationMedical,\ndental, and vision coverage for you and your familyLife insurance paid for by REALLYREALLY is an equal opportunity\nemployer and we welcome everyone to our team. We believe that diversity is integral to our success, and do not\ndiscriminate based on race, color, religion, age, or any other basis protected by law.This position is based in Austin,\nTX.REALLY is an equal opportunity employer and we welcome everyone to our team. We believe that diversity is integral to\nour success, and do not discriminate based on race, color, religion, age, or any other basis protected by law.Powered by\nJazzHRO0te1Osi3U",
        "location": "Austin, TX",
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Internet Publishing",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "education_level": null,
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-\nreally-3771328759?refId=b6qNTI3myDV%2FxeyC4CXYqQ%3D%3D&trackingId=9gbVSQcbsNKa0lON2ThBUw%3D%3D&position=4&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "REALLY",
        "description": "As a Data Engineer at REALLY, your primary responsibility is to seamlessly integrate data from internal and external\nsources into a unified warehouse data model. You will play a crucial part in facilitating data and analytics endeavors\nacross REALLY’s business functions.We’re seeking an individual with hands-on experience in data modeling, test\nautomation, and the development of efficient data pipelines. You are comfortable with rapid-prototyping, while\nunderstanding how to build sustainable and scalable solutions. You are eager to understand our business, enabling you to\nshape the vision of data's impact and value at REALLY.Responsibilities:Create and maintain an internal database for\ningesting data from various sources into one centralized platform, unlocking the ability for the business to analyze all\nkey metrics across REALLY’s multiple business functionsThrough your work, the business will be able to analyze the full\ncustomer journey from first engagement to purchase and track the full lifecycle in one single view of the\ncustomerPartner with executives and engineering team to bring to life our data philosophy through the right processes\nand toolsAutomate manual data processes; design and implement internal process improvements for optimizing data delivery\nand ensuring the highest level of data qualityBecome a subject matter expert on the tools REALLY uses to track data\nacross the businessAbility to perform root cause analysis on external and internal processes and data to identify\nopportunities for improvement and answer questionsBuild analytics tools that utilize different data pipeline sources to\nprovide actionable insights into customer acquisition, behavior (ex. Google Analytics, Search Console, Ads, etc).\nPartner with our software engineers to develop architectures that enable scalable data extraction and transformation for\nboth predictive and prescriptive modeling.Qualifications:5+ years of professional (or comparable) data/analytics\nexperienceExperience with SQL and relational databasesExperience with Data Warehouses such as SnowflakeExperience with\nBI platforms such as Looker and TableauTechnical expertise in designing and creating data modelsStrong attention to\ndetailA passion for problem solving with strong analytical capabilities associated with working on unstructured\ndatasetsA desire to follow exceptional software engineering processes, and familiarity with common engineering process\ntools like Github and GitlabExcellent written and verbal communication skillsAbility to communicate complex information\nto non-technical audiencesBonus Experience:Experience with Snowflake, Redshift, or BigQueryProgramming experience in\nPythonExperience creating data visualizations using JavascriptPerks and Benefits:Competitive compensationMedical,\ndental, and vision coverage for you and your familyLife insurance paid for by REALLYREALLY is an equal opportunity\nemployer and we welcome everyone to our team. We believe that diversity is integral to our success, and do not\ndiscriminate based on race, color, religion, age, or any other basis protected by law.This position is based in Austin,\nTX.REALLY is an equal opportunity employer and we welcome everyone to our team. We believe that diversity is integral to\nour success, and do not discriminate based on race, color, religion, age, or any other basis protected by law.Powered by\nJazzHRO0te1Osi3U",
        "location": "Austin, TX",
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Internet Publishing",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "education_level": null,
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-\nreally-3771328759?refId=5eyAniSzCOFqPd2ejukkvQ%3D%3D&trackingId=0PYXSXYRSy2ek1igQGN0VQ%3D%3D&position=4&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "The Walt Disney Company",
        "description": "About The Role & TeamJoin the Data Engineering team within the Disney Decision Science + Integration (DDSI) organization\nat The Walt Disney Company. We support clients within Disney Experiences which include Parks & Resorts both domestic and\ninternational, Consumer Products and Disney Signature Experiences as well as the Disney Entertainment segment which\ninclude Studios Content (Disney Theatrical Group), General Entertainment Content, and ESPN and Sports Content.We use\ntechnology, data analytics, optimization, statistical and econometric modeling to explore opportunities, shape business\ndecisions and drive business value.As a member of the Data Engineering team you will be responsible for partnering with\nDecision Science Products, Decision Science, Client and Technology team members on various development and sustainment\nprojects, ad-hoc requests, prototyping and research initiatives by providing data pipeline and database engineering\nservices.As a Data Engineer you will work on projects such as Adventures by Disney (AbD), VIP Tours, Resort Inventory\nOptimization (RIO), and several upcoming initiatives. In this position, the candidate will have tasks to develop,\nimplement, improve and support our solutions. The work will involve various data engineering activities throughout the\nproject SDLC.What You Will DoWork assignments may cover activities such as participation in data requirements gathering,\nsource-to-target mapping, develop and maintaining ELT data pipelines, data quality monitoring, producing input datasets\nfor science models and visualizations and Batch/Orchestration job scheduling. In addition to technical abilities, the\nrole is responsible for understanding the business domain and processes, then applying that knowledge to the assigned\nwork. This role communicates data engineering progress to the project leadership team, and actively participates in\nmeetings and discussions.Required Qualifications & SkillsMinimum 3 years of related work experienceExperience with\nELT/ETL data pipeline development and maintenanceExpertise using Python and SQLAbility to showcase an understanding of\none or more business domainsPrior experience gathering data requirements and producing data design solutionsExperience\nwith developing in a multi environment (Dev, QA, Prod, etc.) and DevOps procedures for code\ndeployment/promotionExperience crafting and building relational databases (preferably in Postgres or\nSnowflake)Experience leading and deploying code using a source control product such as GitLab/GitHubAble to formulate\nsolutions and communicate sophisticated technical concepts to non-technical team membersPreferred\nQualificationsKnowledgeable with theme park attendance, reservations and/or productsShowed strength interacting with\nAPI’sExperience with data orchestration tools such as Apache AirflowKnowledgeable on cloud architecture and product\nofferings, preferably AWSExperience using containerization technologies such as Docker or KubernetesEducationBachelor’s\ndegree in Computer Science, Mathematics, Engineering or related field preferred/or equivalent work experienceMaster’s\ndegree preferred Computer Science, Mathematics, Engineering or related field preferred",
        "location": "Not specified",
        "salary": "Not specified",
        "job_function": "Information Technology",
        "industries": "Entertainment Providers",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "education_level": "Bachelor's degree in Computer Science, Mathematics, Engineering or related field preferred/or equivalent work experience. Master's degree preferred Computer Science, Mathematics, Engineering or related field preferred",
        "notes": "",
        "hiring_manager": "Not specified",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-the-walt-disney-\ncompany-3764137624?refId=H4EGkXNa5BoDzVIjuvwgQQ%3D%3D&trackingId=fyUKmo3P%2Far8Ys9IyyqxyQ%3D%3D&position=12&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Dollar General Corporation",
        "description": "Dollar General Corporation has been delivering value to shoppers for more than 80 years. Dollar General helps shoppers\nSave time. Save money. Every day.® by offering products that are frequently used and replenished, such as food, snacks,\nhealth and beauty aids, cleaning supplies, basic apparel, housewares and seasonal items at everyday low prices in\nconvenient neighborhood locations. Dollar General operates more than 18,000 stores in 47 states, and we’re still\ngrowing. Learn more about Dollar General at www.dollargeneral.com.General Summary Dollar General Corporation has been\ndelivering value to shoppers for more than 80 years. Dollar General helps shoppers Save time. Save money. Every day.® by\noffering products that are frequently used and replenished, such as food, snacks, health and beauty aids, cleaning\nsupplies, basic apparel, housewares and seasonal items at everyday low prices in convenient neighborhood locations.\nDollar General operates more than 18,000 stores in 47 states, and we’re still growing. Learn more about Dollar General\nat www.dollargeneral.com.Duties & Responsibilities Advanced working SQL knowledge and experience working with relational\ndatabases, query authoring (SQL) as well as working familiarity with a variety of databases.Assemble large, complex data\nsets that meet functional / non-functional business requirements.Identify, design, and implement internal process\nimprovements automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability,\netc.Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of\ndata sources using SQL and cloud technologies.Build analytics tools that utilize the data pipelines to provide\nactionable insights into customer acquisition, operational efficiency and other key business performance metrics.Work\nwith stakeholders including the Product, Data and Design teams to assist with data-related technical issues and support\ntheir data infrastructure needs.Knowledge, Skills and Abilities Knowledge of programming languages (e.g. Java and\nPython)Hands-on experience with SQL database designGreat numerical and analytical skillsDegree in Computer Science, IT,\nor similar field; a Master’s is a plusData engineering certification (e.g IBM Certified Data Engineer) is a\nplusExperience with big data tools Hadoop, Spark, Kafka, etc.Experience with relational SQL and NoSQL databases,\nincluding Postgres and Cassandra.Experience with data pipeline and workflow management tools Azkaban, Luigi, Airflow,\netc.Experience with Snowflake/Azure cloud services EC2, EMR, RDS, RedshiftExperience with stream-processing systems\nStorm, Spark-Streaming, etc.Experience with object-oriented/object function scripting languages Python, Java, C++,\nScala, etcWork Experience &/or Education Degree in information technology or computer science with additional vendor-\nspecific certification.BS or MS degree in Computer Science or a related technical field4+ years of Python or Java\ndevelopment experience4+ years of SQL experience (No-SQL experience is a plus)4+ years of experience with schema design\nand dimensional data modelingAbility in managing and communicating data warehouse plans to internal clientsExperience\ndesigning, building, and maintaining data processing systemsExperience working with a cloud platform such as Snowflake /\nAzure or Databricks#mogul#",
        "location": "Unknown",
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Retail",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "education_level": "Degree in Computer Science, IT, or similar field; a Master’s is a plus",
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-dollar-\ngeneral-3745487485?refId=m4cyTa0q3I%2F0REHifu8sDQ%3D%3D&trackingId=Cj%2FzdtC1L07RWgxFZ9ykLg%3D%3D&position=25&pageNum=0"
    },
    {
        "title": null,
        "company": null,
        "description": "Join a leading fintech company that’s democratizing finance for all.Robinhood was founded on a simple idea: that our\nfinancial markets should be accessible to all. With customers at the heart of our decisions, Robinhood is lowering\nbarriers and providing greater access to financial information. Together, we are building products and services that\nhelp create a financial system everyone can participate in.As we continue to build...We’re seeking curious, growth\nminded thinkers to help shape our vision, structures and systems; playing a key-role as we launch into our ambitious\nfuture. If you’re invigorated by our mission, values, and drive to change the world — we’d love to have you apply.About\nthe team + role Robinhood is a metrics driven company and data is foundational to all key decisions from growth strategy\nto product optimization to our day-to-day operations. We are looking for a Data Engineer to build and maintain\nfoundational datasets that will allow us to reliably and efficiently power decision making at Robinhood. These datasets\ninclude application events, database snapshots, and the derived datasets that describe and track Robinhood's key metrics\nacross all products. You’ll partner closely with engineers, data scientists and business teams to power analytics,\nexperimentation, and machine learning use cases. We are a fast-paced team in a fast growing company and this is a unique\nopportunity to help lay the foundation for reliable, impactful, data-driven decisions across the company for years to\ncome.The role is located in the office location(s) listed on this job description which will align with our in-office\nworking environment. Please connect with your recruiter for more information regarding our in-office philosophy and\nexpectations.What You’ll DoHelp define and build key datasets across all Robinhood product areas. Lead the evolution of\nthese datasets as use cases grow.Build scalable data pipelines using Python, Spark and Airflow to move data from\ndifferent applications into our data lake.Partner with upstream engineering teams to enhance data generation\npatterns.Partner with data consumers across Robinhood to understand consumption patterns and design intuitive data\nmodels.Ideate and contribute to shared data engineering tooling and standards.Define and promote data engineering best\npractices across the company.What You Bring4+ years of professional experience building end-to-end data pipelinesProven\nability to implement software engineering-caliber code (preferably Python)Expert at building and maintaining large-scale\ndata pipelines using open source frameworks (Spark, Flink, etc)Strong SQL (Presto, Spark SQL, etc) skills.Experience\nsolving problems across the data stack (Data Infrastructure, Analytics and Visualization platforms)Expert collaborator\nwith the ability to democratize data through actionable insights and solutions.What We OfferMarket competitive and pay\nequity-focused compensation structure100% paid health insurance for employees with 90% coverage for dependentsAnnual\nlifestyle wallet for personal wellness, learning and development, and more!Lifetime maximum benefit for family forming\nand fertility benefitsDedicated mental health support for employees and eligible dependentsGenerous time away including\ncompany holidays, paid time off, sick time, parental leave, and more!Lively office environment with catered meals, fully\nstocked kitchens, and geo-specific commuter benefitsBase pay for the successful applicant will depend on a variety of\njob-related factors, which may include education, training, experience, location, business needs, or market demands. The\nexpected salary range for this role is based on the location where the work will be performed and is aligned to one of 3\ncompensation zones. This role is also eligible to participate in a Robinhood bonus plan and Robinhood’s equity plan. For\nother locations not listed, compensation can be discussed with your recruiter during the interview process.US Zone 1:\n$157000 - $185000Menlo Park, CA; New York, NY; Seattle, WA; Washington, DCUS Zone 2: $139000 - $163000Denver, CO;\nWestlake, TX; Chicago, ILUS Zone 3: $122000 - $144000Lake Mary, FLClick Here To Learn More About Robinhood’s\nBenefits.We’re looking for more growth-minded and collaborative people to be a part of our journey in democratizing\nfinance for all. If you’re ready to give 100% in helping us achieve our mission—we’d love to have you apply even if you\nfeel unsure about whether you meet every single requirement in this posting. At Robinhood, we're looking for people\ninvigorated by our mission, values, and drive to change the world, not just those who simply check off all the\nboxes.Robinhood embraces a diversity of backgrounds and experiences and provides equal opportunity for all applicants\nand employees. We are dedicated to building a company that represents a variety of backgrounds, perspectives, and\nskills. We believe that the more inclusive we are, the better our work (and work environment) will be for everyone.\nAdditionally, Robinhood provides reasonable accommodations for candidates on request and respects applicants' privacy\nrights. To review Robinhood's Privacy Policy please review the specific policy applicable to your region: Canada\nApplicant Privacy Policy / UK/EEA Applicant Privacy Policy / US Applicant Privacy Policy",
        "location": null,
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Financial Services",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "education_level": null,
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-robinhood-\n3737638667?refId=bBU5TqxCxwdiQdibF%2FBcSA%3D%3D&trackingId=EmU628%2BkX1W1D7%2BAfk2iBQ%3D%3D&position=12&pageNum=0"
    },
    {
        "title": null,
        "company": null,
        "description": "Role: Data Engineer (DE)Location: Scottsdale AZ (day 1 onsite)Duration: Fulltime Must have skill set: Java, Scala,\nPython, Spark, S3, Glue, RedshiftYou have 6-8 years of relevant software development experience. You have hands-on\nexperience in Java/Scala/Python, Spark, S3, Glue, Redshift. This is critical. Highly analytical and data oriented.\nExperience in SQL, NoSql Database Data masking of on prem PII data. Develop API calls with using secure data transfer.\nTake standard output data to lower environments for pre prod testing! Enable secured channels for data models and data\nscience activities. Need a solution that can scale to handle millions of data. i.e., masking 10 million records in 15\nmins You have experience with development tools and agile methodologies.",
        "location": null,
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Human Resources Services",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "education_level": null,
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-de-at-zortech-\nsolutions-3778562998?refId=KiOufBohy9Hx7d%2BO7QPHXA%3D%3D&trackingId=TquPEs8zhIG1V1kl1c9XcA%3D%3D&position=13&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "The Walt Disney Company",
        "description": "About The Role & TeamJoin the Data Engineering team within the Disney Decision Science + Integration (DDSI) organization\nat The Walt Disney Company. We support clients within Disney Experiences which include Parks & Resorts both domestic and\ninternational, Consumer Products and Disney Signature Experiences as well as the Disney Entertainment segment which\ninclude Studios Content (Disney Theatrical Group), General Entertainment Content, and ESPN and Sports Content.We use\ntechnology, data analytics, optimization, statistical and econometric modeling to explore opportunities, shape business\ndecisions and drive business value.As a member of the Data Engineering team you will be responsible for partnering with\nDecision Science Products, Decision Science, Client and Technology team members on various development and sustainment\nprojects, ad-hoc requests, prototyping and research initiatives by providing data pipeline and database engineering\nservices.As a Data Engineer you will work on projects such as Adventures by Disney (AbD), VIP Tours, Resort Inventory\nOptimization (RIO), and several upcoming initiatives. In this position, the candidate will have tasks to develop,\nimplement, improve and support our solutions. The work will involve various data engineering activities throughout the\nproject SDLC.What You Will DoWork assignments may cover activities such as participation in data requirements gathering,\nsource-to-target mapping, develop and maintaining ELT data pipelines, data quality monitoring, producing input datasets\nfor science models and visualizations and Batch/Orchestration job scheduling. In addition to technical abilities, the\nrole is responsible for understanding the business domain and processes, then applying that knowledge to the assigned\nwork. This role communicates data engineering progress to the project leadership team, and actively participates in\nmeetings and discussions.Required Qualifications & SkillsMinimum 3 years of related work experienceExperience with\nELT/ETL data pipeline development and maintenanceExpertise using Python and SQLAbility to showcase an understanding of\none or more business domainsPrior experience gathering data requirements and producing data design solutionsExperience\nwith developing in a multi environment (Dev, QA, Prod, etc.) and DevOps procedures for code\ndeployment/promotionExperience crafting and building relational databases (preferably in Postgres or\nSnowflake)Experience leading and deploying code using a source control product such as GitLab/GitHubAble to formulate\nsolutions and communicate sophisticated technical concepts to non-technical team membersPreferred\nQualificationsKnowledgeable with theme park attendance, reservations and/or productsShowed strength interacting with\nAPI’sExperience with data orchestration tools such as Apache AirflowKnowledgeable on cloud architecture and product\nofferings, preferably AWSExperience using containerization technologies such as Docker or KubernetesEducationBachelor’s\ndegree in Computer Science, Mathematics, Engineering or related field preferred/or equivalent work experienceMaster’s\ndegree preferred Computer Science, Mathematics, Engineering or related field preferred",
        "location": "Not specified",
        "salary": "Not specified",
        "job_function": "Information Technology",
        "industries": "Entertainment Providers",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "education_level": "Bachelor’s degree in Computer Science, Mathematics, Engineering or related field preferred/or equivalent work experience",
        "notes": "",
        "hiring_manager": "Not specified",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-the-walt-disney-\ncompany-3764137624?refId=kYTn7fN4pmu2wMuvUKnT5A%3D%3D&trackingId=VguVaswmI6u%2BZqTm2nY9Rg%3D%3D&position=12&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Fusemachines",
        "description": "About FusemachinesFusemachines is a leading AI strategy, talent, and education services provider. Founded by Sameer\nMaskey Ph.D., Adjunct Associate Professor at Columbia University, Fusemachines has a core mission of democratizing AI.\nWith a presence in 4 countries (Nepal, United States, Canada, and Dominican Republic and more than 350 full-time\nemployees) Fusemachines seeks to bring its global expertise in AI to transform companies around the world.About the\nrole:This is a remote, 6 months contract role, with a possibility of extension, responsible for designing, building, and\nmaintaining the infrastructure required for data integration, storage, processing, and analytics (BI, visualization and\nAdvanced Analytics). Working in the Financial sector and implementing cyber-security use cases.Salary Range:\nUS$7000/monthJob Type: 1099 ContractStart Date: The contract for this position is scheduled to begin in January\n2024Qualification / Skill Set Requirement:3+ years of real-world data engineering development experience in Snowflake\nand AWS (certifications preferred)Proven experience as a Snowflake Developer, with a strong understanding of Snowflake\narchitecture and concepts.Proficient in snowflake services such as snowpipe, stages, stored procedures, views,\nmaterialized views, tasks and streams.Must have previous experience working with security datasetsStrong programming\nskills in SQL, with proficiency in writing efficient and optimized code for data integration, storage, processing, and\nmanipulation.Robust understanding of data partitioning and other optimization techniques in Snowflake.Knowledge of data\nsecurity measures in Snowflake, including role-based access control (RBAC) and data encryption.Highly skilled in one or\nmore languages such as Python, Scala, and proficient in writing efficient and optimized code for data integration,\nstorage, processing and manipulation.Strong knowledge of SDLC tools and technologies, including project management\nsoftware (Jira or similar), source code management (GitHub or similar), CI/CD system (GitHub actions, AWS CodeBuild or\nsimilar) and binary repository manager (AWS CodeArtifact or similar).Skilled in Data Integration from different sources\nsuch as APIs, databases, flat files, event streaming.Good understanding of Data Modeling and Database Design Principles.\nBeing able to design and implement efficient database schemas that meet the requirements of the data architecture to\nsupport data solutions.Strong experience in working with ELT and ETL tools and being able to develop custom integration\nsolutions as needed.Strong experience with scalable and distributed Data Technologies such as Spark/PySpark, DBT and\nKafka, to be able to handle large volumes of data.Strong experience in designing and implementing Data Warehousing\nsolutions in AWS with RedShift. Demonstrated experience in designing and implementing efficient ELT/ETL processes that\nextract data from source systems, transform it (DBT), and load it into the data warehouse.Strong experience in\nOrchestration using Apache Airflow.Expert in Cloud Computing in AWS, including deep knowledge of a variety of AWS\nservices like Lambda, Kinesis, S3, Lake Formation, EC2, ECS/ECR, IAM, CloudWatch, Redshift, etcGood understanding of\nData Quality and Governance, including implementation of data quality checks and monitoring processes to ensure that\ndata is accurate, complete, and consistent.Good Problem-Solving skills: being able to troubleshoot data processing\npipelines and identify performance bottlenecks and other issues.Responsibilities:Follow established design, constructed\ndata architectures. Developing and maintaining data pipelines, ensuring data flows smoothly from source to destination.\nHandle ELT processes, including data extraction, loading, transformation and load data from various sources into\nSnowflake.Ensure the reliability, scalability, and efficiency of data systems are maintained at all timesAssist in the\nconfiguration and management of Snowflake data warehousing and data lake solutions, working under the guidance of senior\nteam members.Collaborate closely with cross-functional teams including Product, Engineering, Data Scientists, and\nAnalysts to thoroughly understand data requirements and provide data engineering support.Contribute to data quality\nassurance efforts, such as implementing data validation checks and tests.Evaluate and implement cutting-edge\ntechnologies and continue learning and expanding skills in data engineering and cloud platforms.Develop, design, and\nexecute data governance strategies encompassing cataloging, lineage tracking, quality control, and data governance\nframeworks that align with current analytics demands and industry best practicesDocument data engineering processes and\ndata flows.Care about architecture, observability, testing, and building reliable infrastructure and data\npipelines.Takes ownership of storage layer, SQL database management tasks, including schema design, indexing, and\nperformance tuning.Swiftly address and resolve complex data engineering issues, incidents and resolve bottlenecks in SQL\nqueries and database operations.Assess best practices and design schemas that matches business needs for delivering a\nmodern analytics solution (descriptive, diagnostic, predictive, prescriptive)Be an active member of our Agile team,\nparticipating in all ceremonies and continuous improvement activities.Equal Opportunity Employer: Race, Color, Religion,\nSex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran\nStatus, or any other legally protected group status.Powered by JazzHRshDrx201iX",
        "location": "Remote",
        "salary": "US$7000/month",
        "job_function": "Information Technology",
        "industries": "Internet Publishing",
        "employment_type": "Contract",
        "seniority_level": "Mid-Senior level",
        "education_level": "Bachelor's degree or higher",
        "notes": "",
        "hiring_manager": "Not specified",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-\nfusemachines-3733596267?refId=H4EGkXNa5BoDzVIjuvwgQQ%3D%3D&trackingId=jdsRPwewKyf6qO0kdmsIyA%3D%3D&position=24&pageNum=0"
    },
    {
        "title": "Big Data Engineer",
        "company": "Walgreens Boots Alliance",
        "description": "Job SummaryBuilds & maintains big data pipelines to support advanced analytics and data science solutions. Identifies\nvaluable internal and external data. Collaborates closely with data scientists to define data for the design,\ndevelopment, and deployment of new solutions that support business priorities.Job Responsibilities Develops software\nthat processes, stores and serves data for use by others.Develops data structures and pipelines to organize, collect and\nstandardize data that helps generate insights and addresses reporting needs.Writes ETL (Extract / Transform / Load)\nprocesses, designs database systems and develops tools for real-time and offline analytic processing.Develops data\npipelines that are scalable, repeatable and secure.Troubleshoots software and processes for data consistency and\nintegrity. Integrates data from a variety of sources, assuring that they adhere to data quality and accessibility\nstandards.Effectively resolves problems and roadblocks as they occur.Interacts with internal and external peers and/or\nmanagers to exchange semi-complex information related to assigned activities.About Walgreens and WBAWalgreens\n(www.walgreens.com) is included in the U.S. Retail Pharmacy and U.S. Healthcare segments of Walgreens Boots Alliance,\nInc. (Nasdaq: WBA), an integrated healthcare, pharmacy and retail leader with a 170 year heritage of caring for\ncommunities. WBA’s purpose is to create more joyful lives through better health. Operating nearly 9,000 retail locations\nacross America, Puerto Rico and the U.S. Virgin Islands, Walgreens is proud to be a neighborhood health destination\nserving nearly 10 million customers each day. Walgreens pharmacists play a critical role in the U.S. healthcare system\nby providing a wide range of pharmacy and healthcare services, including those that drive equitable access to care for\nthe nation’s medically underserved populations. To best meet the needs of customers and patients, Walgreens offers a\ntrue omnichannel experience, with fully integrated physical and digital platforms supported by the latest technology to\ndeliver high quality products and services in communities nationwide.Basic QualificationsBachelor's degree and at least\n2 years of experience in data engineering; OR Graduate Degree in a technical discipline.Advanced knowledge of\nSQLExperience establishing and maintaining key relationships with internal (peers, business partners and leadership) and\nexternal (business community, clients and vendors) within a matrix organization to ensure quality standards for\nservice.Experience analyzing and reporting data in order to identify issues, trends, or exceptions to drive improvement\nof results and find solutions.Willing to travel up to 10% of the time for business purposes (within state and out of\nstate).Preferred QualificationsGraduate Degree in a technical disciplineExperience with REST API developmentExperience\nwith Azure application deploymentExperience in Azure technologies like Azure Data Factory, Azure Databricks using Python\nor Scala, App Services, Azure Data Lake, Azure Functions, Event Hubs, Event Grids and Logic AppExperience in building\nAzure DevOPS pipelines to enable CI/CD, Infrastructure as Code (Iaas), and automation.",
        "location": "United States",
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Wellness and Fitness Services, Pharmaceutical Manufacturing, and Retail",
        "employment_type": "Full-time",
        "seniority_level": "Not Applicable",
        "education_level": "Bachelor's degree or Graduate Degree",
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-talend-at-\nwalgreens-3763922227?refId=kYTn7fN4pmu2wMuvUKnT5A%3D%3D&trackingId=btU3t4yNj0B8Zkzff%2BRRGw%3D%3D&position=7&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Dollar General Corporation",
        "description": "Dollar General Corporation has been delivering value to shoppers for more than 80 years. Dollar General helps shoppers\nSave time. Save money. Every day.® by offering products that are frequently used and replenished, such as food, snacks,\nhealth and beauty aids, cleaning supplies, basic apparel, housewares and seasonal items at everyday low prices in\nconvenient neighborhood locations. Dollar General operates more than 18,000 stores in 47 states, and we’re still\ngrowing. Learn more about Dollar General at www.dollargeneral.com.General Summary Dollar General Corporation has been\ndelivering value to shoppers for more than 80 years. Dollar General helps shoppers Save time. Save money. Every day.® by\noffering products that are frequently used and replenished, such as food, snacks, health and beauty aids, cleaning\nsupplies, basic apparel, housewares and seasonal items at everyday low prices in convenient neighborhood locations.\nDollar General operates more than 18,000 stores in 47 states, and we’re still growing. Learn more about Dollar General\nat www.dollargeneral.com.Duties & Responsibilities Advanced working SQL knowledge and experience working with relational\ndatabases, query authoring (SQL) as well as working familiarity with a variety of databases.Assemble large, complex data\nsets that meet functional / non-functional business requirements.Identify, design, and implement internal process\nimprovements automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability,\netc.Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of\ndata sources using SQL and cloud technologies.Build analytics tools that utilize the data pipelines to provide\nactionable insights into customer acquisition, operational efficiency and other key business performance metrics.Work\nwith stakeholders including the Product, Data and Design teams to assist with data-related technical issues and support\ntheir data infrastructure needs.Knowledge, Skills and Abilities Knowledge of programming languages (e.g. Java and\nPython)Hands-on experience with SQL database designGreat numerical and analytical skillsDegree in Computer Science, IT,\nor similar field; a Master’s is a plusData engineering certification (e.g IBM Certified Data Engineer) is a\nplusExperience with big data tools Hadoop, Spark, Kafka, etc.Experience with relational SQL and NoSQL databases,\nincluding Postgres and Cassandra.Experience with data pipeline and workflow management tools Azkaban, Luigi, Airflow,\netc.Experience with Snowflake/Azure cloud services EC2, EMR, RDS, RedshiftExperience with stream-processing systems\nStorm, Spark-Streaming, etc.Experience with object-oriented/object function scripting languages Python, Java, C++,\nScala, etcWork Experience &/or Education Degree in information technology or computer science with additional vendor-\nspecific certification.BS or MS degree in Computer Science or a related technical field4+ years of Python or Java\ndevelopment experience4+ years of SQL experience (No-SQL experience is a plus)4+ years of experience with schema design\nand dimensional data modelingAbility in managing and communicating data warehouse plans to internal clientsExperience\ndesigning, building, and maintaining data processing systemsExperience working with a cloud platform such as Snowflake /\nAzure or Databricks#mogul#",
        "location": "Multiple locations",
        "salary": "Not specified",
        "job_function": "Information Technology",
        "industries": "Retail",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "education_level": "Degree in Computer Science, IT, or similar field; a Master’s is a plus",
        "notes": "",
        "hiring_manager": "Not specified",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-dollar-\ngeneral-3745487485?refId=HSbYYR67Af9HPAndWNdraw%3D%3D&trackingId=8cUSpUH4%2FQQ%2Bepd1eTKbmA%3D%3D&position=22&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Robinhood",
        "description": "Join a leading fintech company that’s democratizing finance for all.Robinhood was founded on a simple idea: that our\nfinancial markets should be accessible to all. With customers at the heart of our decisions, Robinhood is lowering\nbarriers and providing greater access to financial information. Together, we are building products and services that\nhelp create a financial system everyone can participate in.As we continue to build...We’re seeking curious, growth\nminded thinkers to help shape our vision, structures and systems; playing a key-role as we launch into our ambitious\nfuture. If you’re invigorated by our mission, values, and drive to change the world — we’d love to have you apply.About\nthe team + role Robinhood is a metrics driven company and data is foundational to all key decisions from growth strategy\nto product optimization to our day-to-day operations. We are looking for a Data Engineer to build and maintain\nfoundational datasets that will allow us to reliably and efficiently power decision making at Robinhood. These datasets\ninclude application events, database snapshots, and the derived datasets that describe and track Robinhood's key metrics\nacross all products. You’ll partner closely with engineers, data scientists and business teams to power analytics,\nexperimentation, and machine learning use cases. We are a fast-paced team in a fast growing company and this is a unique\nopportunity to help lay the foundation for reliable, impactful, data-driven decisions across the company for years to\ncome.The role is located in the office location(s) listed on this job description which will align with our in-office\nworking environment. Please connect with your recruiter for more information regarding our in-office philosophy and\nexpectations.What You’ll DoHelp define and build key datasets across all Robinhood product areas. Lead the evolution of\nthese datasets as use cases grow.Build scalable data pipelines using Python, Spark and Airflow to move data from\ndifferent applications into our data lake.Partner with upstream engineering teams to enhance data generation\npatterns.Partner with data consumers across Robinhood to understand consumption patterns and design intuitive data\nmodels.Ideate and contribute to shared data engineering tooling and standards.Define and promote data engineering best\npractices across the company.What You Bring4+ years of professional experience building end-to-end data pipelinesProven\nability to implement software engineering-caliber code (preferably Python)Expert at building and maintaining large-scale\ndata pipelines using open source frameworks (Spark, Flink, etc)Strong SQL (Presto, Spark SQL, etc) skills.Experience\nsolving problems across the data stack (Data Infrastructure, Analytics and Visualization platforms)Expert collaborator\nwith the ability to democratize data through actionable insights and solutions.What We OfferMarket competitive and pay\nequity-focused compensation structure100% paid health insurance for employees with 90% coverage for dependentsAnnual\nlifestyle wallet for personal wellness, learning and development, and more!Lifetime maximum benefit for family forming\nand fertility benefitsDedicated mental health support for employees and eligible dependentsGenerous time away including\ncompany holidays, paid time off, sick time, parental leave, and more!Lively office environment with catered meals, fully\nstocked kitchens, and geo-specific commuter benefitsBase pay for the successful applicant will depend on a variety of\njob-related factors, which may include education, training, experience, location, business needs, or market demands. The\nexpected salary range for this role is based on the location where the work will be performed and is aligned to one of 3\ncompensation zones. This role is also eligible to participate in a Robinhood bonus plan and Robinhood’s equity plan. For\nother locations not listed, compensation can be discussed with your recruiter during the interview process.US Zone 1:\n$157000 - $185000Menlo Park, CA; New York, NY; Seattle, WA; Washington, DCUS Zone 2: $139000 - $163000Denver, CO;\nWestlake, TX; Chicago, ILUS Zone 3: $122000 - $144000Lake Mary, FLClick Here To Learn More About Robinhood’s\nBenefits.We’re looking for more growth-minded and collaborative people to be a part of our journey in democratizing\nfinance for all. If you’re ready to give 100% in helping us achieve our mission—we’d love to have you apply even if you\nfeel unsure about whether you meet every single requirement in this posting. At Robinhood, we're looking for people\ninvigorated by our mission, values, and drive to change the world, not just those who simply check off all the\nboxes.Robinhood embraces a diversity of backgrounds and experiences and provides equal opportunity for all applicants\nand employees. We are dedicated to building a company that represents a variety of backgrounds, perspectives, and\nskills. We believe that the more inclusive we are, the better our work (and work environment) will be for everyone.\nAdditionally, Robinhood provides reasonable accommodations for candidates on request and respects applicants' privacy\nrights. To review Robinhood's Privacy Policy please review the specific policy applicable to your region: Canada\nApplicant Privacy Policy / UK/EEA Applicant Privacy Policy / US Applicant Privacy Policy",
        "location": "Menlo Park, CA; New York, NY; Seattle, WA; Washington, DC",
        "salary": "$157000 - $185000 (US Zone 1)",
        "job_function": "Information Technology",
        "industries": "Financial Services",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "education_level": "Not specified",
        "notes": "",
        "hiring_manager": "Not specified",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-\nrobinhood-3737638667?refId=yYkaI0G4nwepPxFJ3klj8A%3D%3D&trackingId=DrjxJR14LDNCVyIpeek8Ew%3D%3D&position=12&pageNum=0"
    },
    {
        "title": null,
        "company": null,
        "description": "We KPIT (www.kpit.com) are a global technologies company specializing in CASE (Connected, Autonomous, Shared, Electric)\ndomains. Systems and Software in Electric & Conventional Powertrain, Autonomous Driving & ADAS, Digital Connected\nSolutions, Connected Vehicles, Vehicle Diagnostics, and Vehicle Networks.Join the leading software development and\nintegration team helping mobility leapfrog towards a clean, smart, and safe future. A company specializing in embedded\nsoftware, AI, and digital solutions, KPIT accelerates clients’ implementation of next-generation\ntechnologies.Responsibilities:Develop and maintain ETL (Extract, Transform, Load) processes for efficient data\nintegration.Able to design and implement database schemas and write queries to retrieve and manipulate data.Build and\noptimize efficient data pipelines and architectures.Ensure data availability, integrity, and security.Using scripting\nlanguages (e.g., Python, Bash) for automation of data workflows and processes.Implementing containerization (e.g.,\nDocker) and orchestration tools (e.g., Kubernetes) for efficient deployment and management of data\napplications.Collaborate with data scientists, analysts, and other stakeholders to understand data\nrequirements.Requirements:Bachelor’s/master’s degree.Experience in data engineer role.Proficiency in designing and\nimplementing ETL processes to move and transform data (e.g., extracting data, data cleaning, joining data).Proficient in\nat least one programming language, such as Python, Java, or Scala.Proficiency in using SQL for data querying and\nmanipulation.Good understanding of database systems, both relational and NoSQL.Good understanding of data warehousing\nand big data technologies, such as Hadoop, Spark, and Kafka, Amazon Redshift, Google BigQuery.Knowledge on Apache Spark\nand PySpark.Familiarity with AWS/Azure/GCP Cloud platform.Familiar with concepts such as scalability, fault tolerance,\nand load balancing.Good understanding of continuous integration/continuous delivery (CI/CD).Knowledge of\ncontainerization (e.g., Docker) and orchestration tools (e.g., Kubernetes).",
        "location": null,
        "salary": null,
        "job_function": "Engineering",
        "industries": "Motor Vehicle Manufacturing",
        "employment_type": "Full-time",
        "seniority_level": "Associate",
        "education_level": null,
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-\nkpit-3763812955?refId=hUqfFzzrGisp%2F7qdM%2BRWqw%3D%3D&trackingId=D492S2sfIwf%2BFv5HaIH9iw%3D%3D&position=25&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Rockstar Games",
        "description": "At Rockstar Games, we create world-class entertainment experiences.A career at Rockstar Games is about being part of a\nteam working on some of the most creatively rewarding and ambitious projects to be found in any entertainment medium.\nYou would be welcomed to a dedicated and inclusive environment where you can learn, and collaborate with some of the\nmost talented people in the industry.Rockstar is seeking a Data Engineer to join a team focused on building a cutting-\nedge game analytics platform and tools to better understand our players and enhance their experience in our games. This\nis a full-time permanent position based out of Rockstar’s unique game development studio in Andover, MA.The ideal\ncandidate will be skilled in developing complex ingestion and transformation processes with an emphasis on reliability\nand performance. In collaboration with other data engineers, machine learning engineers, and software engineers, the\ncandidate will empower the team of analysts and data scientists to deliver data driven insights and applications to\ncompany stakeholders.What We DoThe Rockstar Analytics team provide insights and actionable results to a wide variety of\nstakeholders across the organization in support of their decision making.We are currently adding team members to\nmultiple verticals including; Machine Learning and Game Data Pipeline.ResponsibilitiesImplement and maintain real-time\nand batch Data Models.Deliver real-time and non-real-time data models to analysts and data scientists who create\ninsights and analytics applications for our stakeholders.Implement and support streaming technologies such as Kafka,\nSpark, Cassandra & AzureML.Assist in the development of deployment automation and operational support strategies.Assist\nin the development of a big data platform in Hadoop using pipeline technologies such as Spark, Airflow, and more to\nsupport a variety of requirements and applications.Set the standards for warehouse and schema design in massively\nparallel processing engines such as Hadoop and Snowflake while collaborating with analysts and data scientist in the\ncreation of efficient data models.Maintain and extend our CI/CD processes and documentation.Qualifications3+ years of\nwork experience with data modeling, business intelligence and machine learning on big data architectures.2+ years of\nexperience with the Hadoop ecosystem (HDFS, Spark, Oozie, Impala, etc.) and big data ecosystems (Kafka, Cassandra,\netc.).2+ years of experience with the Azure ecosystem (Azure ML, Azure Data Factory) Expert in at least one SQL language\nsuch as T-SQL or PL/SQL.Experience developing and managing data warehouses on a terabyte or petabyte scale.Strong\nexperience in massively parallel processing & columnar databases.Experience building Real-Time and/or Near-Real-Time ML\npipelines.Experience with Python, Scala, or Java.Experience with shell scripting.Experience working in a Linux\nenvironment.SkillsDeep understanding of advanced data warehousing concepts and track record of applying these concepts\non the job.Ability to manage numerous projects concurrently and strategically, prioritizing when necessary.Good\ncommunication skills.Dynamic team player.A passion for technology.PLUSESPlease note that these are desirable skills and\nare not required to apply for the position.Experience with Python based libraries such as Scikit-Learn Experience with\nDatabricksExperience with Spark-ML, Jupyter Notebook, AzureML.Experience in Lambda architecture.Experience with\nCI/CD.Familiar with Restful APIs.Experience with Artifact Repositories.Knowledge of the video game industry.How To\nApplyPlease apply with a resume and cover letter demonstrating how you meet the skills above. If we would like to move\nforward with your application, a Rockstar recruiter will reach out to you to explain next steps and guide you through\nthe process.Rockstar is proud to be an equal opportunity employer, and we are committed to hiring, promoting, and\ncompensating employees based on their qualifications and demonstrated ability to perform job responsibilities.If you’ve\ngot the right skills for the job, we want to hear from you. We encourage applications from all suitable candidates\nregardless of age, disability, gender identity, sexual orientation, religion, belief, or race.",
        "location": "Andover, MA",
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Computer Games",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "education_level": null,
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-rockstar-\ngames-3719384994?refId=Qozz%2FEQHEt%2Bj9JDO9K3q4g%3D%3D&trackingId=8MfWTydoSdyfsJ8%2BswgGnw%3D%3D&position=23&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "KPIT",
        "description": "We KPIT (www.kpit.com) are a global technologies company specializing in CASE (Connected, Autonomous, Shared, Electric)\ndomains. Systems and Software in Electric & Conventional Powertrain, Autonomous Driving & ADAS, Digital Connected\nSolutions, Connected Vehicles, Vehicle Diagnostics, and Vehicle Networks.Join the leading software development and\nintegration team helping mobility leapfrog towards a clean, smart, and safe future. A company specializing in embedded\nsoftware, AI, and digital solutions, KPIT accelerates clients’ implementation of next-generation\ntechnologies.Responsibilities:Develop and maintain ETL (Extract, Transform, Load) processes for efficient data\nintegration.Able to design and implement database schemas and write queries to retrieve and manipulate data.Build and\noptimize efficient data pipelines and architectures.Ensure data availability, integrity, and security.Using scripting\nlanguages (e.g., Python, Bash) for automation of data workflows and processes.Implementing containerization (e.g.,\nDocker) and orchestration tools (e.g., Kubernetes) for efficient deployment and management of data\napplications.Collaborate with data scientists, analysts, and other stakeholders to understand data\nrequirements.Requirements:Bachelor’s/master’s degree.Experience in data engineer role.Proficiency in designing and\nimplementing ETL processes to move and transform data (e.g., extracting data, data cleaning, joining data).Proficient in\nat least one programming language, such as Python, Java, or Scala.Proficiency in using SQL for data querying and\nmanipulation.Good understanding of database systems, both relational and NoSQL.Good understanding of data warehousing\nand big data technologies, such as Hadoop, Spark, and Kafka, Amazon Redshift, Google BigQuery.Knowledge on Apache Spark\nand PySpark.Familiarity with AWS/Azure/GCP Cloud platform.Familiar with concepts such as scalability, fault tolerance,\nand load balancing.Good understanding of continuous integration/continuous delivery (CI/CD).Knowledge of\ncontainerization (e.g., Docker) and orchestration tools (e.g., Kubernetes).",
        "location": "Global",
        "salary": null,
        "job_function": "Engineering",
        "industries": "Motor Vehicle Manufacturing",
        "employment_type": "Full-time",
        "seniority_level": "Associate",
        "education_level": "Bachelor's/master's degree",
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-\nkpit-3763812955?refId=ld9q3KSO2a4lEIsngwp2vg%3D%3D&trackingId=ojBezkTsmyIdCf6gozJH2g%3D%3D&position=18&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Rockstar Games",
        "description": "At Rockstar Games, we create world-class entertainment experiences.A career at Rockstar Games is about being part of a\nteam working on some of the most creatively rewarding and ambitious projects to be found in any entertainment medium.\nYou would be welcomed to a dedicated and inclusive environment where you can learn, and collaborate with some of the\nmost talented people in the industry.Rockstar is seeking a Data Engineer to join a team focused on building a cutting-\nedge game analytics platform and tools to better understand our players and enhance their experience in our games. This\nis a full-time permanent position based out of Rockstar’s unique game development studio in Andover, MA.The ideal\ncandidate will be skilled in developing complex ingestion and transformation processes with an emphasis on reliability\nand performance. In collaboration with other data engineers, machine learning engineers, and software engineers, the\ncandidate will empower the team of analysts and data scientists to deliver data driven insights and applications to\ncompany stakeholders.What We DoThe Rockstar Analytics team provide insights and actionable results to a wide variety of\nstakeholders across the organization in support of their decision making.We are currently adding team members to\nmultiple verticals including; Machine Learning and Game Data Pipeline.ResponsibilitiesImplement and maintain real-time\nand batch Data Models.Deliver real-time and non-real-time data models to analysts and data scientists who create\ninsights and analytics applications for our stakeholders.Implement and support streaming technologies such as Kafka,\nSpark, Cassandra & AzureML.Assist in the development of deployment automation and operational support strategies.Assist\nin the development of a big data platform in Hadoop using pipeline technologies such as Spark, Airflow, and more to\nsupport a variety of requirements and applications.Set the standards for warehouse and schema design in massively\nparallel processing engines such as Hadoop and Snowflake while collaborating with analysts and data scientist in the\ncreation of efficient data models.Maintain and extend our CI/CD processes and documentation.Qualifications3+ years of\nwork experience with data modeling, business intelligence and machine learning on big data architectures.2+ years of\nexperience with the Hadoop ecosystem (HDFS, Spark, Oozie, Impala, etc.) and big data ecosystems (Kafka, Cassandra,\netc.).2+ years of experience with the Azure ecosystem (Azure ML, Azure Data Factory) Expert in at least one SQL language\nsuch as T-SQL or PL/SQL.Experience developing and managing data warehouses on a terabyte or petabyte scale.Strong\nexperience in massively parallel processing & columnar databases.Experience building Real-Time and/or Near-Real-Time ML\npipelines.Experience with Python, Scala, or Java.Experience with shell scripting.Experience working in a Linux\nenvironment.SkillsDeep understanding of advanced data warehousing concepts and track record of applying these concepts\non the job.Ability to manage numerous projects concurrently and strategically, prioritizing when necessary.Good\ncommunication skills.Dynamic team player.A passion for technology.PLUSESPlease note that these are desirable skills and\nare not required to apply for the position.Experience with Python based libraries such as Scikit-Learn Experience with\nDatabricksExperience with Spark-ML, Jupyter Notebook, AzureML.Experience in Lambda architecture.Experience with\nCI/CD.Familiar with Restful APIs.Experience with Artifact Repositories.Knowledge of the video game industry.How To\nApplyPlease apply with a resume and cover letter demonstrating how you meet the skills above. If we would like to move\nforward with your application, a Rockstar recruiter will reach out to you to explain next steps and guide you through\nthe process.Rockstar is proud to be an equal opportunity employer, and we are committed to hiring, promoting, and\ncompensating employees based on their qualifications and demonstrated ability to perform job responsibilities.If you’ve\ngot the right skills for the job, we want to hear from you. We encourage applications from all suitable candidates\nregardless of age, disability, gender identity, sexual orientation, religion, belief, or race.",
        "location": "Andover, MA",
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Computer Games",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "education_level": null,
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-rockstar-\ngames-3719384994?refId=yYkaI0G4nwepPxFJ3klj8A%3D%3D&trackingId=Y5DeKd40cjMWYEYpZoURMg%3D%3D&position=23&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Walgreens Boots Alliance",
        "description": "Job SummaryBuilds & maintains big data pipelines to support advanced analytics and data science solutions. Identifies\nvaluable internal and external data. Collaborates closely with data scientists to define data for the design,\ndevelopment, and deployment of new solutions that support business priorities.Job Responsibilities Develops software\nthat processes, stores and serves data for use by others.Develops data structures and pipelines to organize, collect and\nstandardize data that helps generate insights and addresses reporting needs.Writes ETL (Extract / Transform / Load)\nprocesses, designs database systems and develops tools for real-time and offline analytic processing.Develops data\npipelines that are scalable, repeatable and secure.Troubleshoots software and processes for data consistency and\nintegrity. Integrates data from a variety of sources, assuring that they adhere to data quality and accessibility\nstandards.Effectively resolves problems and roadblocks as they occur.Interacts with internal and external peers and/or\nmanagers to exchange semi-complex information related to assigned activities.About Walgreens and WBAWalgreens\n(www.walgreens.com) is included in the U.S. Retail Pharmacy and U.S. Healthcare segments of Walgreens Boots Alliance,\nInc. (Nasdaq: WBA), an integrated healthcare, pharmacy and retail leader with a 170 year heritage of caring for\ncommunities. WBA’s purpose is to create more joyful lives through better health. Operating nearly 9,000 retail locations\nacross America, Puerto Rico and the U.S. Virgin Islands, Walgreens is proud to be a neighborhood health destination\nserving nearly 10 million customers each day. Walgreens pharmacists play a critical role in the U.S. healthcare system\nby providing a wide range of pharmacy and healthcare services, including those that drive equitable access to care for\nthe nation’s medically underserved populations. To best meet the needs of customers and patients, Walgreens offers a\ntrue omnichannel experience, with fully integrated physical and digital platforms supported by the latest technology to\ndeliver high quality products and services in communities nationwide.Basic QualificationsBachelor's degree and at least\n2 years of experience in data engineering; OR Graduate Degree in a technical discipline.Advanced knowledge of\nSQLExperience establishing and maintaining key relationships with internal (peers, business partners and leadership) and\nexternal (business community, clients and vendors) within a matrix organization to ensure quality standards for\nservice.Experience analyzing and reporting data in order to identify issues, trends, or exceptions to drive improvement\nof results and find solutions.Willing to travel up to 10% of the time for business purposes (within state and out of\nstate).Preferred QualificationsGraduate Degree in a technical disciplineExperience with REST API developmentExperience\nwith Azure application deploymentExperience in Azure technologies like Azure Data Factory, Azure Databricks using Python\nor Scala, App Services, Azure Data Lake, Azure Functions, Event Hubs, Event Grids and Logic AppExperience in building\nAzure DevOPS pipelines to enable CI/CD, Infrastructure as Code (Iaas), and automation.",
        "location": "United States",
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Wellness and Fitness Services, Pharmaceutical Manufacturing, and Retail",
        "employment_type": "Full-time",
        "seniority_level": "Not Applicable",
        "education_level": "Bachelor's degree and at least 2 years of experience in data engineering; OR Graduate Degree in a technical discipline",
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-talend-at-\nwalgreens-3763922227?refId=aFcZ88nEiCcHRqBjOx4uqw%3D%3D&trackingId=70skYnyoHnyfClky50Zqkg%3D%3D&position=7&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Robinhood",
        "description": "Join a leading fintech company that’s democratizing finance for all.Robinhood was founded on a simple idea: that our\nfinancial markets should be accessible to all. With customers at the heart of our decisions, Robinhood is lowering\nbarriers and providing greater access to financial information. Together, we are building products and services that\nhelp create a financial system everyone can participate in.As we continue to build...We’re seeking curious, growth\nminded thinkers to help shape our vision, structures and systems; playing a key-role as we launch into our ambitious\nfuture. If you’re invigorated by our mission, values, and drive to change the world — we’d love to have you apply.About\nthe team + role Robinhood is a metrics driven company and data is foundational to all key decisions from growth strategy\nto product optimization to our day-to-day operations. We are looking for a Data Engineer to build and maintain\nfoundational datasets that will allow us to reliably and efficiently power decision making at Robinhood. These datasets\ninclude application events, database snapshots, and the derived datasets that describe and track Robinhood's key metrics\nacross all products. You’ll partner closely with engineers, data scientists and business teams to power analytics,\nexperimentation, and machine learning use cases. We are a fast-paced team in a fast growing company and this is a unique\nopportunity to help lay the foundation for reliable, impactful, data-driven decisions across the company for years to\ncome.The role is located in the office location(s) listed on this job description which will align with our in-office\nworking environment. Please connect with your recruiter for more information regarding our in-office philosophy and\nexpectations.What You’ll DoHelp define and build key datasets across all Robinhood product areas. Lead the evolution of\nthese datasets as use cases grow.Build scalable data pipelines using Python, Spark and Airflow to move data from\ndifferent applications into our data lake.Partner with upstream engineering teams to enhance data generation\npatterns.Partner with data consumers across Robinhood to understand consumption patterns and design intuitive data\nmodels.Ideate and contribute to shared data engineering tooling and standards.Define and promote data engineering best\npractices across the company.What You Bring4+ years of professional experience building end-to-end data pipelinesProven\nability to implement software engineering-caliber code (preferably Python)Expert at building and maintaining large-scale\ndata pipelines using open source frameworks (Spark, Flink, etc)Strong SQL (Presto, Spark SQL, etc) skills.Experience\nsolving problems across the data stack (Data Infrastructure, Analytics and Visualization platforms)Expert collaborator\nwith the ability to democratize data through actionable insights and solutions.What We OfferMarket competitive and pay\nequity-focused compensation structure100% paid health insurance for employees with 90% coverage for dependentsAnnual\nlifestyle wallet for personal wellness, learning and development, and more!Lifetime maximum benefit for family forming\nand fertility benefitsDedicated mental health support for employees and eligible dependentsGenerous time away including\ncompany holidays, paid time off, sick time, parental leave, and more!Lively office environment with catered meals, fully\nstocked kitchens, and geo-specific commuter benefitsBase pay for the successful applicant will depend on a variety of\njob-related factors, which may include education, training, experience, location, business needs, or market demands. The\nexpected salary range for this role is based on the location where the work will be performed and is aligned to one of 3\ncompensation zones. This role is also eligible to participate in a Robinhood bonus plan and Robinhood’s equity plan. For\nother locations not listed, compensation can be discussed with your recruiter during the interview process.US Zone 1:\n$157000 - $185000Menlo Park, CA; New York, NY; Seattle, WA; Washington, DCUS Zone 2: $139000 - $163000Denver, CO;\nWestlake, TX; Chicago, ILUS Zone 3: $122000 - $144000Lake Mary, FLClick Here To Learn More About Robinhood’s\nBenefits.We’re looking for more growth-minded and collaborative people to be a part of our journey in democratizing\nfinance for all. If you’re ready to give 100% in helping us achieve our mission—we’d love to have you apply even if you\nfeel unsure about whether you meet every single requirement in this posting. At Robinhood, we're looking for people\ninvigorated by our mission, values, and drive to change the world, not just those who simply check off all the\nboxes.Robinhood embraces a diversity of backgrounds and experiences and provides equal opportunity for all applicants\nand employees. We are dedicated to building a company that represents a variety of backgrounds, perspectives, and\nskills. We believe that the more inclusive we are, the better our work (and work environment) will be for everyone.\nAdditionally, Robinhood provides reasonable accommodations for candidates on request and respects applicants' privacy\nrights. To review Robinhood's Privacy Policy please review the specific policy applicable to your region: Canada\nApplicant Privacy Policy / UK/EEA Applicant Privacy Policy / US Applicant Privacy Policy",
        "location": "Menlo Park, CA; New York, NY; Seattle, WA; Washington, DC",
        "salary": "$157000 - $185000",
        "job_function": "Information Technology",
        "industries": "Financial Services",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "education_level": "Not specified",
        "notes": "",
        "hiring_manager": "Not specified",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-\nrobinhood-3737638667?refId=aFcZ88nEiCcHRqBjOx4uqw%3D%3D&trackingId=yMRQG0%2FEWArUbngnOgEf9Q%3D%3D&position=14&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "KPIT",
        "description": "We KPIT (www.kpit.com) are a global technologies company specializing in CASE (Connected, Autonomous, Shared, Electric)\ndomains. Systems and Software in Electric & Conventional Powertrain, Autonomous Driving & ADAS, Digital Connected\nSolutions, Connected Vehicles, Vehicle Diagnostics, and Vehicle Networks.Join the leading software development and\nintegration team helping mobility leapfrog towards a clean, smart, and safe future. A company specializing in embedded\nsoftware, AI, and digital solutions, KPIT accelerates clients’ implementation of next-generation\ntechnologies.Responsibilities:Develop and maintain ETL (Extract, Transform, Load) processes for efficient data\nintegration.Able to design and implement database schemas and write queries to retrieve and manipulate data.Build and\noptimize efficient data pipelines and architectures.Ensure data availability, integrity, and security.Using scripting\nlanguages (e.g., Python, Bash) for automation of data workflows and processes.Implementing containerization (e.g.,\nDocker) and orchestration tools (e.g., Kubernetes) for efficient deployment and management of data\napplications.Collaborate with data scientists, analysts, and other stakeholders to understand data\nrequirements.Requirements:Bachelor’s/master’s degree.Experience in data engineer role.Proficiency in designing and\nimplementing ETL processes to move and transform data (e.g., extracting data, data cleaning, joining data).Proficient in\nat least one programming language, such as Python, Java, or Scala.Proficiency in using SQL for data querying and\nmanipulation.Good understanding of database systems, both relational and NoSQL.Good understanding of data warehousing\nand big data technologies, such as Hadoop, Spark, and Kafka, Amazon Redshift, Google BigQuery.Knowledge on Apache Spark\nand PySpark.Familiarity with AWS/Azure/GCP Cloud platform.Familiar with concepts such as scalability, fault tolerance,\nand load balancing.Good understanding of continuous integration/continuous delivery (CI/CD).Knowledge of\ncontainerization (e.g., Docker) and orchestration tools (e.g., Kubernetes).",
        "location": "Global",
        "salary": null,
        "job_function": "Engineering",
        "industries": "Motor Vehicle Manufacturing",
        "employment_type": "Full-time",
        "seniority_level": "Associate",
        "education_level": "Bachelor’s/master’s degree",
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-\nkpit-3763812955?refId=b6qNTI3myDV%2FxeyC4CXYqQ%3D%3D&trackingId=zkQlez8ughzmf5HgswuhNw%3D%3D&position=24&pageNum=0"
    },
    {
        "title": null,
        "company": null,
        "description": "Data EngineerSierra has been asked by a large risk management and intelligence services firm to identify a Data Engineer\nto join their staff. You'll play a critical role in designing, building, and maintaining thier dark web and open-source\ndata repositories, search applications, and APIs. Will also work closely with a cross-functional team to improve and\nmaintain the reliability, scalability, and performance of these tools and technologies.PAY: 150K plus 10% bonus, great\nbenefits. No sponsorship available.LOCATION: Hybrid remote/in-office in downtown Chicago (2-3 dayds per week). Chicago\narea applicants only - no third parties please.ResponsibilitiesDesign and develop scalable search applications to enable\nefficient data retrieval and indexing from the deep and dark web.Work with internal and external stakeholders to\noptimize data infrastructure and identify cost savings, where possible.Build and maintain data pipelines to ingest,\ntransform, and process large volumes of open, deep, and dark web data from diverse sources.Develop and maintain API\nendpoints for querying dark web data, ensuring efficient and reliable access to our systems.Monitor and optimize search\nperformance, address bottlenecks, and implement enhancementsImplement data quality and validation measures to ensure\naccuracy and integrity of indexed data.Identify and integrate optimal database solutions.QualificationsExpertise in data\nmodeling, infrastructure design, and data integration to enhance thier dataBachelor's or Master's degree in Computer\nScience, Data Science, or a related field.Proficiency in working with large-scale data processing frameworks, especially\nElasticsearchSolid understanding of data modeling and schema design principles for efficient search and\nretrievalFamiliarity with open source intelligence (OSINT) and/or dark web intelligence collection and/or\nprocessesExperience with API development and management, including authentication, versioning, and performance\noptimizationProven experience as a Data Engineer, preferably in the development and management of search engines and\nAPIsDemonstrated knowledge of cloud platforms, especially AWS and AzureExcellent communication and collaboration skills\nto work effectively in a cross-functional team environmentFamiliarity with building CI/CD pipelines to ensure the\ndelivery of high-quality softwareKnowledge of data privacy and security considerations when working with sensitive\ndataStrong programming skills in Python",
        "location": null,
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Information Services",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "education_level": null,
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-chicago-165k-at-sierra-\nits-3676932344?refId=H4EGkXNa5BoDzVIjuvwgQQ%3D%3D&trackingId=X3ida1yMn1m3eaHyyV5d%2Fw%3D%3D&position=9&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Robinhood",
        "description": "Join a leading fintech company that’s democratizing finance for all.Robinhood was founded on a simple idea: that our\nfinancial markets should be accessible to all. With customers at the heart of our decisions, Robinhood is lowering\nbarriers and providing greater access to financial information. Together, we are building products and services that\nhelp create a financial system everyone can participate in.As we continue to build...We’re seeking curious, growth\nminded thinkers to help shape our vision, structures and systems; playing a key-role as we launch into our ambitious\nfuture. If you’re invigorated by our mission, values, and drive to change the world — we’d love to have you apply.About\nthe team + role Robinhood is a metrics driven company and data is foundational to all key decisions from growth strategy\nto product optimization to our day-to-day operations. We are looking for a Data Engineer to build and maintain\nfoundational datasets that will allow us to reliably and efficiently power decision making at Robinhood. These datasets\ninclude application events, database snapshots, and the derived datasets that describe and track Robinhood's key metrics\nacross all products. You’ll partner closely with engineers, data scientists and business teams to power analytics,\nexperimentation, and machine learning use cases. We are a fast-paced team in a fast growing company and this is a unique\nopportunity to help lay the foundation for reliable, impactful, data-driven decisions across the company for years to\ncome.The role is located in the office location(s) listed on this job description which will align with our in-office\nworking environment. Please connect with your recruiter for more information regarding our in-office philosophy and\nexpectations.What You’ll DoHelp define and build key datasets across all Robinhood product areas. Lead the evolution of\nthese datasets as use cases grow.Build scalable data pipelines using Python, Spark and Airflow to move data from\ndifferent applications into our data lake.Partner with upstream engineering teams to enhance data generation\npatterns.Partner with data consumers across Robinhood to understand consumption patterns and design intuitive data\nmodels.Ideate and contribute to shared data engineering tooling and standards.Define and promote data engineering best\npractices across the company.What You Bring4+ years of professional experience building end-to-end data pipelinesProven\nability to implement software engineering-caliber code (preferably Python)Expert at building and maintaining large-scale\ndata pipelines using open source frameworks (Spark, Flink, etc)Strong SQL (Presto, Spark SQL, etc) skills.Experience\nsolving problems across the data stack (Data Infrastructure, Analytics and Visualization platforms)Expert collaborator\nwith the ability to democratize data through actionable insights and solutions.What We OfferMarket competitive and pay\nequity-focused compensation structure100% paid health insurance for employees with 90% coverage for dependentsAnnual\nlifestyle wallet for personal wellness, learning and development, and more!Lifetime maximum benefit for family forming\nand fertility benefitsDedicated mental health support for employees and eligible dependentsGenerous time away including\ncompany holidays, paid time off, sick time, parental leave, and more!Lively office environment with catered meals, fully\nstocked kitchens, and geo-specific commuter benefitsBase pay for the successful applicant will depend on a variety of\njob-related factors, which may include education, training, experience, location, business needs, or market demands. The\nexpected salary range for this role is based on the location where the work will be performed and is aligned to one of 3\ncompensation zones. This role is also eligible to participate in a Robinhood bonus plan and Robinhood’s equity plan. For\nother locations not listed, compensation can be discussed with your recruiter during the interview process.US Zone 1:\n$157000 - $185000Menlo Park, CA; New York, NY; Seattle, WA; Washington, DCUS Zone 2: $139000 - $163000Denver, CO;\nWestlake, TX; Chicago, ILUS Zone 3: $122000 - $144000Lake Mary, FLClick Here To Learn More About Robinhood’s\nBenefits.We’re looking for more growth-minded and collaborative people to be a part of our journey in democratizing\nfinance for all. If you’re ready to give 100% in helping us achieve our mission—we’d love to have you apply even if you\nfeel unsure about whether you meet every single requirement in this posting. At Robinhood, we're looking for people\ninvigorated by our mission, values, and drive to change the world, not just those who simply check off all the\nboxes.Robinhood embraces a diversity of backgrounds and experiences and provides equal opportunity for all applicants\nand employees. We are dedicated to building a company that represents a variety of backgrounds, perspectives, and\nskills. We believe that the more inclusive we are, the better our work (and work environment) will be for everyone.\nAdditionally, Robinhood provides reasonable accommodations for candidates on request and respects applicants' privacy\nrights. To review Robinhood's Privacy Policy please review the specific policy applicable to your region: Canada\nApplicant Privacy Policy / UK/EEA Applicant Privacy Policy / US Applicant Privacy Policy",
        "location": "Menlo Park, CA; New York, NY; Seattle, WA; Washington, DC",
        "salary": "$157000 - $185000",
        "job_function": "Information Technology",
        "industries": "Financial Services",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "education_level": "Not specified",
        "notes": "",
        "hiring_manager": "Not specified",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-\nrobinhood-3737638667?refId=1j12dYfGDaJUMcjoDEzPUg%3D%3D&trackingId=48le4rYYpSeUp36tCgUvag%3D%3D&position=14&pageNum=0"
    },
    {
        "title": null,
        "company": null,
        "description": "RemoteData Engineer12+ MonthsDevelop and maintain SQL scripts, stored procedures, and queries to extract and manipulate\ndata from various sources, including MSSQL and Postgres databases.Work with MuleSoft (Mule) for data integration and API\ndevelopment, if required or willing to learn it.Monitor and optimize data pipelines, troubleshoot issues, and ensure\ndata integrity and performance.Collaborate with data analysts to understand data requirements and support their data\nanalysis and modeling efforts.Stay up to date with industry trends, best practices, and emerging technologies related to\ndata engineering, Snowflake, ETL, SQL, and related tools.Solid understanding and hands-on experience with ETL tools and\nframeworks.Excellent communication and collaboration skills to work effectively with cross-functional teams.",
        "location": null,
        "salary": null,
        "job_function": "Information Technology",
        "industries": "IT Services and IT Consulting",
        "employment_type": "Contract",
        "seniority_level": "Mid-Senior level",
        "education_level": null,
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-accroid-\ninc-3778553874?refId=aFcZ88nEiCcHRqBjOx4uqw%3D%3D&trackingId=1RxhaiMT1K42HsWKAmuF8A%3D%3D&position=18&pageNum=0"
    },
    {
        "title": null,
        "company": null,
        "description": "Role: Data Engineer (DE)Location: Scottsdale AZ (day 1 onsite)Duration: Fulltime Must have skill set: Java, Scala,\nPython, Spark, S3, Glue, RedshiftYou have 6-8 years of relevant software development experience. You have hands-on\nexperience in Java/Scala/Python, Spark, S3, Glue, Redshift. This is critical. Highly analytical and data oriented.\nExperience in SQL, NoSql Database Data masking of on prem PII data. Develop API calls with using secure data transfer.\nTake standard output data to lower environments for pre prod testing! Enable secured channels for data models and data\nscience activities. Need a solution that can scale to handle millions of data. i.e., masking 10 million records in 15\nmins You have experience with development tools and agile methodologies.",
        "location": null,
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Human Resources Services",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "education_level": null,
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-de-at-zortech-\nsolutions-3778562998?refId=WmSwrt9r4vRYmFNoHaH%2B9w%3D%3D&trackingId=X6qJV7owOU6fzGrbdrZCfA%3D%3D&position=14&pageNum=0"
    },
    {
        "title": "Big Data Engineer",
        "company": "Walgreens",
        "description": "Job SummaryBuilds & maintains big data pipelines to support advanced analytics and data science solutions. Identifies\nvaluable internal and external data. Collaborates closely with data scientists to define data for the design,\ndevelopment, and deployment of new solutions that support business priorities.Job Responsibilities Develops software\nthat processes, stores and serves data for use by others.Develops data structures and pipelines to organize, collect and\nstandardize data that helps generate insights and addresses reporting needs.Writes ETL (Extract / Transform / Load)\nprocesses, designs database systems and develops tools for real-time and offline analytic processing.Develops data\npipelines that are scalable, repeatable and secure.Troubleshoots software and processes for data consistency and\nintegrity. Integrates data from a variety of sources, assuring that they adhere to data quality and accessibility\nstandards.Effectively resolves problems and roadblocks as they occur.Interacts with internal and external peers and/or\nmanagers to exchange semi-complex information related to assigned activities.About Walgreens and WBAWalgreens\n(www.walgreens.com) is included in the U.S. Retail Pharmacy and U.S. Healthcare segments of Walgreens Boots Alliance,\nInc. (Nasdaq: WBA), an integrated healthcare, pharmacy and retail leader with a 170 year heritage of caring for\ncommunities. WBA’s purpose is to create more joyful lives through better health. Operating nearly 9,000 retail locations\nacross America, Puerto Rico and the U.S. Virgin Islands, Walgreens is proud to be a neighborhood health destination\nserving nearly 10 million customers each day. Walgreens pharmacists play a critical role in the U.S. healthcare system\nby providing a wide range of pharmacy and healthcare services, including those that drive equitable access to care for\nthe nation’s medically underserved populations. To best meet the needs of customers and patients, Walgreens offers a\ntrue omnichannel experience, with fully integrated physical and digital platforms supported by the latest technology to\ndeliver high quality products and services in communities nationwide.Basic QualificationsBachelor's degree and at least\n2 years of experience in data engineering; OR Graduate Degree in a technical discipline.Advanced knowledge of\nSQLExperience establishing and maintaining key relationships with internal (peers, business partners and leadership) and\nexternal (business community, clients and vendors) within a matrix organization to ensure quality standards for\nservice.Experience analyzing and reporting data in order to identify issues, trends, or exceptions to drive improvement\nof results and find solutions.Willing to travel up to 10% of the time for business purposes (within state and out of\nstate).Preferred QualificationsGraduate Degree in a technical disciplineExperience with REST API developmentExperience\nwith Azure application deploymentExperience in Azure technologies like Azure Data Factory, Azure Databricks using Python\nor Scala, App Services, Azure Data Lake, Azure Functions, Event Hubs, Event Grids and Logic AppExperience in building\nAzure DevOPS pipelines to enable CI/CD, Infrastructure as Code (Iaas), and automation.",
        "location": "United States",
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Wellness and Fitness Services, Pharmaceutical Manufacturing, and Retail",
        "employment_type": "Full-time",
        "seniority_level": "Not Applicable",
        "education_level": "Bachelor's degree",
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-talend-at-\nwalgreens-3763922227?refId=1j12dYfGDaJUMcjoDEzPUg%3D%3D&trackingId=44G8c4yT3ZC6EKGpcEKYMQ%3D%3D&position=6&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Dollar General Corporation",
        "description": "Dollar General Corporation has been delivering value to shoppers for more than 80 years. Dollar General helps shoppers\nSave time. Save money. Every day.® by offering products that are frequently used and replenished, such as food, snacks,\nhealth and beauty aids, cleaning supplies, basic apparel, housewares and seasonal items at everyday low prices in\nconvenient neighborhood locations. Dollar General operates more than 18,000 stores in 47 states, and we’re still\ngrowing. Learn more about Dollar General at www.dollargeneral.com.General Summary Dollar General Corporation has been\ndelivering value to shoppers for more than 80 years. Dollar General helps shoppers Save time. Save money. Every day.® by\noffering products that are frequently used and replenished, such as food, snacks, health and beauty aids, cleaning\nsupplies, basic apparel, housewares and seasonal items at everyday low prices in convenient neighborhood locations.\nDollar General operates more than 18,000 stores in 47 states, and we’re still growing. Learn more about Dollar General\nat www.dollargeneral.com.Duties & Responsibilities Advanced working SQL knowledge and experience working with relational\ndatabases, query authoring (SQL) as well as working familiarity with a variety of databases.Assemble large, complex data\nsets that meet functional / non-functional business requirements.Identify, design, and implement internal process\nimprovements automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability,\netc.Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of\ndata sources using SQL and cloud technologies.Build analytics tools that utilize the data pipelines to provide\nactionable insights into customer acquisition, operational efficiency and other key business performance metrics.Work\nwith stakeholders including the Product, Data and Design teams to assist with data-related technical issues and support\ntheir data infrastructure needs.Knowledge, Skills and Abilities Knowledge of programming languages (e.g. Java and\nPython)Hands-on experience with SQL database designGreat numerical and analytical skillsDegree in Computer Science, IT,\nor similar field; a Master’s is a plusData engineering certification (e.g IBM Certified Data Engineer) is a\nplusExperience with big data tools Hadoop, Spark, Kafka, etc.Experience with relational SQL and NoSQL databases,\nincluding Postgres and Cassandra.Experience with data pipeline and workflow management tools Azkaban, Luigi, Airflow,\netc.Experience with Snowflake/Azure cloud services EC2, EMR, RDS, RedshiftExperience with stream-processing systems\nStorm, Spark-Streaming, etc.Experience with object-oriented/object function scripting languages Python, Java, C++,\nScala, etcWork Experience &/or Education Degree in information technology or computer science with additional vendor-\nspecific certification.BS or MS degree in Computer Science or a related technical field4+ years of Python or Java\ndevelopment experience4+ years of SQL experience (No-SQL experience is a plus)4+ years of experience with schema design\nand dimensional data modelingAbility in managing and communicating data warehouse plans to internal clientsExperience\ndesigning, building, and maintaining data processing systemsExperience working with a cloud platform such as Snowflake /\nAzure or Databricks#mogul#",
        "location": "47 states",
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Retail",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "education_level": "Degree in Computer Science, IT, or similar field; a Master’s is a plus",
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-dollar-\ngeneral-3745487485?refId=b6qNTI3myDV%2FxeyC4CXYqQ%3D%3D&trackingId=5P1KGcROKZ8q%2FeFwlbfevg%3D%3D&position=22&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Dollar General Corporation",
        "description": "Dollar General Corporation has been delivering value to shoppers for more than 80 years. Dollar General helps shoppers\nSave time. Save money. Every day.® by offering products that are frequently used and replenished, such as food, snacks,\nhealth and beauty aids, cleaning supplies, basic apparel, housewares and seasonal items at everyday low prices in\nconvenient neighborhood locations. Dollar General operates more than 18,000 stores in 47 states, and we’re still\ngrowing. Learn more about Dollar General at www.dollargeneral.com.General Summary Dollar General Corporation has been\ndelivering value to shoppers for more than 80 years. Dollar General helps shoppers Save time. Save money. Every day.® by\noffering products that are frequently used and replenished, such as food, snacks, health and beauty aids, cleaning\nsupplies, basic apparel, housewares and seasonal items at everyday low prices in convenient neighborhood locations.\nDollar General operates more than 18,000 stores in 47 states, and we’re still growing. Learn more about Dollar General\nat www.dollargeneral.com.Duties & Responsibilities Advanced working SQL knowledge and experience working with relational\ndatabases, query authoring (SQL) as well as working familiarity with a variety of databases.Assemble large, complex data\nsets that meet functional / non-functional business requirements.Identify, design, and implement internal process\nimprovements automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability,\netc.Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of\ndata sources using SQL and cloud technologies.Build analytics tools that utilize the data pipelines to provide\nactionable insights into customer acquisition, operational efficiency and other key business performance metrics.Work\nwith stakeholders including the Product, Data and Design teams to assist with data-related technical issues and support\ntheir data infrastructure needs.Knowledge, Skills and Abilities Knowledge of programming languages (e.g. Java and\nPython)Hands-on experience with SQL database designGreat numerical and analytical skillsDegree in Computer Science, IT,\nor similar field; a Master’s is a plusData engineering certification (e.g IBM Certified Data Engineer) is a\nplusExperience with big data tools Hadoop, Spark, Kafka, etc.Experience with relational SQL and NoSQL databases,\nincluding Postgres and Cassandra.Experience with data pipeline and workflow management tools Azkaban, Luigi, Airflow,\netc.Experience with Snowflake/Azure cloud services EC2, EMR, RDS, RedshiftExperience with stream-processing systems\nStorm, Spark-Streaming, etc.Experience with object-oriented/object function scripting languages Python, Java, C++,\nScala, etcWork Experience &/or Education Degree in information technology or computer science with additional vendor-\nspecific certification.BS or MS degree in Computer Science or a related technical field4+ years of Python or Java\ndevelopment experience4+ years of SQL experience (No-SQL experience is a plus)4+ years of experience with schema design\nand dimensional data modelingAbility in managing and communicating data warehouse plans to internal clientsExperience\ndesigning, building, and maintaining data processing systemsExperience working with a cloud platform such as Snowflake /\nAzure or Databricks#mogul#",
        "location": "Unknown",
        "salary": "",
        "job_function": "Information Technology",
        "industries": "Retail",
        "employment_type": "Full-time",
        "seniority_level": "Entry level",
        "education_level": "BS or MS degree in Computer Science or a related technical field",
        "notes": "",
        "hiring_manager": "Unknown",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-dollar-\ngeneral-3745487485?refId=hUqfFzzrGisp%2F7qdM%2BRWqw%3D%3D&trackingId=EDnB5bsHYH8wOkto1smLPw%3D%3D&position=23&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Remote",
        "description": "RemoteData Engineer12+ MonthsDevelop and maintain SQL scripts, stored procedures, and queries to extract and manipulate\ndata from various sources, including MSSQL and Postgres databases.Work with MuleSoft (Mule) for data integration and API\ndevelopment, if required or willing to learn it.Monitor and optimize data pipelines, troubleshoot issues, and ensure\ndata integrity and performance.Collaborate with data analysts to understand data requirements and support their data\nanalysis and modeling efforts.Stay up to date with industry trends, best practices, and emerging technologies related to\ndata engineering, Snowflake, ETL, SQL, and related tools.Solid understanding and hands-on experience with ETL tools and\nframeworks.Excellent communication and collaboration skills to work effectively with cross-functional teams.",
        "location": "N/A",
        "salary": "N/A",
        "job_function": "Information Technology",
        "industries": "IT Services and IT Consulting",
        "employment_type": "Contract",
        "seniority_level": "Mid-Senior level",
        "education_level": "N/A",
        "notes": "",
        "hiring_manager": "N/A",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-at-accroid-\ninc-3778553874?refId=1j12dYfGDaJUMcjoDEzPUg%3D%3D&trackingId=SppvIQdh651pbFpJ9dN%2Baw%3D%3D&position=19&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Large risk management and intelligence services firm",
        "description": "Data EngineerSierra has been asked by a large risk management and intelligence services firm to identify a Data Engineer\nto join their staff. You'll play a critical role in designing, building, and maintaining thier dark web and open-source\ndata repositories, search applications, and APIs. Will also work closely with a cross-functional team to improve and\nmaintain the reliability, scalability, and performance of these tools and technologies.PAY: 150K plus 10% bonus, great\nbenefits. No sponsorship available.LOCATION: Hybrid remote/in-office in downtown Chicago (2-3 dayds per week). Chicago\narea applicants only - no third parties please.ResponsibilitiesDesign and develop scalable search applications to enable\nefficient data retrieval and indexing from the deep and dark web.Work with internal and external stakeholders to\noptimize data infrastructure and identify cost savings, where possible.Build and maintain data pipelines to ingest,\ntransform, and process large volumes of open, deep, and dark web data from diverse sources.Develop and maintain API\nendpoints for querying dark web data, ensuring efficient and reliable access to our systems.Monitor and optimize search\nperformance, address bottlenecks, and implement enhancementsImplement data quality and validation measures to ensure\naccuracy and integrity of indexed data.Identify and integrate optimal database solutions.QualificationsExpertise in data\nmodeling, infrastructure design, and data integration to enhance thier dataBachelor's or Master's degree in Computer\nScience, Data Science, or a related field.Proficiency in working with large-scale data processing frameworks, especially\nElasticsearchSolid understanding of data modeling and schema design principles for efficient search and\nretrievalFamiliarity with open source intelligence (OSINT) and/or dark web intelligence collection and/or\nprocessesExperience with API development and management, including authentication, versioning, and performance\noptimizationProven experience as a Data Engineer, preferably in the development and management of search engines and\nAPIsDemonstrated knowledge of cloud platforms, especially AWS and AzureExcellent communication and collaboration skills\nto work effectively in a cross-functional team environmentFamiliarity with building CI/CD pipelines to ensure the\ndelivery of high-quality softwareKnowledge of data privacy and security considerations when working with sensitive\ndataStrong programming skills in Python",
        "location": "Hybrid remote/in-office in downtown Chicago (2-3 days per week)",
        "salary": "150K plus 10% bonus",
        "job_function": "Information Technology",
        "industries": "Information Services",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "education_level": "Bachelor's or Master's degree in Computer Science, Data Science, or a related field",
        "notes": "",
        "hiring_manager": "Sierra",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-chicago-165k-at-sierra-\nits-3676932344?refId=b6qNTI3myDV%2FxeyC4CXYqQ%3D%3D&trackingId=%2B42U4u%2BdpmKZbY7rPinjQg%3D%3D&position=9&pageNum=0"
    },
    {
        "title": "Big Data Engineer",
        "company": "Walgreens",
        "description": "Job SummaryBuilds & maintains big data pipelines to support advanced analytics and data science solutions. Identifies\nvaluable internal and external data. Collaborates closely with data scientists to define data for the design,\ndevelopment, and deployment of new solutions that support business priorities.Job Responsibilities Develops software\nthat processes, stores and serves data for use by others.Develops data structures and pipelines to organize, collect and\nstandardize data that helps generate insights and addresses reporting needs.Writes ETL (Extract / Transform / Load)\nprocesses, designs database systems and develops tools for real-time and offline analytic processing.Develops data\npipelines that are scalable, repeatable and secure.Troubleshoots software and processes for data consistency and\nintegrity. Integrates data from a variety of sources, assuring that they adhere to data quality and accessibility\nstandards.Effectively resolves problems and roadblocks as they occur.Interacts with internal and external peers and/or\nmanagers to exchange semi-complex information related to assigned activities.About Walgreens and WBAWalgreens\n(www.walgreens.com) is included in the U.S. Retail Pharmacy and U.S. Healthcare segments of Walgreens Boots Alliance,\nInc. (Nasdaq: WBA), an integrated healthcare, pharmacy and retail leader with a 170 year heritage of caring for\ncommunities. WBA’s purpose is to create more joyful lives through better health. Operating nearly 9,000 retail locations\nacross America, Puerto Rico and the U.S. Virgin Islands, Walgreens is proud to be a neighborhood health destination\nserving nearly 10 million customers each day. Walgreens pharmacists play a critical role in the U.S. healthcare system\nby providing a wide range of pharmacy and healthcare services, including those that drive equitable access to care for\nthe nation’s medically underserved populations. To best meet the needs of customers and patients, Walgreens offers a\ntrue omnichannel experience, with fully integrated physical and digital platforms supported by the latest technology to\ndeliver high quality products and services in communities nationwide.Basic QualificationsBachelor's degree and at least\n2 years of experience in data engineering; OR Graduate Degree in a technical discipline.Advanced knowledge of\nSQLExperience establishing and maintaining key relationships with internal (peers, business partners and leadership) and\nexternal (business community, clients and vendors) within a matrix organization to ensure quality standards for\nservice.Experience analyzing and reporting data in order to identify issues, trends, or exceptions to drive improvement\nof results and find solutions.Willing to travel up to 10% of the time for business purposes (within state and out of\nstate).Preferred QualificationsGraduate Degree in a technical disciplineExperience with REST API developmentExperience\nwith Azure application deploymentExperience in Azure technologies like Azure Data Factory, Azure Databricks using Python\nor Scala, App Services, Azure Data Lake, Azure Functions, Event Hubs, Event Grids and Logic AppExperience in building\nAzure DevOPS pipelines to enable CI/CD, Infrastructure as Code (Iaas), and automation.",
        "location": "United States",
        "salary": "Not specified",
        "job_function": "Information Technology",
        "industries": "Wellness and Fitness Services, Pharmaceutical Manufacturing, and Retail",
        "employment_type": "Full-time",
        "seniority_level": "Not Applicable",
        "education_level": "Bachelor's degree and at least 2 years of experience in data engineering; OR Graduate Degree in a technical discipline",
        "notes": "",
        "hiring_manager": "Not specified",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-talend-at-\nwalgreens-3763922227?refId=H4EGkXNa5BoDzVIjuvwgQQ%3D%3D&trackingId=ezN2KRZT9QclvcgbDIcQDg%3D%3D&position=7&pageNum=0"
    },
    {
        "title": null,
        "company": null,
        "description": "Data EngineerSierra has been asked by a large risk management and intelligence services firm to identify a Data Engineer\nto join their staff. You'll play a critical role in designing, building, and maintaining thier dark web and open-source\ndata repositories, search applications, and APIs. Will also work closely with a cross-functional team to improve and\nmaintain the reliability, scalability, and performance of these tools and technologies.PAY: 150K plus 10% bonus, great\nbenefits. No sponsorship available.LOCATION: Hybrid remote/in-office in downtown Chicago (2-3 dayds per week). Chicago\narea applicants only - no third parties please.ResponsibilitiesDesign and develop scalable search applications to enable\nefficient data retrieval and indexing from the deep and dark web.Work with internal and external stakeholders to\noptimize data infrastructure and identify cost savings, where possible.Build and maintain data pipelines to ingest,\ntransform, and process large volumes of open, deep, and dark web data from diverse sources.Develop and maintain API\nendpoints for querying dark web data, ensuring efficient and reliable access to our systems.Monitor and optimize search\nperformance, address bottlenecks, and implement enhancementsImplement data quality and validation measures to ensure\naccuracy and integrity of indexed data.Identify and integrate optimal database solutions.QualificationsExpertise in data\nmodeling, infrastructure design, and data integration to enhance thier dataBachelor's or Master's degree in Computer\nScience, Data Science, or a related field.Proficiency in working with large-scale data processing frameworks, especially\nElasticsearchSolid understanding of data modeling and schema design principles for efficient search and\nretrievalFamiliarity with open source intelligence (OSINT) and/or dark web intelligence collection and/or\nprocessesExperience with API development and management, including authentication, versioning, and performance\noptimizationProven experience as a Data Engineer, preferably in the development and management of search engines and\nAPIsDemonstrated knowledge of cloud platforms, especially AWS and AzureExcellent communication and collaboration skills\nto work effectively in a cross-functional team environmentFamiliarity with building CI/CD pipelines to ensure the\ndelivery of high-quality softwareKnowledge of data privacy and security considerations when working with sensitive\ndataStrong programming skills in Python",
        "location": null,
        "salary": null,
        "job_function": "Information Technology",
        "industries": "Information Services",
        "employment_type": "Full-time",
        "seniority_level": "Mid-Senior level",
        "education_level": null,
        "notes": "",
        "hiring_manager": null,
        "url": "https://www.linkedin.com/jobs/view/data-engineer-chicago-165k-at-sierra-\nits-3676932344?refId=yYkaI0G4nwepPxFJ3klj8A%3D%3D&trackingId=NT%2BfDfWBbmZyxzADGU5gOA%3D%3D&position=9&pageNum=0"
    },
    {
        "title": "Data Engineer I",
        "company": "N/A",
        "description": "Title:Data Engineer I, Req# 27194964Location:Cupertino,CA(Hybrid)Contract: 12+ MonthJob Description Develop data\nautomation tool for collection, processing, and storing lab data. Set up, maintain, and monitor continuous operation\nclient devices in labs. Develop test scripts for various client devices. Maintain software revisions through GitHub.\nBuild ETL for telemetry field dataset and automate data integrity and optimization routines for automatic reporting,\nanalysis, and error detection. Analyze user and experimental data and use engineering and analytical understanding to\nresolve battery problems. Provide ad-hoc analysis as necessary.Qualifications 1+ years of experience in software\nengineering/data science engineering. Proficient in Python for data processing and analysis tool development. Proficient\nin Linux/Unix (Bash and Shell). Proficient in C for software development Proficient in revision control software such as\nGitHub. Strong working knowledge in designing, building, and maintaining data ETL pipeline. Experience in SQL.\nExperience in database modeling and data warehousing principles. Familiarity with job scheduling system. Experience in\ndata science and analytics, statistical analyses, A/B testing and conducting experiments and investigations in large-\nscale usage data environment. Self-started with a proven ability to handle multiple tasks with strict deadlines. Proven\ncreativity to go beyond current tools to deliver best solution to the problem. Outstanding problem solving, critical\nthinking and interpersonal skills.PayRate: $50-55/hr, W2",
        "location": "Cupertino, CA (Hybrid)",
        "salary": "$50-55/hr, W2",
        "job_function": "Information Technology",
        "industries": "Staffing and Recruiting",
        "employment_type": "Contract",
        "seniority_level": "Entry level",
        "education_level": "N/A",
        "notes": "",
        "hiring_manager": "N/A",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-i-at-\nwinmax-3759969537?refId=hUqfFzzrGisp%2F7qdM%2BRWqw%3D%3D&trackingId=fc7ljrtnNK8OoFCegA2m%2BA%3D%3D&position=16&pageNum=0"
    },
    {
        "title": "Data Engineer",
        "company": "Walgreens",
        "description": "Job SummaryBuilds & maintains big data pipelines to support advanced analytics and data science solutions. Identifies\nvaluable internal and external data. Collaborates closely with data scientists to define data for the design,\ndevelopment, and deployment of new solutions that support business priorities.Job Responsibilities Develops software\nthat processes, stores and serves data for use by others.Develops data structures and pipelines to organize, collect and\nstandardize data that helps generate insights and addresses reporting needs.Writes ETL (Extract / Transform / Load)\nprocesses, designs database systems and develops tools for real-time and offline analytic processing.Develops data\npipelines that are scalable, repeatable and secure.Troubleshoots software and processes for data consistency and\nintegrity. Integrates data from a variety of sources, assuring that they adhere to data quality and accessibility\nstandards.Effectively resolves problems and roadblocks as they occur.Interacts with internal and external peers and/or\nmanagers to exchange semi-complex information related to assigned activities.About Walgreens and WBAWalgreens\n(www.walgreens.com) is included in the U.S. Retail Pharmacy and U.S. Healthcare segments of Walgreens Boots Alliance,\nInc. (Nasdaq: WBA), an integrated healthcare, pharmacy and retail leader with a 170 year heritage of caring for\ncommunities. WBA’s purpose is to create more joyful lives through better health. Operating nearly 9,000 retail locations\nacross America, Puerto Rico and the U.S. Virgin Islands, Walgreens is proud to be a neighborhood health destination\nserving nearly 10 million customers each day. Walgreens pharmacists play a critical role in the U.S. healthcare system\nby providing a wide range of pharmacy and healthcare services, including those that drive equitable access to care for\nthe nation’s medically underserved populations. To best meet the needs of customers and patients, Walgreens offers a\ntrue omnichannel experience, with fully integrated physical and digital platforms supported by the latest technology to\ndeliver high quality products and services in communities nationwide.Basic QualificationsBachelor's degree and at least\n2 years of experience in data engineering; OR Graduate Degree in a technical discipline.Advanced knowledge of\nSQLExperience establishing and maintaining key relationships with internal (peers, business partners and leadership) and\nexternal (business community, clients and vendors) within a matrix organization to ensure quality standards for\nservice.Experience analyzing and reporting data in order to identify issues, trends, or exceptions to drive improvement\nof results and find solutions.Willing to travel up to 10% of the time for business purposes (within state and out of\nstate).Preferred QualificationsGraduate Degree in a technical disciplineExperience with REST API developmentExperience\nwith Azure application deploymentExperience in Azure technologies like Azure Data Factory, Azure Databricks using Python\nor Scala, App Services, Azure Data Lake, Azure Functions, Event Hubs, Event Grids and Logic AppExperience in building\nAzure DevOPS pipelines to enable CI/CD, Infrastructure as Code (Iaas), and automation.",
        "location": "Undefined",
        "salary": "Not specified",
        "job_function": "Information Technology",
        "industries": "Wellness and Fitness Services, Pharmaceutical Manufacturing, and Retail",
        "employment_type": "Full-time",
        "seniority_level": "Not Applicable",
        "education_level": "Bachelor's degree, Graduate Degree in a technical discipline",
        "notes": "",
        "hiring_manager": "Undefined",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-talend-at-\nwalgreens-3763922227?refId=HSbYYR67Af9HPAndWNdraw%3D%3D&trackingId=rrondlgUtZg1nVDt2BGMQw%3D%3D&position=6&pageNum=0"
    },
    {
        "title": "Data Engineer I",
        "company": "Unknown",
        "description": "Title:Data Engineer I, Req# 27194964Location:Cupertino,CA(Hybrid)Contract: 12+ MonthJob Description Develop data\nautomation tool for collection, processing, and storing lab data. Set up, maintain, and monitor continuous operation\nclient devices in labs. Develop test scripts for various client devices. Maintain software revisions through GitHub.\nBuild ETL for telemetry field dataset and automate data integrity and optimization routines for automatic reporting,\nanalysis, and error detection. Analyze user and experimental data and use engineering and analytical understanding to\nresolve battery problems. Provide ad-hoc analysis as necessary.Qualifications 1+ years of experience in software\nengineering/data science engineering. Proficient in Python for data processing and analysis tool development. Proficient\nin Linux/Unix (Bash and Shell). Proficient in C for software development Proficient in revision control software such as\nGitHub. Strong working knowledge in designing, building, and maintaining data ETL pipeline. Experience in SQL.\nExperience in database modeling and data warehousing principles. Familiarity with job scheduling system. Experience in\ndata science and analytics, statistical analyses, A/B testing and conducting experiments and investigations in large-\nscale usage data environment. Self-started with a proven ability to handle multiple tasks with strict deadlines. Proven\ncreativity to go beyond current tools to deliver best solution to the problem. Outstanding problem solving, critical\nthinking and interpersonal skills.PayRate: $50-55/hr, W2",
        "location": "Cupertino, CA (Hybrid)",
        "salary": "$50-55/hr, W2",
        "job_function": "Information Technology",
        "industries": "Staffing and Recruiting",
        "employment_type": "Contract",
        "seniority_level": "Entry level",
        "education_level": "Unknown",
        "notes": "",
        "hiring_manager": "Unknown",
        "url": "https://www.linkedin.com/jobs/view/data-engineer-i-at-\nwinmax-3759969537?refId=ACNf%2FwdQfBNm%2BGsMg51brQ%3D%3D&trackingId=fh0BRiq22lWMZNjIne9stA%3D%3D&position=16&pageNum=0"
    }
]
