{
    "url": "https://www.linkedin.com/jobs/view/software-engineer-with-security-clearance-at-clearancejobs-3529479524?refId=P9sNFw9u52x8zIrH8miWeA%3D%3D&trackingId=b%2BndZf8KTcoubYuDJv7PYQ%3D%3D&position=1&pageNum=0",
    "id": "16c4e1d7-1b9f-5d3a-bf40-5790a44be7ca",
    "description": "\n        The anticipated base pay range for this position is $190,000–$240,000/year. Striveworks’ total compensation package includes a competitive base salary, annual performance-based equity grants, and a lucrative yearly cash bonus. The Role As a Software Engineer at Striveworks you’ll be challenged—and trusted—on day one to be a core contributor to the projects and direction of the company. You’re right for this challenge if you value and possess technical expertise and you push the boundaries of your own capabilities. In this vital work, you will design and implement system components such as data warehouses, analytics, and visualizations. You will automate workflows and focus on last-mile integrations for data platform components. You will contribute to ETL framework design and implementation, batch and stream processing, and application CI/CD. You’ll have the opportunity to take the models and algorithms developed by data scientists and optimize, deploy, and refine them in a real-world setting immediately. This role allows for a hybrid work environment within commutable distance from Fort Bragg, NC. You are not expected to be at Fort Bragg daily, but the role will require weekly onsite engagement. This role includes up to 15% travel to other customer locations on the East Coast. The Right Fit We spend a lot of time during our hiring process talking about shared values. Why? We passionately believe that fostering an environment where people can self-actualize and pursue greatness is the best way to achieve our individual and collective goals. What does this mean for you? We want to provide you with the conditions to thrive in an environment where you can achieve your goals, where you know the team shares your goals, and where you make and accept decisions for the team with humility. At Striveworks, we want your say/do ratio to be 1 and to know that being part of a top-tier team means that there is no smartest person in the room. If that makes sense, we’re already on the same page. Here's what we're looking for:2+ years relevant experience and/or B.S. degree in computer science, machine learning, or related disciplineActive Secret Security Clearance, with Top Secret eligibilityExperience with Python and JavaScriptExperience with standard tooling: Git, Docker, CI/CD toolsProficiency in building application deployment pipelinesExperience implementing ETL pipelinesAbility to design, implement, and document scalable codeKnowledge of database design and architectureExperience implementing RESTful APIsExperience designing and delivering custom prototype interfacesDriven, self-directed personalityStrong sense of mission and commitment to making a differenceAble and willing to travel up to 15% The Wish List We’re very interested in candidates who possess the above qualifications, and we appreciate experience with:Knowledge of messaging systems, especially Kafka, RabbitMQ, or similarKnowledge of application frameworks, such as Django, Flask, FastAPI, or similarUnderstanding of JavaScript frameworks such as React, Vue, or AngularExperience designing RESTful or GraphQL APIsUnderstanding of synchronous/asynchronous programming, concurrencyUnderstanding of networked and distributed computing (gRPC)Experience with workflow automationFamiliarity with AI modelsFamiliarity with large data libraries (NumPy, Panda) The BenefitsTop-of-market salary and total compensationGenerous equity planHealth/vision/dental insuranceChildcare leaveFlexible PTO Striveworks: Better Models, Faster The world has looked to data analytics to bridge the gap between floods of data and the struggle to use that data effectively to make timely, impactful decisions. Today, most organizations are awash in analytics that “aren’t quite right”—models that were developed too generally, or too slowly, to be effective in dynamic, fast-paced environments. Striveworks is simplifying ModelOps with a powerful and extensible platform that instantiates the data analytic process as code. Striveworks is trusted by leading Fortune 500 firms as well as leaders in the public sector as a primary solution for managing model development, monitoring, and governance—and ensuring those models solve the real challenges their organizations face. Striveworks’ Chariot platform enables users to turn their own production data into models and turn models into production systems. Uniquely, as you train, test, deploy, and use models, our lineage system enables you to track not only the “upstream” provenance of model and data sources, but also the “downstream” usage of the resultant model inferences. Combining this with a principled experience for data and model development, Chariot gives our customers in highly regulated industries an unmatched governance solution over the top of a performant ModelOps platform. Striveworks is an Equal Opportunity Employer and does not discriminate in employment on the basis of race, color, religion or belief, sex (including pregnancy and gender identity or expression), national origin, social or ethnic origin, political affiliation, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service, or other non-merit factor. Striveworks will not tolerate discrimination or harassment of any kind. If you require assistance or a reasonable accommodation in the application process, please contact Operations atStriveworks is a participating employer in the E-Verify program.\n      ",
    "title": null,
    "company": null,
    "location": null,
    "salary": null,
    "seniority_level": "\n            Entry level\n          ",
    "employment_type": "\n          Full-time\n        ",
    "job_function": "\n            Engineering and Information Technology\n          ",
    "industries": "\n          Defense and Space Manufacturing\n          ",
    "hiring_manager": null
}